AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
/*
 * Copyright (c) 2020, Ambiq Micro, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 * notice, this list of conditions and the following disclaimer in the
 * documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 * contributors may be used to endorse or promote products derived from this
 * software without specific prior written permission.
 *
 * Third party software included in this distribution is subject to the
 * additional license terms as defined in the /docs/licenses directory.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * @file     apollo4.h
 * @brief    CMSIS HeaderFile
 * @version  1.0
 * @date     12. October 2020
 * @note     Generated by SVDConv V3.3.35 on Monday, 12.10.2020 13:27:21
 *           from File './apollo4.svd',
 *           last modified on Monday, 12.10.2020 18:27:19
 */



/** @addtogroup Ambiq Micro
  * @{
  */


/** @addtogroup apollo4
  * @{
  */


#ifndef APOLLO4_H
#define APOLLO4_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M4 Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn     = -12,              /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                     and No Match                                                              */
  BusFault_IRQn             = -11,              /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                     related Fault                                                             */
  UsageFault_IRQn           = -10,              /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn         =  -4,              /*!< -4 Debug Monitor                                                          */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* ==========================================  apollo4 Specific Interrupt Numbers  =========================================== */
  BROWNOUT_IRQn             =   0,              /*!< 0  BROWNOUT IRQ                                                           */
  WDT_IRQn                  =   1,              /*!< 1  WDT IRQ                                                                */
  RTC_IRQn                  =   2,              /*!< 2  RTC IRQ                                                                */
  VCOMP_IRQn                =   3,              /*!< 3  VCOMP IRQ                                                              */
  IOSLAVE_IRQn              =   4,              /*!< 4  IOSLAVE IRQ                                                            */
  IOSLAVEACC_IRQn           =   5,              /*!< 5  IOSLAVEACC IRQ                                                         */
  IOMSTR0_IRQn              =   6,              /*!< 6  IOMSTR0 IRQ                                                            */
  IOMSTR1_IRQn              =   7,              /*!< 7  IOMSTR1 IRQ                                                            */
  IOMSTR2_IRQn              =   8,              /*!< 8  IOMSTR2 IRQ                                                            */
  IOMSTR3_IRQn              =   9,              /*!< 9  IOMSTR3 IRQ                                                            */
  IOMSTR4_IRQn              =  10,              /*!< 10 IOMSTR4 IRQ                                                            */
  IOMSTR5_IRQn              =  11,              /*!< 11 IOMSTR5 IRQ                                                            */
  IOMSTR6_IRQn              =  12,              /*!< 12 IOMSTR6 IRQ                                                            */
  IOMSTR7_IRQn              =  13,              /*!< 13 IOMSTR7 IRQ                                                            */
  TIMER_IRQn                =  14,              /*!< 14 TIMER IRQ                                                              */
  UART0_IRQn                =  15,              /*!< 15 UART0 IRQ                                                              */
  UART1_IRQn                =  16,              /*!< 16 UART1 IRQ                                                              */
  UART2_IRQn                =  17,              /*!< 17 UART2 IRQ                                                              */
  UART3_IRQn                =  18,              /*!< 18 UART3 IRQ                                                              */
  ADC_IRQn                  =  19,              /*!< 19 ADC IRQ                                                                */
  MSPI0_IRQn                =  20,              /*!< 20 MSPI0 IRQ                                                              */
  MSPI1_IRQn                =  21,              /*!< 21 MSPI1 IRQ                                                              */
  MSPI2_IRQn                =  22,              /*!< 22 MSPI2 IRQ                                                              */
  CLKGEN_IRQn               =  23,              /*!< 23 CLKGEN IRQ                                                             */
  CRYPTOSEC_IRQn            =  24,              /*!< 24 CRYPTOSEC IRQ                                                          */
  SDIO_IRQn                 =  26,              /*!< 26 SDIO IRQ                                                               */
  USB0_IRQn                 =  27,              /*!< 27 USB0 IRQ                                                               */
  GPU_IRQn                  =  28,              /*!< 28 GPU IRQ                                                                */
  DC_IRQn                   =  29,              /*!< 29 DC IRQ                                                                 */
  DSI_IRQn                  =  30,              /*!< 30 DSI IRQ                                                                */
  STIMER_CMPR0_IRQn         =  32,              /*!< 32 STIMER_CMPR0 IRQ                                                       */
  STIMER_CMPR1_IRQn         =  33,              /*!< 33 STIMER_CMPR1 IRQ                                                       */
  STIMER_CMPR2_IRQn         =  34,              /*!< 34 STIMER_CMPR2 IRQ                                                       */
  STIMER_CMPR3_IRQn         =  35,              /*!< 35 STIMER_CMPR3 IRQ                                                       */
  STIMER_CMPR4_IRQn         =  36,              /*!< 36 STIMER_CMPR4 IRQ                                                       */
  STIMER_CMPR5_IRQn         =  37,              /*!< 37 STIMER_CMPR5 IRQ                                                       */
  STIMER_CMPR6_IRQn         =  38,              /*!< 38 STIMER_CMPR6 IRQ                                                       */
  STIMER_CMPR7_IRQn         =  39,              /*!< 39 STIMER_CMPR7 IRQ                                                       */
  STIMER_OVF_IRQn           =  40,              /*!< 40 STIMER_OVF IRQ                                                         */
  AUDADC0_IRQn              =  42,              /*!< 42 AUDADC0 IRQ                                                            */
  DSPI2S0_IRQn              =  44,              /*!< 44 DSPI2S0 IRQ                                                            */
  DSPI2S1_IRQn              =  45,              /*!< 45 DSPI2S1 IRQ                                                            */
  DSPI2S2_IRQn              =  46,              /*!< 46 DSPI2S2 IRQ                                                            */
  DSPI2S3_IRQn              =  47,              /*!< 47 DSPI2S3 IRQ                                                            */
  PDM0_IRQn                 =  48,              /*!< 48 PDM0 IRQ                                                               */
  PDM1_IRQn                 =  49,              /*!< 49 PDM1 IRQ                                                               */
  PDM2_IRQn                 =  50,              /*!< 50 PDM2 IRQ                                                               */
  PDM3_IRQn                 =  51,              /*!< 51 PDM3 IRQ                                                               */
  DSP0IDMATRIGOUT_IRQn      =  52,              /*!< 52 DSP0IDMATRIGOUT IRQ                                                    */
  DSP1IDMATRIGOUT_IRQn      =  53,              /*!< 53 DSP1IDMATRIGOUT IRQ                                                    */
  MEMCPYDMA0_IRQn           =  54,              /*!< 54 MEMCPYDMA0 IRQ                                                         */
  GPIO0_001F_IRQn           =  56,              /*!< 56 GPIO0_001F IRQ                                                         */
  GPIO0_203F_IRQn           =  57,              /*!< 57 GPIO0_203F IRQ                                                         */
  GPIO0_405F_IRQn           =  58,              /*!< 58 GPIO0_405F IRQ                                                         */
  GPIO0_607F_IRQn           =  59,              /*!< 59 GPIO0_607F IRQ                                                         */
  GPIO1_001F_IRQn           =  60,              /*!< 60 GPIO1_001F IRQ                                                         */
  GPIO1_203F_IRQn           =  61,              /*!< 61 GPIO1_203F IRQ                                                         */
  GPIO1_405F_IRQn           =  62,              /*!< 62 GPIO1_405F IRQ                                                         */
  GPIO1_607F_IRQn           =  63,              /*!< 63 GPIO1_607F IRQ                                                         */
  CPUCPUMB_IRQn             =  64,              /*!< 64 CPUCPUMB IRQ                                                           */
  DSWP0CPUMB_IRQn           =  65,              /*!< 65 DSWP0CPUMB IRQ                                                         */
  DSWP1CPUMB_IRQn           =  66,              /*!< 66 DSWP1CPUMB IRQ                                                         */
  TIMER0_IRQn               =  67,              /*!< 67 TIMER0 IRQ                                                             */
  TIMER1_IRQn               =  68,              /*!< 68 TIMER1 IRQ                                                             */
  TIMER2_IRQn               =  69,              /*!< 69 TIMER2 IRQ                                                             */
  TIMER3_IRQn               =  70,              /*!< 70 TIMER3 IRQ                                                             */
  TIMER4_IRQn               =  71,              /*!< 71 TIMER4 IRQ                                                             */
  TIMER5_IRQn               =  72,              /*!< 72 TIMER5 IRQ                                                             */
  TIMER6_IRQn               =  73,              /*!< 73 TIMER6 IRQ                                                             */
  TIMER7_IRQn               =  74,              /*!< 74 TIMER7 IRQ                                                             */
  TIMER8_IRQn               =  75,              /*!< 75 TIMER8 IRQ                                                             */
  TIMER9_IRQn               =  76,              /*!< 76 TIMER9 IRQ                                                             */
  TIMER10_IRQn              =  77,              /*!< 77 TIMER10 IRQ                                                            */
  TIMER11_IRQn              =  78,              /*!< 78 TIMER11 IRQ                                                            */
  TIMER12_IRQn              =  79,              /*!< 79 TIMER12 IRQ                                                            */
  TIMER13_IRQn              =  80,              /*!< 80 TIMER13 IRQ                                                            */
  TIMER14_IRQn              =  81,              /*!< 81 TIMER14 IRQ                                                            */
  TIMER15_IRQn              =  82,              /*!< 82 TIMER15 IRQ                                                            */
  CACHE_IRQn                =  83,              /*!< 83 CACHE IRQ                                                              */
  MAX_IRQn                  =  84               /*!< 84 Not a valid IRQ. The maximum IRQ is this value - 1.                    */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ===========================  Configuration of the ARM Cortex-M4 Processor and Core Peripherals  =========================== */
#define __CM4_REV                 0x0100U       /*!< CM4 Core Revision                                                         */
#define __NVIC_PRIO_BITS               3        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __MPU_PRESENT                  1        /*!< MPU present                                                               */
#define __FPU_PRESENT                  1        /*!< FPU present                                                               */


/** @} */ /* End of group Configuration_of_CMSIS */

#if 1 // xtensa
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */
#else // xtensa
#include "core_cm4.h"                           /*!< ARM Cortex-M4 processor and core peripherals                              */
#include "system_apollo4.h"                     /*!< apollo4 System                                                            */
#endif // xtensa

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog Digital Converter Control (ADC)
  */

typedef struct {                                /*!< (@ 0x40038000) ADC Structure                                              */

  union {
    __IOM uint32_t CFG;                         /*!< (@ 0x00000000) The ADC Configuration Register contains the software
                                                                    control for selecting the clock frequency
                                                                    used for the SAR conversions, the trigger
                                                                    polarity, the trigger select, the reference
                                                                    voltage select, the low power mode, the
                                                                    operating mode (single scan per trigger
                                                                    vs. repeating mode) and ADC enable.                        */

