AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
    struct {
      __IOM uint32_t DIVIDEVALUE : 6;           /*!< [5..0] Value of first clock divider                                       */
      __IOM uint32_t RSVD0      : 2;            /*!< [7..6] This bitfield is reserved.                                         */
      __IOM uint32_t LINENUM    : 6;            /*!< [13..8] Number of lines to be prefetched before starting the
                                                     frame through DMA. Maximum value is 32                                    */
      __IOM uint32_t RSVD1      : 2;            /*!< [15..14] This bitfield is reserved.                                       */
      __IOM uint32_t PLL        : 8;            /*!< [23..16] Select PLL Clock                                                 */
      __IOM uint32_t LVDS       : 3;            /*!< [26..24] Clock phase shift value for LVDS operation                       */
      __IOM uint32_t SECCLKDIV  : 5;            /*!< [31..27] Value of secondary clock divider                                 */
    } CLKCTRL_b;
  } ;

  union {
    __IOM uint32_t BGCOLOR;                     /*!< (@ 0x00000008) Specifies the main background color.                       */

    struct {
      __IOM uint32_t ALPHACOLOR : 8;            /*!< [7..0] Color alpha is used as background color                            */
      __IOM uint32_t BLUECOLOR  : 8;            /*!< [15..8] Color blue is used as background color                            */
      __IOM uint32_t GREENCOLOR : 8;            /*!< [23..16] Color green is used as background color                          */
      __IOM uint32_t REDCOLOR   : 8;            /*!< [31..24] Color red is used as background color                            */
    } BGCOLOR_b;
  } ;

  union {
    __IOM uint32_t RESXY;                       /*!< (@ 0x0000000C) Specifies the main X and Y resolutions.                    */

    struct {
      __IOM uint32_t YRES       : 16;           /*!< [15..0] Value of Y resolution in pixels                                   */
      __IOM uint32_t XRES       : 16;           /*!< [31..16] Value of X resolution in pixels                                  */
    } RESXY_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t FRONTPORCHXY;                /*!< (@ 0x00000014) Specifies the X and Y dimensions for the Front
                                                                    Porch.                                                     */

    struct {
      __IOM uint32_t FLINES     : 16;           /*!< [15..0] Specify the number of lines for the front porch Y dimension       */
      __IOM uint32_t FPCLKCYCLES : 16;          /*!< [31..16] Specify the pixel clock cycles for the front porch
                                                     X dimension                                                               */
    } FRONTPORCHXY_b;
  } ;

  union {
    __IOM uint32_t BLANKINGXY;                  /*!< (@ 0x00000018) Specifies the X and Y dimensions for the Blanking
                                                                    Period.                                                    */

    struct {
      __IOM uint32_t VSYNCLINES : 16;           /*!< [15..0] Specify the VSYNC lines for the Y dimension blanking
                                                     period                                                                    */
      __IOM uint32_t HSYNCPULSE : 16;           /*!< [31..16] Specify the HSYNC pulse length for the X dimension
                                                     blanking period                                                           */
    } BLANKINGXY_b;
  } ;

  union {
    __IOM uint32_t BACKPORCHXY;                 /*!< (@ 0x0000001C) Specifies the X and Y dimensions for the Back
                                                                    Porch.                                                     */

    struct {
      __IOM uint32_t BLINES     : 16;           /*!< [15..0] Specify the number of lines for the back porch Y dimension        */
      __IOM uint32_t BPCLKCYCLES : 16;          /*!< [31..16] Specify the pixel clock cycles for the back porch X
                                                     dimension                                                                 */
    } BACKPORCHXY_b;
  } ;

  union {
    __IOM uint32_t CURSORXY;                    /*!< (@ 0x00000020) Specifies the cursor's start X and Y coordinates.          */

    struct {
      __IOM uint32_t CURSORY    : 16;           /*!< [15..0] Specify cursor's Y dimension                                      */
      __IOM uint32_t CURSORX    : 16;           /*!< [31..16] Specify cursor's X dimension                                     */
    } CURSORXY_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t DBICFG;                      /*!< (@ 0x00000028) Register for the configuration DBI Type-B interface
                                                                    and the activation of SPI 3-/4-wire interfaces.            */

    struct {
      __IOM uint32_t DBICOLORFMT : 3;           /*!< [2..0] Set the color format for DBI interface                             */
      __IOM uint32_t DATAWDORDER : 3;           /*!< [5..3] Set the data order of the 8-bit data word:                         */
      __IOM uint32_t TYPEBWIDTH : 2;            /*!< [7..6] Set DBI Type-B interface width (8, 9 or 16 bits) and
                                                     the serial interface:                                                     */
      __IOM uint32_t RSVD0      : 3;            /*!< [10..8] This bitfield is reserved.                                        */
      __IOM uint32_t BACKPRESSUREEN : 1;        /*!< [11..11] When set to 1, back pressure support is enabled (not
                                                     currently supported)                                                      */
      __IOM uint32_t RSVD1      : 4;            /*!< [15..12] This bitfield is reserved.                                       */
      __IOM uint32_t INVHRZLINE : 1;            /*!< [16..16] When set to 1, inverts the bit-order of the horizontal
                                                     line address (used along with DBI_CFG[17] register bit)                   */
      __IOM uint32_t BINDCMDS   : 1;            /*!< [17..17] When set to 1, binds the store commands with the RGB
                                                     data and two-byte address is sent with each horizontal
                                                     line                                                                      */
      __IOM uint32_t RSVD2      : 4;            /*!< [21..18] This bitfield is reserved.                                       */
      __IOM uint32_t SPI4       : 1;            /*!< [22..22] When set to 1, SPI 4-wire interface is enabled                   */
      __IOM uint32_t SPI3       : 1;            /*!< [23..23] When set to 1, SPI 3-wire interface is enabled                   */
      __IOM uint32_t RSVD3      : 1;            /*!< [24..24] This bitfield is reserved.                                       */
      __IOM uint32_t RESXLOW    : 1;            /*!< [25..25] When set to 1, drives RESX signal low to reset DBI
                                                     Type-B interface                                                          */
      __IOM uint32_t RSVD4      : 2;            /*!< [27..26] This bitfield is reserved.                                       */
      __IOM uint32_t DBIBTEDIS  : 1;            /*!< [28..28] When set to 1, the DBIB_TE signal is disabled                    */
      __IOM uint32_t CSXSET     : 1;            /*!< [29..29] Sets the value of DBIB_CSX signal:                               */
      __IOM uint32_t CSXCFG     : 1;            /*!< [30..30] When set to 1, the value of the CSX signal of the DBI
                                                     interface can be configured from the DBI_CFG[29] register
                                                     bit                                                                       */
      __IOM uint32_t DBIINTACT  : 1;            /*!< [31..31] When set to 1, the DBI interface is activated                    */
    } DBICFG_b;
  } ;

  union {
    __IOM uint32_t DCGPIO;                      /*!< (@ 0x0000002C) General Purpose register: read/write GPIO external
                                                                    pins. This is accumulated as- {CGBYPASS_in,13'd0,ADVANCE_A
                                                                    YWAY_in,5'd0,GPIO_in}                                      */

