AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
    struct {
      __IOM uint32_t CLMDTSC4TSC6 : 1;          /*!< [0..0] Indicates that the TSc4/TSc6 propietary color format
                                                     is enabled                                                                */
      __IOM uint32_t CLMDTLYUV420 : 1;          /*!< [1..1] Indicates that the TLYUV420 color format is enabled                */
      __IOM uint32_t CLMDVYUV420 : 1;           /*!< [2..2] Indicates that the V_YUV420 color format is enabled                */
      __IOM uint32_t CLMDBGRA8888 : 1;          /*!< [3..3] Indicates that the BGRA8888 32-bit color format is enabled         */
      __IOM uint32_t CLMDABGR8888 : 1;          /*!< [4..4] Indicates that the ABGR8888 32-bit color format is enabled         */
      __IOM uint32_t CLMDYUY2   : 1;            /*!< [5..5] Indicates that the YUY2 color format is enabled                    */
      __IOM uint32_t CLMDRGB888 : 1;            /*!< [6..6] Indicates that the RGB888 24-bit color format is enabled           */
      __IOM uint32_t CLMDYUYV   : 1;            /*!< [7..7] Indicates that the YUYV color format is enabled                    */
      __IOM uint32_t CLMDL4     : 1;            /*!< [8..8] Indicates that the L4 color format is enabled                      */
      __IOM uint32_t CLMDL1     : 1;            /*!< [9..9] Indicates that the L1 color format is enabled                      */
      __IOM uint32_t CLMDL8     : 1;            /*!< [10..10] Indicates that the L8 color format is enabled                    */
      __IOM uint32_t CLMDARGB8888 : 1;          /*!< [11..11] Indicates that the ARGB8888 32-bit color format is
                                                     enabled                                                                   */
      __IOM uint32_t CLMDRGB565 : 1;            /*!< [12..12] Indicates that the RGB565 16-bit color format is enabled         */
      __IOM uint32_t CLMDRGB332 : 1;            /*!< [13..13] Indicates that the RGB332 8-bit color format is enabled          */
      __IOM uint32_t CLMDRGBA8888 : 1;          /*!< [14..14] Indicates that the RGBA8888 32-bit color format is
                                                     enabled                                                                   */
      __IOM uint32_t CLMDRGBA5551 : 1;          /*!< [15..15] Indicates that the RGBA5551 16-bit color format is
                                                     enabled                                                                   */
      __IOM uint32_t CLMDLUT8   : 1;            /*!< [16..16] Indicates that the LUT8 color format is enabled                  */
            uint32_t            : 14;
      __IOM uint32_t CLMDBKPRESSURE : 1;        /*!< [31..31] Indicates that back pressure support for the DBI Type
                                                     B interface is enabled                                                    */
    } COLMOD_b;
  } ;
  __IM  uint32_t  RESERVED3[32];

  union {
    __IOM uint32_t CRC;                         /*!< (@ 0x00000184) if cyclic redundancy errors occur, they are written
                                                                    in the CRC register.                                       */

    struct {
      __IOM uint32_t CRCREG     : 32;           /*!< [31..0] CRC value if CRC error exists                                     */
    } CRC_b;
  } ;
  __IM  uint32_t  RESERVED4[158];

  union {
    __IOM uint32_t GLLUT;                       /*!< (@ 0x00000400) R[0]G[0]B[0] thru R[255]G[255]B[255] Global palette,
                                                                    gamma correction memory region where x starts
                                                                    at 0 thru 255.Access to all 256 registers
                                                                    is best accomplished by passing an index
                                                                    via a macro. e.g. pseudocode #define DC_L0LUT(n)
                                                                    (*((volatile uint32_t*)(&L0LUT + (4*n))))                  */

    struct {
      __IOM uint32_t GLLUT0GAMRAMPB : 8;        /*!< [7..0] Gamma ramp blue bits                                               */
      __IOM uint32_t GLLUT0GAMRAMPG : 8;        /*!< [15..8] Gamma ramp green bits                                             */
      __IOM uint32_t GLLUT0GAMRAMPR : 8;        /*!< [23..16] Gamma ramp red bits                                              */
            uint32_t            : 8;
    } GLLUT_b;
  } ;
  __IM  uint32_t  RESERVED5[255];

  union {
    __IOM uint32_t CURSORDATA;                  /*!< (@ 0x00000800) Color values for the pixel cursor that are used
                                                                    with the Cursor LUT where x starts at 0
                                                                    thru 127.Access to all 16 registers is best
                                                                    accomplished by passing an index via a macro.
                                                                    e.g. pseudocode #define DC_CURSORDATA(n)
                                                                    (*((volatile uint32_t*)(&CURSORDATA + (4*n))))             */

    struct {
      __IOM uint32_t CURDATA70  : 8;            /*!< [7..0] Pixel 'xy' color look up bits                                      */
            uint32_t            : 4;
      __IOM uint32_t CURDATA3112 : 20;          /*!< [31..12] Pixel 'xy' color look up bits                                    */
    } CURSORDATA_b;
  } ;
  __IM  uint32_t  RESERVED6[127];

  union {
    __IOM uint32_t CURSORLUT;                   /*!< (@ 0x00000A00) R[0]G[0]B[0] thru R[15]G[15]B[15] Cursor Look-up
                                                                    Table where x starts at 0 thru 15.Access
                                                                    to all 16 registers is best accomplished
                                                                    by passing an index via a macro. e.g. pseudocode
                                                                    #define DC_CURSORLUT(n) (*((volatile uint32_t*)(&CURSORLUT
                                                                    + (4*n))))                                                 */

