AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
typedef struct {                                /*!< (@ 0x400A8000) DSI Structure                                              */

  union {
    __IOM uint32_t DEVICEREADY;                 /*!< (@ 0x00000000) Devide Ready register                                      */

    struct {
      __IOM uint32_t READY      : 1;            /*!< [0..0] Ready for programming after all count registers and timeout.       */
      __IOM uint32_t ULPS       : 2;            /*!< [2..1] FIXME - Bitfield description needed here.                          */
      __IOM uint32_t DISPLAYBUSPOSSESSEN : 1;   /*!< [3..3] Inform DSI receiver has to be given the bus possession
                                                     for receiving the tearing effect trigger message; Reset
                                                     by the processor to stop the bus possession of the DSI
                                                     receiver; Note: Tearing effect is supported only in Type1;
                                                     Display Architecture (command mode only) as suggested by
                                                     Display Command Set Specification; Note1: Even if the processor
                                                     does not clear the display_bus_possession bit after receiving
                                                     the interrupt for tearing effect, DSI-tx controller starts
                                                     the activities on the DSI link once the TE t                              */
            uint32_t            : 28;
    } DEVICEREADY_b;
  } ;

  union {
    __IOM uint32_t INTRSTAT;                    /*!< (@ 0x00000004) The interrupt status register.                             */

    struct {
      __IOM uint32_t RXSOTERROR : 1;            /*!< [0..0] (RW1C) Set to 1 if a start of transmission sequence error
                                                     is reported in the Acknowledge packet by the display device               */
      __IOM uint32_t RXSOTSYNCERROR : 1;        /*!< [1..1] (RW1C) Set to 1 if synchronisation error occurrence in
                                                     the start of transmission sequence is reported in the acknowledge
                                                     packet by the display device                                              */
      __IOM uint32_t RXEOTSYNCERROR : 1;        /*!< [2..2] (RW1C) Set to 1 if End of transmission synchronisation
                                                     Error is reported in the acknowledgment packet by the display
                                                     device                                                                    */
      __IOM uint32_t RXESCAPEMODE : 1;          /*!< [3..3] (RW1C) Entry Error; Set to 1 if Escape Mode Entry command
                                                     is not understandable by the display device and is reported
                                                     in the Acknowledge packet by the display device.                          */
      __IOM uint32_t RXLPTXSYNCERR : 1;         /*!< [4..4] (RW1C) Rx LP tx sync error; Set to 1 if Low power transmission
                                                     sync error occurs in the display device and is reported
                                                     in the Acknowledge packet by the display device                           */
      __IOM uint32_t RXPERIPHERAL : 1;          /*!< [5..5] (RW1C) Rx Peripheral timeout Error; Set to 1 if the high
                                                     speed receive timer value or LP Tx timer value are expired,
                                                     display device is reported in the Acknowledge packet                      */
      __IOM uint32_t RXFALSECNTRL : 1;          /*!< [6..6] (RW1C) RxFalse Control Error; Set to 1 if a control error
                                                     is reported in the acknowledge packet by the display device               */
      __IOM uint32_t RxECCS     : 1;            /*!< [7..7] (RW1C) RRxECC single bit error; Set to 1 if ECC syndrome
                                                     was computed and corrected for one bit error is reported
                                                     in the Acknowledge packet by the display device                           */
      __IOM uint32_t RxECCM     : 1;            /*!< [8..8] (RW1C) RxECC multibit error; Set to 1 if there is no
                                                     ECC correction for the packet or there are more than 2
                                                     bit errors in the packet isreported in the Acknowledge
                                                     packet by the display device                                              */
      __IOM uint32_t RXCHECKSUM : 1;            /*!< [9..9] (RW1C) Set to 1 if the computed CRC differs from the
                                                     received CRC value and is reported in the acknowledge packet
                                                     by the display device                                                     */
      __IOM uint32_t RxDSINR    : 1;            /*!< [10..10] (RW1C) RxDSI data type not recognised; Set to 1 if
                                                     the data type is not recognised by the display device is
                                                     reported in the Acknowledge packet by the display device                  */
      __IOM uint32_t RxDSIDI    : 1;            /*!< [11..11] (RW1C) RxDSI VC ID invalid; Set to 1 if the virtual
                                                     channel ID is invalid by the display device is reported
                                                     in the Acknowledge packet by the display device                           */
      __IOM uint32_t TXFALSECNTRL : 1;          /*!< [12..12] (RW1C) TxFalse Control Error; Set to 1 if a control
                                                     error is observed on the lanes by the Arasan_DSI_host                     */
      __IOM uint32_t TXECCS     : 1;            /*!< [13..13] (RW1C) Set to 1 if ECC syndrome was computed and is
                                                     corrected for one bit error during the reception of packets
                                                     by the Arasan_DSI_host.                                                   */
      __IOM uint32_t TXECCM     : 1;            /*!< [14..14] (RW1C) Set to 1 if there is no ECC correction for the
                                                     packet or there are more than 2 bit errors in the packet
                                                     received by Arasan_DSI_host.                                              */
      __IOM uint32_t TXCHECKSUM : 1;            /*!< [15..15] (RW1C) Txchecksum error; Set to 1 if the computed CRC
                                                     differs from the received CRC value during the reception
                                                     of packets by Arasan_DSI host                                             */
      __IOM uint32_t TxDSIN     : 1;            /*!< [16..16] (RW1C) TxDSI data type not recognised; Set to 1 if
                                                     the received data type is not recognised                                  */
      __IOM uint32_t TxDSII     : 1;            /*!< [17..17] (RW1C) TxDSI VC ID invalid; Set to 1 if the received
                                                     virtual channel ID is invalid                                             */
      __IOM uint32_t HIGHC      : 1;            /*!< [18..18] (RW1C) High contention;Set to 1 if a LP high fault
                                                     is registered by at the D-PHY contention detector. If this
                                                     interrupt is set device should be re-enumerated                           */
      __IOM uint32_t LOWC       : 1;            /*!< [19..19] (RW1C) Low contention; Set to 1 if a LP low fault is
                                                     registered by at the D-PHY contention detector. If this
                                                     interrupt is set device should be re-enumerated                           */
      __IOM uint32_t FIFOEMPTY  : 1;            /*!< [20..20] (RW1C) Set to 1 if all FIFOs are empty                           */
      __IOM uint32_t HSTXTIMEOUT : 1;           /*!< [21..21] (RW1C) Set if a high speed transmission prevails for
                                                     more than the expected count value this interrupt is raised               */
      __IOM uint32_t LPRXTIMEOUT : 1;           /*!< [22..22] (RW1C) Set if a low power reception count expires this
                                                     interrupt is generated                                                    */
      __IOM uint32_t TURNARNDACK : 1;           /*!< [23..23] (RW1C) Turn around acknowledge. Set if a turn around
                                                     acknowledgement sequence is timeout not received from the
                                                     display device                                                            */
      __IOM uint32_t ACKWNOERR  : 1;            /*!< [24..24] (RW1C) T ACK_with No_error; Set if acknowledge trigger
                                                     message is received with out any error.                                   */
      __IOM uint32_t RXINVALID  : 1;            /*!< [25..25] (RW1C) Rx Invalid; Set if acknowledge short packet
                                                     shows an invalid transmission count                                       */
      __IOM uint32_t RXDSIPROT  : 1;            /*!< [26..26] (RW1C) Rx DSI protocol violation; Set if acknowledge
                                                     short packet shows DSI protocol violation error                           */
      __IOM uint32_t SPECIALPACK : 1;           /*!< [27..27] (RW1C) Special packet command sent; Set to confirm
                                                     the transmission of the DPI event specific commands set
                                                     in the dpi control and dpi data                                           */
      __IOM uint32_t INITDONE   : 1;            /*!< [28..28] (RW1C) Set 1 indicates that the DSI initialization
                                                     is done. DSI Tx is ready to accept the DPI or DBI or Generic
                                                     transfer                                                                  */
      __IOM uint32_t RXCNT      : 1;            /*!< [29..29] (RW1C) Rx Contention; Set to 1 if contention detected
                                                     in the display                                                            */
      __IOM uint32_t DPILINETO  : 1;            /*!< [30..30] (RW1C) DPI line time out. Set to 1 indicates that the
                                                     line time out during the DPI transfer                                     */
      __IOM uint32_t DPIPRGERR  : 1;            /*!< [31..31] (RW1C) Set to 1 indicates that the error in DPI parameters
                                                     programming                                                               */
    } INTRSTAT_b;
  } ;

  union {
    __IOM uint32_t INTREN;                      /*!< (@ 0x00000008) Interrupt enable register.                                 */

