AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
    struct {
      __IOM uint32_t TXTHLDSIGNALEN : 1;        /*!< [0..0] When set to 1'b1 AND field TX_THLD_STAT is set, asserts
                                                     interrupt to Host.                                                        */
      __IOM uint32_t RXTHLDSIGNALEN : 1;        /*!< [1..1] When set to 1'b1 AND field RX_THLD_STAT is set, asserts
                                                     interrupt to Host.                                                        */
      __IOM uint32_t IBITHLDSIGNALEN : 1;       /*!< [2..2] When set to 1'b1 AND field IBI_THLD_STAT is set, asserts
                                                     interrupt to Host.                                                        */
      __IOM uint32_t CMDQUEUEREADYSIGNALEN : 1; /*!< [3..3] When set to 1'b1 AND field CMD_QUEUE_READY_STAT is set,
                                                     asserts interrupt to Host.                                                */
      __IOM uint32_t RESPREADYSIGNALEN : 1;     /*!< [4..4] When set to 1'b1 AND field RESP_READY_STAT is set, asserts
                                                     interrupt to Host.                                                        */
      __IOM uint32_t TRANSFERABORTSIGNALEN : 1; /*!< [5..5] When set to 1'b1 AND field TRANSFER_ABORT_STAT is set,
                                                     asserts interrupt to Host.                                                */
            uint32_t            : 3;
      __IOM uint32_t TRANSFERERRSIGNALEN : 1;   /*!< [9..9] When set to 1'b1 AND field TRANSFER_ERR_STAT is set,
                                                     asserts interrupt to Host.                                                */
            uint32_t            : 22;
    } PIOINTRSIGNALENABLE_b;
  } ;

  union {
    __IOM uint32_t PIOINTRFORCE;                /*!< (@ 0x0000052C) PIO_INTR_FORCE                                             */

    struct {
      __IOM uint32_t TXTHLDFORCE : 1;           /*!< [0..0] For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
      __IOM uint32_t RXTHLDFORCE : 1;           /*!< [1..1] For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
      __IOM uint32_t IBITHLDFORCE : 1;          /*!< [2..2] For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
      __IOM uint32_t CMDQUEUEREADYFORCE : 1;    /*!< [3..3] For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
      __IOM uint32_t RESPREADYFORCE : 1;        /*!< [4..4] For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
      __IOM uint32_t TRANSFERABORTFORCE : 1;    /*!< [5..5] For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
            uint32_t            : 3;
      __IOM uint32_t TRANSFERERRFORCE : 1;      /*!< [9..9] For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
            uint32_t            : 22;
    } PIOINTRFORCE_b;
  } ;
  __IM  uint32_t  RESERVED7[116];

  union {
    __IOM uint32_t EXTCAPHEADER;                /*!< (@ 0x00000700) EXTCAP_HEADER                                              */

    struct {
      __IOM uint32_t CAPID      : 8;            /*!< [7..0] Extended Capability ID Values: 0x00: Not a capability
                                                     ID, indicates end of the Extended Capability list 0x01
                                                     0xFF: Capability IDs,                                                     */
      __IOM uint32_t CAPLENGTH  : 16;           /*!< [23..8] Capability Structure Length in DWORDs The length includes
                                                     the EXTCAP_HEADER, and indicates the base address of the
                                                     next Extended Capability in the list.                                     */
            uint32_t            : 8;
    } EXTCAPHEADER_b;
  } ;

  union {
    __IOM uint32_t COMPMANUFACTURER;            /*!< (@ 0x00000704) COMP_MANUFACTURER                                          */

    struct {
      __IOM uint32_t MIPIVENDORID : 32;         /*!< [31..0] MIPI Vendor ID MIPI Manufacturer ID Error! Reference
                                                     source not found..                                                        */
    } COMPMANUFACTURER_b;
  } ;

  union {
    __IOM uint32_t COMPVERSION;                 /*!< (@ 0x00000708) COMP_VERSION                                               */

    struct {
      __IOM uint32_t I3CVERID   : 32;           /*!< [31..0] Host Controller Component Version Vendor-assigned Device
                                                     version.                                                                  */
    } COMPVERSION_b;
  } ;

  union {
    __IOM uint32_t COMPTYPE;                    /*!< (@ 0x0000070C) COMP_TYPE                                                  */

    struct {
      __IOM uint32_t I3CPRODUCTID : 32;         /*!< [31..0] Host Controller Component Type Vendor-assigned product
                                                     ID or type.                                                               */
    } COMPTYPE_b;
  } ;
  __IM  uint32_t  RESERVED8;

  union {
    __IOM uint32_t MASTERCONFIG;                /*!< (@ 0x00000714) MASTER_CONFIG                                              */

