AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
    struct {
            uint32_t            : 4;
      __IOM uint32_t OPERATIONMODE : 2;         /*!< [5..4] Master Operation Mode Host Controller modes supported.
                                                     Values: 0x1: Master functionality only 0x2: Slave functionality
                                                     only 0x3: Master or Secondary Master (Slave) functionality                */
            uint32_t            : 26;
    } MASTERCONFIG_b;
  } ;
  __IM  uint32_t  RESERVED9[58];

  union {
    __IOM uint32_t CRSETUP;                     /*!< (@ 0x00000800) CR_SETUP                                                   */

    struct {
      __IOM uint32_t RINGSIZE   : 8;            /*!< [7..0] Size of Command / Response ring. Driver shall allocate
                                                     (XFER_SZ * RING_SIZE) Bytes for Command Ring, and (RESP_SZ
                                                     * RING_SIZE) for Response Ring. Valid values 0-255. Table
                                                     26 : Command/Response Ring Control Register Fields                        */
            uint32_t            : 8;
      __IOM uint32_t RESPSTRUCTSIZE : 8;        /*!< [23..16] Response descriptor size, in Bytes. Size of the structure
                                                     describing response (Response Descriptor)                                 */
      __IOM uint32_t XFERSTRUCTSIZE : 8;        /*!< [31..24] Transfer descriptor size, in Bytes. Size of the structure
                                                     describing transfer (Transfer Descriptor)                                 */
    } CRSETUP_b;
  } ;

  union {
    __IOM uint32_t IBISETUP;                    /*!< (@ 0x00000804) IBI_SETUP                                                  */

    struct {
      __IOM uint32_t CHUNKCOUNT : 10;           /*!< [9..0] IBI Data Ring Chunk Count Number of Data Chunks on IBI
                                                     Data Ring. The size in bytes of the IBI Data Ring is CHUNK_COUNT
                                                     * CHUNK_SIZE. Valid Values: 0-0x3FF                                       */
      __IOM uint32_t CHUNKSIZE  : 3;            /*!< [12..10] IBI Data Ring Data Chunk Size Size per Data Chunk on
                                                     the IBI Data Ring. Values: 0: 4 bytes per Data Chunk 1:
                                                     8 bytes per Data Chunk 2: 16 bytes per Data Chunk 3: 32
                                                     bytes per Data Chunk 4: 64 bytes per Data Chunk 5: 128
                                                     bytes per Data Chunk 6: 256 bytes per Data Chunk 7: Reserved,
                                                     do not use                                                                */
            uint32_t            : 3;
      __IOM uint32_t IBISTATUSRINGSIZE : 8;     /*!< [23..16] IBI Status Ring Size IBI Status Ring size (in IBI Status
                                                     Descriptor entries). Valid Values: 0-255                                  */
      __IOM uint32_t IBISTATUSSTRUCTSIZE : 8;   /*!< [31..24] IBI Status Structure Size IBI Status Descriptor structure
                                                     size (in bytes).                                                          */
    } IBISETUP_b;
  } ;

  union {
    __IOM uint32_t CHUNKCONTROL;                /*!< (@ 0x00000808) CHUNK_CONTROL                                              */

    struct {
      __IOM uint32_t CHUNKCOUNTER : 32;         /*!< [31..0] Chunk Counter This is a monotonic counter that the software
                                                     Driver would increment by the number of Chunks freed up,
                                                     providing the Host Controller with the number of Data Chunks
                                                     freed. The Driver software shall reset this field before
                                                     transitioning the Ring Bundle to the Enabled state. Table
                                                     28 : Chunk Control (CHUNK_CONTROL) Register                               */
    } CHUNKCONTROL_b;
  } ;
  __IM  uint32_t  RESERVED10;

  union {
    __IOM uint32_t RHINTRSTATUS;                /*!< (@ 0x00000810) RH_INTR_STATUS                                             */

    struct {
            uint32_t            : 5;
      __IOM uint32_t TRANSFERABORTSTAT : 1;     /*!< [5..5] Transfer Abort Status The Host Controller shall write
                                                     1'b1 to this field to indicate that a transfer operation
                                                     has been aborted. To clear, write 1'b0 to this bit.                       */
            uint32_t            : 3;
      __IOM uint32_t TRANSFERERRSTAT : 1;       /*!< [9..9] Transfer Error Status The Host Controller shall write
                                                     1'b1 to this field to indicate that an error (i.e., any
                                                     error) has occurred during an I3C Bus transfer. The Error
                                                     Type for this error event can be found in the Response
                                                     Descriptor structure corresponding to this transfer. To
                                                     clear, write 1'b0 to this bit.                                            */
      __IOM uint32_t RINGOPSTAT : 1;            /*!< [10..10] Ring Operation Status The Host Controller shall write
                                                     1'b1 to this field to indicate that the Rings state has
                                                     changed to Running, Aborted, or Stopped. To clear, write
                                                     1'b0 to this bit.                                                         */
      __IOM uint32_t TRANSFERCOMPLETIONSTAT : 1;/*!< [11..11] Transfer Completion Status The Host Controller shall
                                                     write 1'b1 to this field to indicate successful completion
                                                     of a transfer, for all Transfer Descriptors featuring IOC.
                                                     To clear, write 1'b0 to this bit.                                         */
      __IOM uint32_t IBIREADYSTAT : 1;          /*!< [12..12] IBI Ready Status The Host Controller shall write 1'b1
                                                     to this field to indicate that an IBI has been received.
                                                     To clear, write 1'b0 to this bit.                                         */
            uint32_t            : 19;
    } RHINTRSTATUS_b;
  } ;

  union {
    __IOM uint32_t RHINTRSTATUSENABLE;          /*!< (@ 0x00000814) RH_INTR_STATUS_ENABLE                                      */

