AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
    struct {
      __IOM uint32_t DEVADDR    : 10;           /*!< [9..0] I2C address of the device that the Master will use to
                                                     target for read/write operations. This can be either a
                                                     7b or 10b address.                                                        */
            uint32_t            : 22;
    } DEVCFG_b;
  } ;
  __IM  uint32_t  RESERVED4[14];

  union {
    __IOM uint32_t I2SCTRL;                     /*!< (@ 0x00000300) Sets the operation mode of the I2S master slave
                                                                    module                                                     */

    struct {
      __IOM uint32_t I2SEN      : 1;            /*!< [0..0] Setting this bit will start the I2S master/slave module            */
      __IOM uint32_t RXTXN      : 1;            /*!< [1..1] Sets the direction of transfer for the I2S module as
                                                     receive (1) or transmit (0).                                              */
      __IOM uint32_t CLKMS      : 1;            /*!< [2..2] Selects clock master (0) or clock slave (1) mode                   */
      __IOM uint32_t SE         : 1;            /*!< [3..3] Enables sign extension of data within 32b, 16b or 8b
                                                     word.                                                                     */
      __IOM uint32_t CHANSIZE   : 5;            /*!< [8..4] Sets the slot size of the transmitted or received data.
                                                     The slotsize must be greater than the sample size.                        */
      __IOM uint32_t SAMPLESIZE : 5;            /*!< [13..9] Sample size of the audio data (transmit only)                     */
      __IOM uint32_t BOFFSET    : 5;            /*!< [18..14] Bit offset of the audio sample within the slot (transmit)
                                                     or within the stored sample (receive)                                     */
      __IOM uint32_t CHANCNT    : 3;            /*!< [21..19] The number of enabled channels. Min of 2, Max of 8               */
      __IOM uint32_t LSBFIRST   : 1;            /*!< [22..22] LSB first (1) or MSB first (0)                                   */
      __IOM uint32_t CLKGAP     : 1;            /*!< [23..23] Controls the clock output in clock master mode when
                                                     no data is present. A value of 0 will enable the clock
                                                     for continual output,even when no valid TX data is available.
                                                     Setting this field to a 1 will stop the clock when no valid
                                                     data is available for transmission (TX mode only)                         */
      __IOM uint32_t CTRLSPARE  : 8;            /*!< [31..24] Spare control. Currently unassigned                              */
    } I2SCTRL_b;
  } ;

  union {
    __IOM uint32_t I2SCLK;                      /*!< (@ 0x00000304) Sets the clock source for I2S and ASRC functions           */

    struct {
      __IOM uint32_t ASRCEN     : 1;            /*!< [0..0] Enables ASRC in path of transmit or receive of I2S data
                                                     flow                                                                      */
      __IOM uint32_t ASRCCLKSEL : 1;            /*!< [1..1] Clock selection. 1 = HFRC based; 0 = AUDCLK Based                  */
      __IOM uint32_t I2SCLKSEL  : 2;            /*!< [3..2] Selection of I2S clock source0 : HFRC based clock1 :
                                                     AUDCLK based clock2 : EXTERNAL clock input3: Reserved                     */
      __IOM uint32_t ASEL       : 3;            /*!< [6..4] Select the input clock frequency.                                  */
            uint32_t            : 25;
    } I2SCLK_b;
  } ;

  union {
    __IOM uint32_t I2SFSCTRL;                   /*!< (@ 0x00000308) Sets the parameter for generation of the frame
                                                                    sync signal                                                */

    struct {
      __IOM uint32_t FSLEN      : 5;            /*!< [4..0] The length of frame sync pulse                                     */
      __IOM uint32_t FSPOL      : 1;            /*!< [5..5] Polarity of frame sync signal 0 indicates the frame sync
                                                     will start low, then transition to high at the FSOFFSET
                                                     + FSLEN time                                                              */
      __IOM uint32_t FSEDGE     : 1;            /*!< [6..6] SCLK edge to transition the frame sync signal. 0 = rising
                                                     edge, 1 = falling edge                                                    */
            uint32_t            : 1;
      __IOM uint32_t FSOFFSET   : 4;            /*!< [11..8] Signed offset for start of frame sync. Range of -8 (0xF)
                                                     to 7 (0x7)                                                                */
            uint32_t            : 20;
    } I2SFSCTRL_b;
  } ;
  __IM  uint32_t  RESERVED5[31];

  union {
    __IOM uint32_t IOMDBG;                      /*!< (@ 0x00000388) Debug control                                              */

    struct {
      __IOM uint32_t DBGEN      : 1;            /*!< [0..0] Debug Enable. Setting bit will enable the update of data
                                                     within this register, otherwise it is clock gated for power
                                                     savings                                                                   */
      __IOM uint32_t IOCLKON    : 1;            /*!< [1..1] IOCLK debug clock control. Enable IO_CLK to be active
                                                     when this bit is '1'. Otherwise, the clock is controlled
                                                     with gating from the logic as needed.                                     */
      __IOM uint32_t APBCLKON   : 1;            /*!< [2..2] APBCLK debug clock control. Enable APB_CLK to be active
                                                     when this bit is '1'. Otherwise, the clock is controlled
                                                     with gating from the logic as needed.                                     */
      __IOM uint32_t DBGDATA    : 29;           /*!< [31..3] Debug control for various options. DBGDATA[1:0] is used
                                                     to select between different debug data available in the
                                                     DBG0 and DBG1 registers.                                                  */
    } IOMDBG_b;
  } ;
} IOM0_Type;                                    /*!< Size = 908 (0x38c)                                                        */



/* =========================================================================================================================== */
/* ================                                          IOSLAVE                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief I2C/SPI Slave (IOSLAVE)
  */

typedef struct {                                /*!< (@ 0x40034000) IOSLAVE Structure                                          */
  __IM  uint32_t  RESERVED[64];

  union {
    __IOM uint32_t FIFOPTR;                     /*!< (@ 0x00000100) Current FIFO Pointer                                       */

