AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
    struct {
      __IOM uint32_t TARGADDR   : 32;           /*!< [31..0] Target byte address for source of MEMCPY (either read
                                                     or write). In cases of non-word aligned addresses, the
                                                     MEMCPY logic will take care for ensuring only the target
                                                     bytes are read/written.                                                   */
    } TARGADDR_b;
  } ;

  union {
    __IOM uint32_t TOTCOUNT;                    /*!< (@ 0x00000018) Total Transfer Count                                       */

    struct {
      __IOM uint32_t TOTCOUNT   : 24;           /*!< [23..0] Total Transfer Count in bytes.                                    */
            uint32_t            : 8;
    } TOTCOUNT_b;
  } ;

  union {
    __IOM uint32_t BCOUNT;                      /*!< (@ 0x0000001C) BYTE Transfer Count                                        */

    struct {
      __IOM uint32_t BCOUNT     : 8;            /*!< [7..0] Burst transfer size in bytes. This is the number of bytes
                                                     transferred when a FIFO trigger event occurs. Recommended
                                                     values are 16 or 32.                                                      */
            uint32_t            : 24;
    } BCOUNT_b;
  } ;

  union {
    __IOM uint32_t CURSRC;                      /*!< (@ 0x00000020) Current Source Address                                     */

    struct {
      __IOM uint32_t CURSRC     : 32;           /*!< [31..0] Current Address Pointer (dynamic - will change throughout
                                                     MEMCPY operation)                                                         */
    } CURSRC_b;
  } ;

  union {
    __IOM uint32_t CURDST;                      /*!< (@ 0x00000024) Current Destination Address                                */

    struct {
      __IOM uint32_t CURDST     : 32;           /*!< [31..0] Current Address Pointer (dynamic - will change throughout
                                                     MEMCPY operation)                                                         */
    } CURDST_b;
  } ;

  union {
    __IOM uint32_t CURCOUNT;                    /*!< (@ 0x00000028) Current Transfer Count                                     */

    struct {
      __IOM uint32_t CURCOUNT   : 24;           /*!< [23..0] Total Transfer Count in bytes.                                    */
            uint32_t            : 8;
    } CURCOUNT_b;
  } ;
} MEMCPY0_Type;                                 /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           MRAM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief MRAM Controller (MRAM)
  */

typedef struct {                                /*!< (@ 0x40014000) MRAM Structure                                             */

  union {
    __IOM uint32_t STATUS;                      /*!< (@ 0x00000000) MRAM Controller Status                                     */

    struct {
      __IOM uint32_t BUSY       : 1;            /*!< [0..0] Controller Busy. This bit reflects the status of the
                                                     most recently requested MRAM operation. When set to 1,
                                                     the MRAM Controller is still processing the last operation.
                                                     When set to 0, the controller is idle and ready to accept
                                                     a new command request.                                                    */
      __IOM uint32_t ADDRERROR  : 1;            /*!< [1..1] Write Address Error. When set to 1, this bit indicates
                                                     that an address has been written to the WRADDR register
                                                     which is outside the range of valid addresses for the MRAM
                                                     Memory. This bit will be cleared on a write to the WRADDR
                                                     register with a value that falls in the range of valid
                                                     addresses. Additionally, when a write to the Write Data
                                                     registers occurs and the Write Address is auto-incremented,
                                                     this bit will be set if the new address increments beyond
                                                     the end of the valid MRAM address space.                                  */
            uint32_t            : 30;
    } STATUS_b;
  } ;

  union {
    __IOM uint32_t CTRL;                        /*!< (@ 0x00000004) MRAM Controller Control                                    */

    struct {
      __IOM uint32_t LOAD       : 1;            /*!< [0..0] Writing a 1 to this bitfield initiates a programming
                                                     operation to the MRAM Information space. Writing a 0 to
                                                     this bitfield terminates the programming operation.                       */
      __IOM uint32_t CLRLOAD    : 1;            /*!< [1..1] Writing a 1 to this bitfield initiates a programming
                                                     operation to the MRAM Information space. Writing a 0 to
                                                     this bitfield terminates the programming operation.                       */
      __IOM uint32_t PROGRAM    : 1;            /*!< [2..2] Writing a 1 to this bitfield initiates a programming
                                                     operation to the MRAM Data space. Writing a 0 to this bitfield
                                                     terminates the programming operation.                                     */
      __IOM uint32_t GENCMD     : 1;            /*!< [3..3] Writing a 1 to this bitfield initiates a general command
                                                     to the TMC (see TMCCMD). TMCOVERRIDE must be enabled                      */
            uint32_t            : 28;
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t ACCESS;                      /*!< (@ 0x00000008) Key Register for the MRAM Controller                       */

