AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
    struct {
      __IOM uint32_t PWRSTIOS   : 1;            /*!< [0..0] Power status IO Slave                                              */
      __IOM uint32_t PWRSTIOM0  : 1;            /*!< [1..1] Power status IO Master 0                                           */
      __IOM uint32_t PWRSTIOM1  : 1;            /*!< [2..2] Power status IO Master 1                                           */
      __IOM uint32_t PWRSTIOM2  : 1;            /*!< [3..3] Power status IO Master 2                                           */
      __IOM uint32_t PWRSTIOM3  : 1;            /*!< [4..4] Power status IO Master 3                                           */
      __IOM uint32_t PWRSTIOM4  : 1;            /*!< [5..5] Power status IO Master 4                                           */
      __IOM uint32_t PWRSTIOM5  : 1;            /*!< [6..6] Power Status IO Master 5                                           */
      __IOM uint32_t PWRSTIOM6  : 1;            /*!< [7..7] Power Status IO Master 6                                           */
      __IOM uint32_t PWRSTIOM7  : 1;            /*!< [8..8] Power Status IO Master 7                                           */
      __IOM uint32_t PWRSTUART0 : 1;            /*!< [9..9] Power Status UART Controller 0                                     */
      __IOM uint32_t PWRSTUART1 : 1;            /*!< [10..10] Power Status UART Controller 1                                   */
      __IOM uint32_t PWRSTUART2 : 1;            /*!< [11..11] Power Status UART Controller 2                                   */
      __IOM uint32_t PWRSTUART3 : 1;            /*!< [12..12] Power Status UART Controller 3                                   */
      __IOM uint32_t PWRSTADC   : 1;            /*!< [13..13] Power Status ADC Digital Controller                              */
      __IOM uint32_t PWRSTMSPI0 : 1;            /*!< [14..14] Power Status MSPI Controller0                                    */
      __IOM uint32_t PWRSTMSPI1 : 1;            /*!< [15..15] Power Status MSPI Controller1                                    */
      __IOM uint32_t PWRSTMSPI2 : 1;            /*!< [16..16] Power Status MSPI Controller2                                    */
      __IOM uint32_t PWRSTGFX   : 1;            /*!< [17..17] Power Status GFX controller                                      */
      __IOM uint32_t PWRSTDISP  : 1;            /*!< [18..18] Power Status DISP controller                                     */
      __IOM uint32_t PWRSTDISPPHY : 1;          /*!< [19..19] Power Status DISP PHY                                            */
      __IOM uint32_t PWRSTCRYPTO : 1;           /*!< [20..20] Power Status CRYPTO module                                       */
      __IOM uint32_t PWRSTSDIO  : 1;            /*!< [21..21] Power Status SDIO controller                                     */
      __IOM uint32_t PWRSTUSB   : 1;            /*!< [22..22] Power Status USB controller                                      */
      __IOM uint32_t PWRSTUSBPHY : 1;           /*!< [23..23] Power Status USB PHY                                             */
      __IOM uint32_t PWRSTDBG   : 1;            /*!< [24..24] Power Status DBG subsystem                                       */
      __IOM uint32_t PWRSTI3C0  : 1;            /*!< [25..25] Power Status I3C0                                                */
      __IOM uint32_t PWRSTI3C1  : 1;            /*!< [26..26] Power Status I3C1                                                */
            uint32_t            : 5;
    } DEVPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t AUDSSPWREN;                  /*!< (@ 0x0000000C) This enables various power domains in audio subsystem.     */

    struct {
      __IOM uint32_t PWRENAUDREC : 1;           /*!< [0..0] Power up Audio Record                                              */
      __IOM uint32_t PWRENAUDPB : 1;            /*!< [1..1] Power up Audio Playback                                            */
      __IOM uint32_t PWRENPDM0  : 1;            /*!< [2..2] Power up audio subsystem PDM0 domain                               */
      __IOM uint32_t PWRENPDM1  : 1;            /*!< [3..3] Power up audio subsystem PDM1 domain                               */
      __IOM uint32_t PWRENPDM2  : 1;            /*!< [4..4] Power up audio subsystem PDM2 domain                               */
      __IOM uint32_t PWRENPDM3  : 1;            /*!< [5..5] Power up audio subsystem PDM3 domain                               */
      __IOM uint32_t PWRENI2S0  : 1;            /*!< [6..6] Power up audio subsystem I2S0 domain                               */
      __IOM uint32_t PWRENI2S1  : 1;            /*!< [7..7] Power up audio subsystem I2S1 domain                               */
      __IOM uint32_t PWRENI2S2  : 1;            /*!< [8..8] Power up audio subsystem I2S2 domain                               */
      __IOM uint32_t PWRENI2S3  : 1;            /*!< [9..9] Power up audio subsystem I2S3 domain                               */
      __IOM uint32_t PWRENAUDADC : 1;           /*!< [10..10] Power up audio subsystem ADC domain                              */
      __IOM uint32_t PWRENDSPA  : 1;            /*!< [11..11] Enable one or more DSP subsystems                                */
            uint32_t            : 20;
    } AUDSSPWREN_b;
  } ;

  union {
    __IOM uint32_t AUDSSPWRSTATUS;              /*!< (@ 0x00000010) This provides the power status for the peripheral
                                                                    domains controlled through AUDSSPWREN register.
                                                                    Value of 1 means the device is powred up
                                                                    and ready to be used and 0 means its not
                                                                    powered up.                                                */

    struct {
      __IOM uint32_t PWRSTAUDREC : 1;           /*!< [0..0] Power Status Audio Record block                                    */
      __IOM uint32_t PWRSTAUDPB : 1;            /*!< [1..1] Power Status Audio Playback block                                  */
      __IOM uint32_t PWRSTPDM0  : 1;            /*!< [2..2] Power Status audio subsystem PDM0 domain                           */
      __IOM uint32_t PWRSTPDM1  : 1;            /*!< [3..3] Power Status audio subsystem PDM1 domain                           */
      __IOM uint32_t PWRSTPDM2  : 1;            /*!< [4..4] Power Status audio subsystem PDM2 domain                           */
      __IOM uint32_t PWRSTPDM3  : 1;            /*!< [5..5] Power Status audio subsystem PDM3 domain                           */
      __IOM uint32_t PWRSTI2S0  : 1;            /*!< [6..6] Power Status audio subsystem I2S0 domain                           */
      __IOM uint32_t PWRSTI2S1  : 1;            /*!< [7..7] Power Status audio subsystem I2S1 domain                           */
      __IOM uint32_t PWRSTI2S2  : 1;            /*!< [8..8] Power Status audio subsystem I2S2 domain                           */
      __IOM uint32_t PWRSTI2S3  : 1;            /*!< [9..9] Power Status audio subsystem I2S3 domain                           */
      __IOM uint32_t PWRSTAUDADC : 1;           /*!< [10..10] Power Status audio subsystem ADC domain                          */
      __IOM uint32_t PWRSTDSPA  : 1;            /*!< [11..11] Power Status DSPA subsystem                                      */
            uint32_t            : 20;
    } AUDSSPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t MEMPWREN;                    /*!< (@ 0x00000014) This register enables the individual banks for
                                                                    the memories. When set, power will be enabled
                                                                    to the banks. This register works in conjection
                                                                    with the MEMRETCFG register. If this register
                                                                    is not set, then power will always be disabled
                                                                    to the memory bank.                                        */

