AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
    struct {
      __IOM uint32_t DSP1PERFREQ : 2;           /*!< [1..0] DSP1 Performance mode request                                      */
      __IOM uint32_t DSP1PERFACK : 1;           /*!< [2..2] Indicates the DSP1 performance status indicated in STATUS
                                                     register is valid.                                                        */
      __IOM uint32_t DSP1PERFSTATUS : 2;        /*!< [4..3] DSP1 Performance mode request                                      */
            uint32_t            : 27;
    } DSP1PERFREQ_b;
  } ;

  union {
    __IOM uint32_t DSP1MEMPWREN;                /*!< (@ 0x00000078) This register enables the individual banks for
                                                                    the memories. When set, power will be enabled
                                                                    to the banks. This register works in conjection
                                                                    with the DSP1MEMRETCFG register when DSP1
                                                                    is OFF.                                                    */

    struct {
      __IOM uint32_t PWRENDSP1RAM : 1;          /*!< [0..0] Power up DSP1 IRAM and DRAM                                        */
      __IOM uint32_t PWRENDSP1ICACHE : 1;       /*!< [1..1] Power up DSP1 ICACHE banks                                         */
            uint32_t            : 30;
    } DSP1MEMPWREN_b;
  } ;

  union {
    __IOM uint32_t DSP1MEMPWRST;                /*!< (@ 0x0000007C) It provides the power status for all the memories
                                                                    of DSP1 subsystem                                          */

    struct {
      __IOM uint32_t PWRSTDSP1RAM : 1;          /*!< [0..0] Status- 1:ON, 0:OFF                                                */
      __IOM uint32_t PWRSTDSP1ICACHE : 1;       /*!< [1..1] Power Status- 1:ON, 0:OFF                                          */
            uint32_t            : 30;
    } DSP1MEMPWRST_b;
  } ;

  union {
    __IOM uint32_t DSP1MEMRETCFG;               /*!< (@ 0x00000080) This controls the power down of the DRAM/IRAM/CACHE
                                                                    banks when DSP1 is powered off. If this
                                                                    is set, then the power for that corresponding
                                                                    SRAM bank will be gated when the DSP1 is
                                                                    powered off and data is erased. If this
                                                                    is not set, retention voltage will be applied
                                                                    when DSP1 is powered off. Do not set this
                                                                    if the SRAM bank is used as the target for
                                                                    DMA transfer while DSP1 is powered off.                    */

    struct {
      __IOM uint32_t RAMPWDDSP1OFF : 1;         /*!< [0..0] IRAM/DRAM banks are powered down when DSP1 is switched
                                                     off, causing the contents of the bank to be lost.                         */
      __IOM uint32_t DSP1RAMACTMCU : 1;         /*!< [1..1] Keep the memory domain active based on MCU state.                  */
      __IOM uint32_t ICACHEPWDDSP1OFF : 1;      /*!< [2..2] ICACHE is powered down when DSP1 is switched off, causing
                                                     the contents of the bank to be lost.                                      */
            uint32_t            : 29;
    } DSP1MEMRETCFG_b;
  } ;
  __IM  uint32_t  RESERVED2[31];

  union {
    __IOM uint32_t VRCTRL;                      /*!< (@ 0x00000100) This register includes additional debug control
                                                                    bits. This is an internal Ambiq-only register.
                                                                    Customers should not attempt to change this
                                                                    or else functionality cannot be guaranteed.                */

    struct {
      __IOM uint32_t SIMOBUCKEN : 1;            /*!< [0..0] Enables and Selects the SIMO Buck as the supply for the
                                                     low-voltage power domains. It takes the initial value from
                                                     the bit set in Customer INFO space.                                       */
            uint32_t            : 31;
    } VRCTRL_b;
  } ;

  union {
    __IOM uint32_t LEGACYVRLPOVR;               /*!< (@ 0x00000104) When an override is set for a power domain, VR
                                                                    logic will ignore that power domain state
                                                                    in making a decision to go into lp state.                  */

    struct {
      __IOM uint32_t IGNOREIOS  : 1;            /*!< [0..0] Ignore IOS                                                         */
      __IOM uint32_t IGNOREHCPA : 1;            /*!< [1..1] Ignore HCPA                                                        */
      __IOM uint32_t IGNOREHCPB : 1;            /*!< [2..2] Ignore HCPB                                                        */
      __IOM uint32_t IGNOREHCPC : 1;            /*!< [3..3] Ignore HCPC                                                        */
      __IOM uint32_t IGNOREHCPD : 1;            /*!< [4..4] Ignore HCPD                                                        */
      __IOM uint32_t IGNOREHCPE : 1;            /*!< [5..5] Ignore HCPE                                                        */
      __IOM uint32_t IGNOREMSPI : 1;            /*!< [6..6] Ignore MSPI                                                        */
      __IOM uint32_t IGNOREGFX  : 1;            /*!< [7..7] Ignore GFX                                                         */
      __IOM uint32_t IGNOREDISP : 1;            /*!< [8..8] Ignore DISP Control                                                */
      __IOM uint32_t IGNOREDISPPHY : 1;         /*!< [9..9] Ignore DISP PHY                                                    */
      __IOM uint32_t IGNORECRYPTO : 1;          /*!< [10..10] Ignore CRYPTO                                                    */
      __IOM uint32_t IGNORESDIO : 1;            /*!< [11..11] Ignore SDIO                                                      */
      __IOM uint32_t IGNOREUSB  : 1;            /*!< [12..12] Ignore USB Control                                               */
      __IOM uint32_t IGNOREUSBPHY : 1;          /*!< [13..13] Ignore USB PHY                                                   */
      __IOM uint32_t IGNOREAUD  : 1;            /*!< [14..14] Ignore AUD                                                       */
      __IOM uint32_t IGNOREDSPA : 1;            /*!< [15..15] Ignore DSPA                                                      */
      __IOM uint32_t IGNOREDSP0H : 1;           /*!< [16..16] Ignore DSP0H                                                     */
      __IOM uint32_t IGNOREDSP1H : 1;           /*!< [17..17] Ignore DSP1H                                                     */
      __IOM uint32_t IGNOREDBG  : 1;            /*!< [18..18] Ignore DBG                                                       */
            uint32_t            : 13;
    } LEGACYVRLPOVR_b;
  } ;

  union {
    __IOM uint32_t VRSTATUS;                    /*!< (@ 0x00000108) Provides BUCK and LDOs status.                             */

