AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
    struct {
      __IOM uint32_t COMMANDCOMPLETESTATUSENABLE : 1;/*!< [0..0] Description                                                   */
      __IOM uint32_t TRANSFERCOMPLETESTATUSENABLE : 1;/*!< [1..1] Description                                                  */
      __IOM uint32_t BLOCKGAPEVENTSTATUSENABLE : 1;/*!< [2..2] Description                                                     */
      __IOM uint32_t DMAINTERRUPTSTATUSENABLE : 1;/*!< [3..3] Description                                                      */
      __IOM uint32_t BUFFERWRITEREADYSTATUSENABLE : 1;/*!< [4..4] Description                                                  */
      __IOM uint32_t BUFFERREADREADYSTATUSENABLE : 1;/*!< [5..5] Description                                                   */
      __IOM uint32_t CARDINSERTIONSTATUSENABLE : 1;/*!< [6..6] Description                                                     */
      __IOM uint32_t CARDREMOVALSTATUSENABLE : 1;/*!< [7..7] Description                                                       */
      __IOM uint32_t CARDINTERRUPTSTATUSENABLE : 1;/*!< [8..8] If this bit is set to 0, the HC shall clear Interrupt
                                                     request to the System. The Card Interrupt detection is
                                                     stopped when this bit is cleared and restarted when this
                                                     bit is set to 1. The HD may clear the Card Interrupt Status
                                                     Enable before servicing the Card Interrupt and may set
                                                     this bit again after all Interrupt requests from the card
                                                     are cleared to prevent inadvertent Interrupts.                            */
      __IOM uint32_t INTASTATUSENABLE : 1;      /*!< [9..9] If this bit is set to 0, the Host Controller shall clear
                                                     the interrupt request to the System. The Host Driver may
                                                     clear this bit before servicing the INT_A and may set this
                                                     bit again after all interrupt requests to INT_A pin are
                                                     cleared to prevent inadvertent interrupts.                                */
      __IOM uint32_t INTBSTATUSENABLE : 1;      /*!< [10..10] If this bit is set to 0, the Host Controller shall
                                                     clear the interrupt request to the System. The Host Driver
                                                     may clear this bit before servicing the INT_B and may set
                                                     this bit again after all interrupt requests to INT_B pin
                                                     are cleared to prevent inadvertent interrupts.                            */
      __IOM uint32_t INTCSTATUSENABLE : 1;      /*!< [11..11] If this bit is set to 0, the Host Controller shall
                                                     clear the interrupt request to the System. The Host Driver
                                                     may clear this bit before servicing the INT_C and may set
                                                     this bit again after all interrupt requests to INT_C pin
                                                     are cleared to prevent inadvertent interrupts. Interrupt
                                                     enable                                                                    */
      __IOM uint32_t RETUNINGEVENTSTATUSENABLE : 1;/*!< [12..12] Interrupt                                                     */
      __IOM uint32_t BOOTACKRCVENABLE : 1;      /*!< [13..13] Interrupt                                                        */
      __IOM uint32_t BOOTTERMINATE : 1;         /*!< [14..14] Boot is terminated?                                              */
      __IOM uint32_t FIXEDTO0   : 1;            /*!< [15..15] The HC shall control error Interrupts using the Error
                                                     Interrupt Status Enable register.                                         */
      __IOM uint32_t COMMANDTIMEOUTERRORSTATUSENABLE : 1;/*!< [16..16] Desc                                                    */
      __IOM uint32_t COMMANDCRCERRORSTATUSENABLE : 1;/*!< [17..17] Desc                                                        */
      __IOM uint32_t COMMANDENDBITERRORSTATUSENABLE : 1;/*!< [18..18] Desc                                                     */
      __IOM uint32_t COMMANDINDEXERRORSTATUSENABLE : 1;/*!< [19..19] Desc                                                      */
      __IOM uint32_t DATATIMEOUTERRORSTATUSENABLE : 1;/*!< [20..20] Desc                                                       */
      __IOM uint32_t DATACRCERRORSTATUSENABLE : 1;/*!< [21..21] Desc                                                           */
      __IOM uint32_t DATAENDBITERRORSTATUSENABLE : 1;/*!< [22..22] Desc                                                        */
      __IOM uint32_t CURRENTLIMITERRORSTATUSENABLE : 1;/*!< [23..23] Desc                                                      */
      __IOM uint32_t AUTOCMD12ERRORSTATUSENABLE : 1;/*!< [24..24] Desc                                                         */
      __IOM uint32_t ADMAERRORSTATUSENABLE : 1; /*!< [25..25] Desc                                                             */
      __IOM uint32_t TUNINGERRORSTATUS : 1;     /*!< [26..26] enable                                                           */
            uint32_t            : 1;
      __IOM uint32_t TARGETRESPONSEERRORHOSTERRORSTATUSENABLE : 1;/*!< [28..28] Desc                                           */
      __IOM uint32_t VENDORSPECIFICERRORSTATUSENABLE : 3;/*!< [31..29] FIXME - Bitfield description needed here.               */
    } INTENABLE_b;
  } ;

  union {
    __IOM uint32_t INTSIG;                      /*!< (@ 0x00000038) Normal interrupt signal enable                             */

