AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG54_b;
  } ;

  union {
    __IOM uint32_t REG58;                       /*!< (@ 0x00000058) Register description here                                  */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG58_b;
  } ;

  union {
    __IOM uint32_t REG5C;                       /*!< (@ 0x0000005C) Register description here                                  */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG5C_b;
  } ;

  union {
    __IOM uint32_t REG60;                       /*!< (@ 0x00000060) Register description here                                  */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG60_b;
  } ;

  union {
    __IOM uint32_t REG64;                       /*!< (@ 0x00000064) Register description here                                  */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< [0..0] This bitfield is reserved.                                         */
            uint32_t            : 31;
    } REG64_b;
  } ;

  union {
    __IOM uint32_t REG68;                       /*!< (@ 0x00000068) Register description here                                  */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG68_b;
  } ;

  union {
    __IOM uint32_t REG6C;                       /*!< (@ 0x0000006C) Register description here                                  */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG6C_b;
  } ;

  union {
    __IOM uint32_t REG70;                       /*!< (@ 0x00000070) Register description here                                  */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] FIXME (description needed).                                        */
            uint32_t            : 24;
    } REG70_b;
  } ;

  union {
    __IOM uint32_t REG74;                       /*!< (@ 0x00000074) Register description here                                  */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< [0..0] Disconnect detection block input res load sel. 1'b0:
                                                     disconnect detection block input res load bypass 1'b1:
                                                     disconnect detection block input res load enable                          */
      __IOM uint32_t BF31       : 3;            /*!< [3..1] HS driver slew rate tuning 001:SR is weakest 111:SR is
                                                     strongest.000 is forbidden.                                               */
      __IOM uint32_t BF74       : 4;            /*!< [7..4] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG74_b;
  } ;

  union {
    __IOM uint32_t REG78;                       /*!< (@ 0x00000078) Register description here                                  */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG78_b;
  } ;

  union {
    __IOM uint32_t REG7C;                       /*!< (@ 0x0000007C) Register description here                                  */

    struct {
      __IOM uint32_t BF40       : 5;            /*!< [4..0] This bitfield is reserved.                                         */
      __IOM uint32_t BF55       : 1;            /*!< [5..5] No leakage current on DP/DM pin when VCCA3P3 power down,
                                                     active low. Keeping the default value was greatly appreciated             */
      __IOM uint32_t BF66       : 1;            /*!< [6..6] Hs chirp mode amplitude increasing register, active high.          */
      __IOM uint32_t BF77       : 1;            /*!< [7..7] Clk60m source clock select. 1'b1: free clock 60M 1'b0:
                                                     utmi_clk                                                                  */
            uint32_t            : 24;
    } REG7C_b;
  } ;

  union {
    __IOM uint32_t REG80;                       /*!< (@ 0x00000080) Register description here                                  */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< [0..0] Digital clock enable bypass 1'b1: digital clock bypass
                                                     enable 1'b0: digital clock bypass disable                                 */
      __IOM uint32_t BF11       : 1;            /*!< [1..1] Digital clock enable bypass value 1'b1: digital clock
                                                     enable 1'b0: digital clock disable                                        */
      __IOM uint32_t BF22       : 1;            /*!< [2..2] utmi clock always on 1'b1: utmi clock always on 1'b0:
                                                     utmi clock relative to suspendm                                           */
      __IOM uint32_t BF73       : 5;            /*!< [7..3] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG80_b;
  } ;

  union {
    __IOM uint32_t REG84;                       /*!< (@ 0x00000084) Register description here                                  */

