AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG84_b;
  } ;
} USBPHY_Type;                                  /*!< Size = 136 (0x88)                                                         */



/* =========================================================================================================================== */
/* ================                                            USB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief USB device register descriptions. (USB)
  */

typedef struct {                                /*!< (@ 0x400B0000) USB Structure                                              */

  union {
    __IOM uint32_t CFG0;                        /*!< (@ 0x00000000) Function Address, Power Management, Interrupt
                                                                    register for EP0 and IN Endpoints 1 to 15                  */

    struct {
      __IOM uint32_t FuncAddr   : 7;            /*!< [6..0] The function address. This register should be written
                                                     with the address value contained in the SET_ADDRESS standard
                                                     device request (see Universal Serial Bus Specification
                                                     Revision 2.0, Chapter 9), when it is received on Endpoint
                                                     0. The new address will not take effect immediately as
                                                     the host will still be using the old address for the Status
                                                     stage of the device request. The MUSBHSFC will continue
                                                     to use the old address for decoding packets until the device
                                                     request has completed. The status of the device req                       */
      __IOM uint32_t Update     : 1;            /*!< [7..7] Set when FAddr is written. Cleared when the new address
                                                     takes effect (at the end of                                               */
      __IOM uint32_t Enabl      : 1;            /*!< [8..8] Set by the CPU to enable the SUSPENDM signal Suspend
                                                     The ISO Update bit affects all IN Isochronous endpoints
                                                     in the MUSBHSFC. It is normally used as a method of ensuring
                                                     'clean' start-up of an IN Isochronous pipe. See the section
                                                     on IN Isochronous Endpoints (Section 9) for more details
                                                     on starting up IN Isochronous pipes The HS Enab bit can
                                                     be used to disable high-speed operation. Normally the MUSBHSFC
                                                     will automatically negotiate for high speed operation,
                                                     when it is reset, by sending a 'chirp' to the hub.                        */
      __IOM uint32_t Suspen     : 1;            /*!< [9..9] Mod This read-only bit is set when Suspend mode is entered.
                                                     It is cleared when the CPU reads th interrupt register,
                                                     or sets the Resume bit of this register                                   */
      __IOM uint32_t Resume     : 1;            /*!< [10..10] Set should clear this bit after 10 ms (a maximum of
                                                     15 ms) to end Resume signaling                                            */
      __IOM uint32_t Reset      : 1;            /*!< [11..11] This It is cleared when either HS negotiation has completed
                                                     successfully or after 2.1ms of Rese signaling if HS negotiation
                                                     fails                                                                     */
      __IOM uint32_t HSMode     : 1;            /*!< [12..12] This read-only bit is set when the MUSBHSFC has successfully
                                                     negotiated for High-speed mode.                                           */
      __IOM uint32_t HSEnab     : 1;            /*!< [13..13] When set by the CPU, the MUSBHSFC will negotiate for
                                                     high-speed mode when the device is reset by the hub. If
                                                     not set, the device will only operate in Full-speed mode                  */
      __IOM uint32_t AMSPECIFIC : 1;            /*!< [14..14] The action associated with setting this bit is version
                                                     specific. Please see the Product Specification provided
                                                     with your copy of the MUSBHSFC core                                       */
      __IOM uint32_t ISOUpdate  : 1;            /*!< [15..15] When set by the CPU, the MUSBHSFC will wait for an
                                                     SOF token from the time InPktRdy is set before sending
                                                     the packet. If an IN token is received before an SOF token,
                                                     then a zero length data packet will be sent. Note: This
                                                     bit only affects endpoints performing Isochronous transfers               */
      __IOM uint32_t EP0InIntStat : 1;          /*!< [16..16] IN Endpoint 0 interrupt status. All interrupts are
                                                     cleared when the register is read.                                        */
      __IOM uint32_t EP1InIntStat : 1;          /*!< [17..17] IN Endpoint 1 interrupt status. All interrupts are
                                                     cleared when the register is read.                                        */
      __IOM uint32_t EP2InIntStat : 1;          /*!< [18..18] IN Endpoint 2 interrupt status. All interrupts are
                                                     cleared when the register is read.                                        */
      __IOM uint32_t EP3InIntStat : 1;          /*!< [19..19] IN Endpoint 3 interrupt status. All interrupts are
                                                     cleared when the register is read.                                        */
      __IOM uint32_t EP4InIntStat : 1;          /*!< [20..20] IN Endpoint 4 interrupt status. All interrupts are
                                                     cleared when the register is read.                                        */
      __IOM uint32_t EP5InIntStat : 1;          /*!< [21..21] IN Endpoint 5 interrupt status. All interrupts are
                                                     cleared when the register is read.                                        */
            uint32_t            : 10;
    } CFG0_b;
  } ;

  union {
    __IOM uint32_t CFG1;                        /*!< (@ 0x00000004) IntrIn is a 16-bit read-only register that indicates
                                                                    which of the interrupts for IN Endpoints
                                                                    1 - 15 are currently active. It also indicates
                                                                    whether the Endpoint 0 interrupt is currently
                                                                    active. Note: Bits relating to endpoints
                                                                    that have not been configured will always
                                                                    return 0. Note also that all active interrupts
                                                                    are cleared when this register is read.
                                                                    IntrOut is a 16-bit read-only register that
                                                                    indicates which of the interrupts for OUT
                                                                    Endpoints 1 - 15 are currently active. (Endpoint
                                                                    0 us                                                       */

