AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
#define AUDADC_INTSTAT_DERR_Msk           (0x80UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTSTAT_DCMP_Pos           (6UL)                     /*!< DCMP (Bit 6)                                          */
#define AUDADC_INTSTAT_DCMP_Msk           (0x40UL)                  /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTSTAT_WCINC_Pos          (5UL)                     /*!< WCINC (Bit 5)                                         */
#define AUDADC_INTSTAT_WCINC_Msk          (0x20UL)                  /*!< WCINC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTSTAT_WCEXC_Pos          (4UL)                     /*!< WCEXC (Bit 4)                                         */
#define AUDADC_INTSTAT_WCEXC_Msk          (0x10UL)                  /*!< WCEXC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTSTAT_FIFOOVR2_Pos       (3UL)                     /*!< FIFOOVR2 (Bit 3)                                      */
#define AUDADC_INTSTAT_FIFOOVR2_Msk       (0x8UL)                   /*!< FIFOOVR2 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTSTAT_FIFOOVR1_Pos       (2UL)                     /*!< FIFOOVR1 (Bit 2)                                      */
#define AUDADC_INTSTAT_FIFOOVR1_Msk       (0x4UL)                   /*!< FIFOOVR1 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTSTAT_SCNCMP_Pos         (1UL)                     /*!< SCNCMP (Bit 1)                                        */
#define AUDADC_INTSTAT_SCNCMP_Msk         (0x2UL)                   /*!< SCNCMP (Bitfield-Mask: 0x01)                          */
#define AUDADC_INTSTAT_CNVCMP_Pos         (0UL)                     /*!< CNVCMP (Bit 0)                                        */
#define AUDADC_INTSTAT_CNVCMP_Msk         (0x1UL)                   /*!< CNVCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTCLR  ========================================================= */
#define AUDADC_INTCLR_DERR_Pos            (7UL)                     /*!< DERR (Bit 7)                                          */
#define AUDADC_INTCLR_DERR_Msk            (0x80UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTCLR_DCMP_Pos            (6UL)                     /*!< DCMP (Bit 6)                                          */
#define AUDADC_INTCLR_DCMP_Msk            (0x40UL)                  /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTCLR_WCINC_Pos           (5UL)                     /*!< WCINC (Bit 5)                                         */
#define AUDADC_INTCLR_WCINC_Msk           (0x20UL)                  /*!< WCINC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTCLR_WCEXC_Pos           (4UL)                     /*!< WCEXC (Bit 4)                                         */
#define AUDADC_INTCLR_WCEXC_Msk           (0x10UL)                  /*!< WCEXC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTCLR_FIFOOVR2_Pos        (3UL)                     /*!< FIFOOVR2 (Bit 3)                                      */
#define AUDADC_INTCLR_FIFOOVR2_Msk        (0x8UL)                   /*!< FIFOOVR2 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTCLR_FIFOOVR1_Pos        (2UL)                     /*!< FIFOOVR1 (Bit 2)                                      */
#define AUDADC_INTCLR_FIFOOVR1_Msk        (0x4UL)                   /*!< FIFOOVR1 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTCLR_SCNCMP_Pos          (1UL)                     /*!< SCNCMP (Bit 1)                                        */
#define AUDADC_INTCLR_SCNCMP_Msk          (0x2UL)                   /*!< SCNCMP (Bitfield-Mask: 0x01)                          */
#define AUDADC_INTCLR_CNVCMP_Pos          (0UL)                     /*!< CNVCMP (Bit 0)                                        */
#define AUDADC_INTCLR_CNVCMP_Msk          (0x1UL)                   /*!< CNVCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSET  ========================================================= */
#define AUDADC_INTSET_DERR_Pos            (7UL)                     /*!< DERR (Bit 7)                                          */
#define AUDADC_INTSET_DERR_Msk            (0x80UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTSET_DCMP_Pos            (6UL)                     /*!< DCMP (Bit 6)                                          */
#define AUDADC_INTSET_DCMP_Msk            (0x40UL)                  /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTSET_WCINC_Pos           (5UL)                     /*!< WCINC (Bit 5)                                         */
#define AUDADC_INTSET_WCINC_Msk           (0x20UL)                  /*!< WCINC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTSET_WCEXC_Pos           (4UL)                     /*!< WCEXC (Bit 4)                                         */
#define AUDADC_INTSET_WCEXC_Msk           (0x10UL)                  /*!< WCEXC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTSET_FIFOOVR2_Pos        (3UL)                     /*!< FIFOOVR2 (Bit 3)                                      */
#define AUDADC_INTSET_FIFOOVR2_Msk        (0x8UL)                   /*!< FIFOOVR2 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTSET_FIFOOVR1_Pos        (2UL)                     /*!< FIFOOVR1 (Bit 2)                                      */
#define AUDADC_INTSET_FIFOOVR1_Msk        (0x4UL)                   /*!< FIFOOVR1 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTSET_SCNCMP_Pos          (1UL)                     /*!< SCNCMP (Bit 1)                                        */
#define AUDADC_INTSET_SCNCMP_Msk          (0x2UL)                   /*!< SCNCMP (Bitfield-Mask: 0x01)                          */
#define AUDADC_INTSET_CNVCMP_Pos          (0UL)                     /*!< CNVCMP (Bit 0)                                        */
#define AUDADC_INTSET_CNVCMP_Msk          (0x1UL)                   /*!< CNVCMP (Bitfield-Mask: 0x01)                          */
/* =======================================================  DMATRIGEN  ======================================================= */
#define AUDADC_DMATRIGEN_DFIFOFULL_Pos    (1UL)                     /*!< DFIFOFULL (Bit 1)                                     */
#define AUDADC_DMATRIGEN_DFIFOFULL_Msk    (0x2UL)                   /*!< DFIFOFULL (Bitfield-Mask: 0x01)                       */
#define AUDADC_DMATRIGEN_DFIFO75_Pos      (0UL)                     /*!< DFIFO75 (Bit 0)                                       */
#define AUDADC_DMATRIGEN_DFIFO75_Msk      (0x1UL)                   /*!< DFIFO75 (Bitfield-Mask: 0x01)                         */
/* ======================================================  DMATRIGSTAT  ====================================================== */
#define AUDADC_DMATRIGSTAT_DFULLSTAT_Pos  (1UL)                     /*!< DFULLSTAT (Bit 1)                                     */
#define AUDADC_DMATRIGSTAT_DFULLSTAT_Msk  (0x2UL)                   /*!< DFULLSTAT (Bitfield-Mask: 0x01)                       */
#define AUDADC_DMATRIGSTAT_D75STAT_Pos    (0UL)                     /*!< D75STAT (Bit 0)                                       */
#define AUDADC_DMATRIGSTAT_D75STAT_Msk    (0x1UL)                   /*!< D75STAT (Bitfield-Mask: 0x01)                         */
/* ========================================================  DMACFG  ========================================================= */
#define AUDADC_DMACFG_DPWROFF_Pos         (18UL)                    /*!< DPWROFF (Bit 18)                                      */
#define AUDADC_DMACFG_DPWROFF_Msk         (0x40000UL)               /*!< DPWROFF (Bitfield-Mask: 0x01)                         */
#define AUDADC_DMACFG_DMAMSK_Pos          (17UL)                    /*!< DMAMSK (Bit 17)                                       */
#define AUDADC_DMACFG_DMAMSK_Msk          (0x20000UL)               /*!< DMAMSK (Bitfield-Mask: 0x01)                          */
#define AUDADC_DMACFG_DMADYNPRI_Pos       (9UL)                     /*!< DMADYNPRI (Bit 9)                                     */
#define AUDADC_DMACFG_DMADYNPRI_Msk       (0x200UL)                 /*!< DMADYNPRI (Bitfield-Mask: 0x01)                       */
#define AUDADC_DMACFG_DMAPRI_Pos          (8UL)                     /*!< DMAPRI (Bit 8)                                        */
#define AUDADC_DMACFG_DMAPRI_Msk          (0x100UL)                 /*!< DMAPRI (Bitfield-Mask: 0x01)                          */
#define AUDADC_DMACFG_DMADIR_Pos          (2UL)                     /*!< DMADIR (Bit 2)                                        */
#define AUDADC_DMACFG_DMADIR_Msk          (0x4UL)                   /*!< DMADIR (Bitfield-Mask: 0x01)                          */
#define AUDADC_DMACFG_DMAEN_Pos           (0UL)                     /*!< DMAEN (Bit 0)                                         */
#define AUDADC_DMACFG_DMAEN_Msk           (0x1UL)                   /*!< DMAEN (Bitfield-Mask: 0x01)                           */
/* ======================================================  DMATOTCOUNT  ====================================================== */
#define AUDADC_DMATOTCOUNT_TOTCOUNT_Pos   (2UL)                     /*!< TOTCOUNT (Bit 2)                                      */
#define AUDADC_DMATOTCOUNT_TOTCOUNT_Msk   (0x3fffcUL)               /*!< TOTCOUNT (Bitfield-Mask: 0xffff)                      */
/* ======================================================  DMATARGADDR  ====================================================== */
#define AUDADC_DMATARGADDR_UTARGADDR_Pos  (28UL)                    /*!< UTARGADDR (Bit 28)                                    */
#define AUDADC_DMATARGADDR_UTARGADDR_Msk  (0xf0000000UL)            /*!< UTARGADDR (Bitfield-Mask: 0x0f)                       */
#define AUDADC_DMATARGADDR_LTARGADDR_Pos  (0UL)                     /*!< LTARGADDR (Bit 0)                                     */
#define AUDADC_DMATARGADDR_LTARGADDR_Msk  (0xfffffffUL)             /*!< LTARGADDR (Bitfield-Mask: 0xfffffff)                  */
/* ========================================================  DMASTAT  ======================================================== */
#define AUDADC_DMASTAT_DMAERR_Pos         (2UL)                     /*!< DMAERR (Bit 2)                                        */
#define AUDADC_DMASTAT_DMAERR_Msk         (0x4UL)                   /*!< DMAERR (Bitfield-Mask: 0x01)                          */
#define AUDADC_DMASTAT_DMACPL_Pos         (1UL)                     /*!< DMACPL (Bit 1)                                        */
#define AUDADC_DMASTAT_DMACPL_Msk         (0x2UL)                   /*!< DMACPL (Bitfield-Mask: 0x01)                          */
#define AUDADC_DMASTAT_DMATIP_Pos         (0UL)                     /*!< DMATIP (Bit 0)                                        */
#define AUDADC_DMASTAT_DMATIP_Msk         (0x1UL)                   /*!< DMATIP (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                          CLKGEN                                           ================ */
/* =========================================================================================================================== */

