AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
#define DC_LAYER0ADDR_LAYER0STARTADDRFBUF_Pos (0UL)                 /*!< LAYER0STARTADDRFBUF (Bit 0)                           */
#define DC_LAYER0ADDR_LAYER0STARTADDRFBUF_Msk (0xffffffffUL)        /*!< LAYER0STARTADDRFBUF (Bitfield-Mask: 0xffffffff)       */
/* =====================================================  LAYER0STRIDE  ====================================================== */
#define DC_LAYER0STRIDE_RSVD_Pos          (21UL)                    /*!< RSVD (Bit 21)                                         */
#define DC_LAYER0STRIDE_RSVD_Msk          (0xffe00000UL)            /*!< RSVD (Bitfield-Mask: 0x7ff)                           */
#define DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_Pos (19UL)                /*!< LAYER0AXIFIFOTHLD (Bit 19)                            */
#define DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_Msk (0x180000UL)          /*!< LAYER0AXIFIFOTHLD (Bitfield-Mask: 0x03)               */
#define DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_Pos (16UL)               /*!< LAYER0AXIBURSTBITS (Bit 16)                           */
#define DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_Msk (0x70000UL)          /*!< LAYER0AXIBURSTBITS (Bitfield-Mask: 0x07)              */
#define DC_LAYER0STRIDE_LAYER0STRIDEDIST_Pos (0UL)                  /*!< LAYER0STRIDEDIST (Bit 0)                              */
#define DC_LAYER0STRIDE_LAYER0STRIDEDIST_Msk (0xffffUL)             /*!< LAYER0STRIDEDIST (Bitfield-Mask: 0xffff)              */
/* ======================================================  LAYER0RESXY  ====================================================== */
#define DC_LAYER0RESXY_LAYER0PIXRESX_Pos  (16UL)                    /*!< LAYER0PIXRESX (Bit 16)                                */
#define DC_LAYER0RESXY_LAYER0PIXRESX_Msk  (0xffff0000UL)            /*!< LAYER0PIXRESX (Bitfield-Mask: 0xffff)                 */
#define DC_LAYER0RESXY_LAYER0PIXRESY_Pos  (0UL)                     /*!< LAYER0PIXRESY (Bit 0)                                 */
#define DC_LAYER0RESXY_LAYER0PIXRESY_Msk  (0xffffUL)                /*!< LAYER0PIXRESY (Bitfield-Mask: 0xffff)                 */
/* =====================================================  LAYER0SCALEX  ====================================================== */
#define DC_LAYER0SCALEX_LAYER0XFACTOR_Pos (0UL)                     /*!< LAYER0XFACTOR (Bit 0)                                 */
#define DC_LAYER0SCALEX_LAYER0XFACTOR_Msk (0xffffffffUL)            /*!< LAYER0XFACTOR (Bitfield-Mask: 0xffffffff)             */
/* ======================================================  LAYER0SCALE  ====================================================== */
#define DC_LAYER0SCALE_LAYER0YFACTOR_Pos  (0UL)                     /*!< LAYER0YFACTOR (Bit 0)                                 */
#define DC_LAYER0SCALE_LAYER0YFACTOR_Msk  (0xffffffffUL)            /*!< LAYER0YFACTOR (Bitfield-Mask: 0xffffffff)             */
/* ======================================================  LAYER1MODE  ======================================================= */
#define DC_LAYER1MODE_LAYER1EN_Pos        (31UL)                    /*!< LAYER1EN (Bit 31)                                     */
#define DC_LAYER1MODE_LAYER1EN_Msk        (0x80000000UL)            /*!< LAYER1EN (Bitfield-Mask: 0x01)                        */
#define DC_LAYER1MODE_LAYER1FORCE_Pos     (30UL)                    /*!< LAYER1FORCE (Bit 30)                                  */
#define DC_LAYER1MODE_LAYER1FORCE_Msk     (0x40000000UL)            /*!< LAYER1FORCE (Bitfield-Mask: 0x01)                     */
#define DC_LAYER1MODE_LAYER1BFILTER_Pos   (29UL)                    /*!< LAYER1BFILTER (Bit 29)                                */
#define DC_LAYER1MODE_LAYER1BFILTER_Msk   (0x20000000UL)            /*!< LAYER1BFILTER (Bitfield-Mask: 0x01)                   */
#define DC_LAYER1MODE_LAYER1PREMULT_Pos   (28UL)                    /*!< LAYER1PREMULT (Bit 28)                                */
#define DC_LAYER1MODE_LAYER1PREMULT_Msk   (0x10000000UL)            /*!< LAYER1PREMULT (Bitfield-Mask: 0x01)                   */
#define DC_LAYER1MODE_LAYER1HLOCK_Pos     (27UL)                    /*!< LAYER1HLOCK (Bit 27)                                  */
#define DC_LAYER1MODE_LAYER1HLOCK_Msk     (0x8000000UL)             /*!< LAYER1HLOCK (Bitfield-Mask: 0x01)                     */
#define DC_LAYER1MODE_LAYER1GAMMA_Pos     (26UL)                    /*!< LAYER1GAMMA (Bit 26)                                  */
#define DC_LAYER1MODE_LAYER1GAMMA_Msk     (0x4000000UL)             /*!< LAYER1GAMMA (Bitfield-Mask: 0x01)                     */
#define DC_LAYER1MODE_RSVD1_Pos           (24UL)                    /*!< RSVD1 (Bit 24)                                        */
#define DC_LAYER1MODE_RSVD1_Msk           (0x3000000UL)             /*!< RSVD1 (Bitfield-Mask: 0x03)                           */
#define DC_LAYER1MODE_LAYER1ALPHA_Pos     (16UL)                    /*!< LAYER1ALPHA (Bit 16)                                  */
#define DC_LAYER1MODE_LAYER1ALPHA_Msk     (0xff0000UL)              /*!< LAYER1ALPHA (Bitfield-Mask: 0xff)                     */
#define DC_LAYER1MODE_LAYER1DBLEND_Pos    (12UL)                    /*!< LAYER1DBLEND (Bit 12)                                 */
#define DC_LAYER1MODE_LAYER1DBLEND_Msk    (0xf000UL)                /*!< LAYER1DBLEND (Bitfield-Mask: 0x0f)                    */
#define DC_LAYER1MODE_LAYER1SBLEND_Pos    (8UL)                     /*!< LAYER1SBLEND (Bit 8)                                  */
#define DC_LAYER1MODE_LAYER1SBLEND_Msk    (0xf00UL)                 /*!< LAYER1SBLEND (Bitfield-Mask: 0x0f)                    */
#define DC_LAYER1MODE_RSVD0_Pos           (5UL)                     /*!< RSVD0 (Bit 5)                                         */
#define DC_LAYER1MODE_RSVD0_Msk           (0xe0UL)                  /*!< RSVD0 (Bitfield-Mask: 0x07)                           */
#define DC_LAYER1MODE_LAYER1COLORMODE_Pos (0UL)                     /*!< LAYER1COLORMODE (Bit 0)                               */
#define DC_LAYER1MODE_LAYER1COLORMODE_Msk (0x1fUL)                  /*!< LAYER1COLORMODE (Bitfield-Mask: 0x1f)                 */
/* =====================================================  LAYER1STARTXY  ===================================================== */
#define DC_LAYER1STARTXY_LAYER1XOFF_Pos   (16UL)                    /*!< LAYER1XOFF (Bit 16)                                   */
#define DC_LAYER1STARTXY_LAYER1XOFF_Msk   (0xffff0000UL)            /*!< LAYER1XOFF (Bitfield-Mask: 0xffff)                    */
#define DC_LAYER1STARTXY_LAYER1YOFF_Pos   (0UL)                     /*!< LAYER1YOFF (Bit 0)                                    */
#define DC_LAYER1STARTXY_LAYER1YOFF_Msk   (0xffffUL)                /*!< LAYER1YOFF (Bitfield-Mask: 0xffff)                    */
/* =====================================================  LAYER1SIZEXY  ====================================================== */
#define DC_LAYER1SIZEXY_LAYER1PIXSZEX_Pos (16UL)                    /*!< LAYER1PIXSZEX (Bit 16)                                */
#define DC_LAYER1SIZEXY_LAYER1PIXSZEX_Msk (0xffff0000UL)            /*!< LAYER1PIXSZEX (Bitfield-Mask: 0xffff)                 */
#define DC_LAYER1SIZEXY_LAYER1PIXSZEY_Pos (0UL)                     /*!< LAYER1PIXSZEY (Bit 0)                                 */
#define DC_LAYER1SIZEXY_LAYER1PIXSZEY_Msk (0xffffUL)                /*!< LAYER1PIXSZEY (Bitfield-Mask: 0xffff)                 */
/* ======================================================  LAYER1ADDR  ======================================================= */
#define DC_LAYER1ADDR_LAYER1STARTADDRFBUF_Pos (0UL)                 /*!< LAYER1STARTADDRFBUF (Bit 0)                           */
#define DC_LAYER1ADDR_LAYER1STARTADDRFBUF_Msk (0xffffffffUL)        /*!< LAYER1STARTADDRFBUF (Bitfield-Mask: 0xffffffff)       */
/* =====================================================  LAYER1STRIDE  ====================================================== */
#define DC_LAYER1STRIDE_RSVD_Pos          (21UL)                    /*!< RSVD (Bit 21)                                         */
#define DC_LAYER1STRIDE_RSVD_Msk          (0xffe00000UL)            /*!< RSVD (Bitfield-Mask: 0x7ff)                           */
#define DC_LAYER1STRIDE_LAYER1AXIFIFOTHLD_Pos (19UL)                /*!< LAYER1AXIFIFOTHLD (Bit 19)                            */
#define DC_LAYER1STRIDE_LAYER1AXIFIFOTHLD_Msk (0x180000UL)          /*!< LAYER1AXIFIFOTHLD (Bitfield-Mask: 0x03)               */
#define DC_LAYER1STRIDE_LAYER1AXIBURSTBITS_Pos (16UL)               /*!< LAYER1AXIBURSTBITS (Bit 16)                           */
#define DC_LAYER1STRIDE_LAYER1AXIBURSTBITS_Msk (0x70000UL)          /*!< LAYER1AXIBURSTBITS (Bitfield-Mask: 0x07)              */
#define DC_LAYER1STRIDE_LAYER1STRIDEDIST_Pos (0UL)                  /*!< LAYER1STRIDEDIST (Bit 0)                              */
#define DC_LAYER1STRIDE_LAYER1STRIDEDIST_Msk (0xffffUL)             /*!< LAYER1STRIDEDIST (Bitfield-Mask: 0xffff)              */
/* ======================================================  LAYER1RESXY  ====================================================== */
#define DC_LAYER1RESXY_LAYER1PIXRESX_Pos  (16UL)                    /*!< LAYER1PIXRESX (Bit 16)                                */
#define DC_LAYER1RESXY_LAYER1PIXRESX_Msk  (0xffff0000UL)            /*!< LAYER1PIXRESX (Bitfield-Mask: 0xffff)                 */
#define DC_LAYER1RESXY_LAYER1PIXRESY_Pos  (0UL)                     /*!< LAYER1PIXRESY (Bit 0)                                 */
#define DC_LAYER1RESXY_LAYER1PIXRESY_Msk  (0xffffUL)                /*!< LAYER1PIXRESY (Bitfield-Mask: 0xffff)                 */
/* =====================================================  LAYER1SCALEX  ====================================================== */
#define DC_LAYER1SCALEX_LAYER1XFACTOR_Pos (0UL)                     /*!< LAYER1XFACTOR (Bit 0)                                 */
#define DC_LAYER1SCALEX_LAYER1XFACTOR_Msk (0xffffffffUL)            /*!< LAYER1XFACTOR (Bitfield-Mask: 0xffffffff)             */
/* =====================================================  LAYER1SCALEY  ====================================================== */
#define DC_LAYER1SCALEY_LAYER1YFACTOR_Pos (0UL)                     /*!< LAYER1YFACTOR (Bit 0)                                 */
#define DC_LAYER1SCALEY_LAYER1YFACTOR_Msk (0xffffffffUL)            /*!< LAYER1YFACTOR (Bitfield-Mask: 0xffffffff)             */
/* ======================================================  LAYER2MODE  ======================================================= */
#define DC_LAYER2MODE_LAYER2EN_Pos        (31UL)                    /*!< LAYER2EN (Bit 31)                                     */
#define DC_LAYER2MODE_LAYER2EN_Msk        (0x80000000UL)            /*!< LAYER2EN (Bitfield-Mask: 0x01)                        */
#define DC_LAYER2MODE_LAYER2FORCE_Pos     (30UL)                    /*!< LAYER2FORCE (Bit 30)                                  */
#define DC_LAYER2MODE_LAYER2FORCE_Msk     (0x40000000UL)            /*!< LAYER2FORCE (Bitfield-Mask: 0x01)                     */
#define DC_LAYER2MODE_LAYER2BFILTER_Pos   (29UL)                    /*!< LAYER2BFILTER (Bit 29)                                */
#define DC_LAYER2MODE_LAYER2BFILTER_Msk   (0x20000000UL)            /*!< LAYER2BFILTER (Bitfield-Mask: 0x01)                   */
#define DC_LAYER2MODE_LAYER2PREMULT_Pos   (28UL)                    /*!< LAYER2PREMULT (Bit 28)                                */
#define DC_LAYER2MODE_LAYER2PREMULT_Msk   (0x10000000UL)            /*!< LAYER2PREMULT (Bitfield-Mask: 0x01)                   */
#define DC_LAYER2MODE_LAYER2HLOCK_Pos     (27UL)                    /*!< LAYER2HLOCK (Bit 27)                                  */
#define DC_LAYER2MODE_LAYER2HLOCK_Msk     (0x8000000UL)             /*!< LAYER2HLOCK (Bitfield-Mask: 0x01)                     */
#define DC_LAYER2MODE_LAYER2GAMMA_Pos     (26UL)                    /*!< LAYER2GAMMA (Bit 26)                                  */
#define DC_LAYER2MODE_LAYER2GAMMA_Msk     (0x4000000UL)             /*!< LAYER2GAMMA (Bitfield-Mask: 0x01)                     */
#define DC_LAYER2MODE_RSVD1_Pos           (24UL)                    /*!< RSVD1 (Bit 24)                                        */
#define DC_LAYER2MODE_RSVD1_Msk           (0x3000000UL)             /*!< RSVD1 (Bitfield-Mask: 0x03)                           */
#define DC_LAYER2MODE_LAYER2ALPHA_Pos     (16UL)                    /*!< LAYER2ALPHA (Bit 16)                                  */
#define DC_LAYER2MODE_LAYER2ALPHA_Msk     (0xff0000UL)              /*!< LAYER2ALPHA (Bitfield-Mask: 0xff)                     */
#define DC_LAYER2MODE_LAYER2DBLEND_Pos    (12UL)                    /*!< LAYER2DBLEND (Bit 12)                                 */
#define DC_LAYER2MODE_LAYER2DBLEND_Msk    (0xf000UL)                /*!< LAYER2DBLEND (Bitfield-Mask: 0x0f)                    */
#define DC_LAYER2MODE_LAYER2SBLEND_Pos    (8UL)                     /*!< LAYER2SBLEND (Bit 8)                                  */
#define DC_LAYER2MODE_LAYER2SBLEND_Msk    (0xf00UL)                 /*!< LAYER2SBLEND (Bitfield-Mask: 0x0f)                    */
#define DC_LAYER2MODE_RSVD0_Pos           (5UL)                     /*!< RSVD0 (Bit 5)                                         */
#define DC_LAYER2MODE_RSVD0_Msk           (0xe0UL)                  /*!< RSVD0 (Bitfield-Mask: 0x07)                           */
#define DC_LAYER2MODE_LAYER2COLORMODE_Pos (0UL)                     /*!< LAYER2COLORMODE (Bit 0)                               */
#define DC_LAYER2MODE_LAYER2COLORMODE_Msk (0x1fUL)                  /*!< LAYER2COLORMODE (Bitfield-Mask: 0x1f)                 */
/* =====================================================  LAYER2STARTXY  ===================================================== */
#define DC_LAYER2STARTXY_LAYER2XOFF_Pos   (16UL)                    /*!< LAYER2XOFF (Bit 16)                                   */
#define DC_LAYER2STARTXY_LAYER2XOFF_Msk   (0xffff0000UL)            /*!< LAYER2XOFF (Bitfield-Mask: 0xffff)                    */
#define DC_LAYER2STARTXY_LAYER2YOFF_Pos   (0UL)                     /*!< LAYER2YOFF (Bit 0)                                    */
#define DC_LAYER2STARTXY_LAYER2YOFF_Msk   (0xffffUL)                /*!< LAYER2YOFF (Bitfield-Mask: 0xffff)                    */
/* =====================================================  LAYER2SIZEXY  ====================================================== */
#define DC_LAYER2SIZEXY_LAYER2PIXSZEX_Pos (16UL)                    /*!< LAYER2PIXSZEX (Bit 16)                                */
#define DC_LAYER2SIZEXY_LAYER2PIXSZEX_Msk (0xffff0000UL)            /*!< LAYER2PIXSZEX (Bitfield-Mask: 0xffff)                 */
#define DC_LAYER2SIZEXY_LAYER2PIXSZEY_Pos (0UL)                     /*!< LAYER2PIXSZEY (Bit 0)                                 */
#define DC_LAYER2SIZEXY_LAYER2PIXSZEY_Msk (0xffffUL)                /*!< LAYER2PIXSZEY (Bitfield-Mask: 0xffff)                 */
/* ======================================================  LAYER2ADDR  ======================================================= */
#define DC_LAYER2ADDR_LAYER2STARTADDRFBUF_Pos (0UL)                 /*!< LAYER2STARTADDRFBUF (Bit 0)                           */
#define DC_LAYER2ADDR_LAYER2STARTADDRFBUF_Msk (0xffffffffUL)        /*!< LAYER2STARTADDRFBUF (Bitfield-Mask: 0xffffffff)       */
/* =====================================================  LAYER2STRIDE  ====================================================== */
#define DC_LAYER2STRIDE_RSVD_Pos          (21UL)                    /*!< RSVD (Bit 21)                                         */
#define DC_LAYER2STRIDE_RSVD_Msk          (0xffe00000UL)            /*!< RSVD (Bitfield-Mask: 0x7ff)                           */
#define DC_LAYER2STRIDE_LAYER2AXIFIFOTHLD_Pos (19UL)                /*!< LAYER2AXIFIFOTHLD (Bit 19)                            */
#define DC_LAYER2STRIDE_LAYER2AXIFIFOTHLD_Msk (0x180000UL)          /*!< LAYER2AXIFIFOTHLD (Bitfield-Mask: 0x03)               */
#define DC_LAYER2STRIDE_LAYER2AXIBURSTBITS_Pos (16UL)               /*!< LAYER2AXIBURSTBITS (Bit 16)                           */
#define DC_LAYER2STRIDE_LAYER2AXIBURSTBITS_Msk (0x70000UL)          /*!< LAYER2AXIBURSTBITS (Bitfield-Mask: 0x07)              */
#define DC_LAYER2STRIDE_LAYER2STRIDEDIST_Pos (0UL)                  /*!< LAYER2STRIDEDIST (Bit 0)                              */
#define DC_LAYER2STRIDE_LAYER2STRIDEDIST_Msk (0xffffUL)             /*!< LAYER2STRIDEDIST (Bitfield-Mask: 0xffff)              */
/* ======================================================  LAYER2RESXY  ====================================================== */
#define DC_LAYER2RESXY_LAYER2PIXRESX_Pos  (16UL)                    /*!< LAYER2PIXRESX (Bit 16)                                */
#define DC_LAYER2RESXY_LAYER2PIXRESX_Msk  (0xffff0000UL)            /*!< LAYER2PIXRESX (Bitfield-Mask: 0xffff)                 */
#define DC_LAYER2RESXY_LAYER2PIXRESY_Pos  (0UL)                     /*!< LAYER2PIXRESY (Bit 0)                                 */
#define DC_LAYER2RESXY_LAYER2PIXRESY_Msk  (0xffffUL)                /*!< LAYER2PIXRESY (Bitfield-Mask: 0xffff)                 */
/* =====================================================  LAYER2SCALEX  ====================================================== */
#define DC_LAYER2SCALEX_LAYER2XFACTOR_Pos (0UL)                     /*!< LAYER2XFACTOR (Bit 0)                                 */
#define DC_LAYER2SCALEX_LAYER2XFACTOR_Msk (0xffffffffUL)            /*!< LAYER2XFACTOR (Bitfield-Mask: 0xffffffff)             */
/* =====================================================  LAYER2SCALEY  ====================================================== */
#define DC_LAYER2SCALEY_LAYER2YFACTOR_Pos (0UL)                     /*!< LAYER2YFACTOR (Bit 0)                                 */
#define DC_LAYER2SCALEY_LAYER2YFACTOR_Msk (0xffffffffUL)            /*!< LAYER2YFACTOR (Bitfield-Mask: 0xffffffff)             */
/* ======================================================  LAYER3MODE  ======================================================= */
#define DC_LAYER3MODE_LAYER3EN_Pos        (31UL)                    /*!< LAYER3EN (Bit 31)                                     */
#define DC_LAYER3MODE_LAYER3EN_Msk        (0x80000000UL)            /*!< LAYER3EN (Bitfield-Mask: 0x01)                        */
#define DC_LAYER3MODE_LAYER3FORCE_Pos     (30UL)                    /*!< LAYER3FORCE (Bit 30)                                  */
#define DC_LAYER3MODE_LAYER3FORCE_Msk     (0x40000000UL)            /*!< LAYER3FORCE (Bitfield-Mask: 0x01)                     */
#define DC_LAYER3MODE_LAYER3BFILTER_Pos   (29UL)                    /*!< LAYER3BFILTER (Bit 29)                                */
#define DC_LAYER3MODE_LAYER3BFILTER_Msk   (0x20000000UL)            /*!< LAYER3BFILTER (Bitfield-Mask: 0x01)                   */
#define DC_LAYER3MODE_LAYER3PREMULT_Pos   (28UL)                    /*!< LAYER3PREMULT (Bit 28)                                */
#define DC_LAYER3MODE_LAYER3PREMULT_Msk   (0x10000000UL)            /*!< LAYER3PREMULT (Bitfield-Mask: 0x01)                   */
#define DC_LAYER3MODE_LAYER3HLOCK_Pos     (27UL)                    /*!< LAYER3HLOCK (Bit 27)                                  */
#define DC_LAYER3MODE_LAYER3HLOCK_Msk     (0x8000000UL)             /*!< LAYER3HLOCK (Bitfield-Mask: 0x01)                     */
#define DC_LAYER3MODE_LAYER3GAMMA_Pos     (26UL)                    /*!< LAYER3GAMMA (Bit 26)                                  */
#define DC_LAYER3MODE_LAYER3GAMMA_Msk     (0x4000000UL)             /*!< LAYER3GAMMA (Bitfield-Mask: 0x01)                     */
#define DC_LAYER3MODE_RSVD1_Pos           (24UL)                    /*!< RSVD1 (Bit 24)                                        */
#define DC_LAYER3MODE_RSVD1_Msk           (0x3000000UL)             /*!< RSVD1 (Bitfield-Mask: 0x03)                           */
#define DC_LAYER3MODE_LAYER3ALPHA_Pos     (16UL)                    /*!< LAYER3ALPHA (Bit 16)                                  */
#define DC_LAYER3MODE_LAYER3ALPHA_Msk     (0xff0000UL)              /*!< LAYER3ALPHA (Bitfield-Mask: 0xff)                     */
#define DC_LAYER3MODE_LAYER3DBLEND_Pos    (12UL)                    /*!< LAYER3DBLEND (Bit 12)                                 */
#define DC_LAYER3MODE_LAYER3DBLEND_Msk    (0xf000UL)                /*!< LAYER3DBLEND (Bitfield-Mask: 0x0f)                    */
#define DC_LAYER3MODE_LAYER3SBLEND_Pos    (8UL)                     /*!< LAYER3SBLEND (Bit 8)                                  */
#define DC_LAYER3MODE_LAYER3SBLEND_Msk    (0xf00UL)                 /*!< LAYER3SBLEND (Bitfield-Mask: 0x0f)                    */
#define DC_LAYER3MODE_RSVD0_Pos           (5UL)                     /*!< RSVD0 (Bit 5)                                         */
#define DC_LAYER3MODE_RSVD0_Msk           (0xe0UL)                  /*!< RSVD0 (Bitfield-Mask: 0x07)                           */
#define DC_LAYER3MODE_LAYER3COLORMODE_Pos (0UL)                     /*!< LAYER3COLORMODE (Bit 0)                               */
#define DC_LAYER3MODE_LAYER3COLORMODE_Msk (0x1fUL)                  /*!< LAYER3COLORMODE (Bitfield-Mask: 0x1f)                 */
/* =====================================================  LAYER3STARTXY  ===================================================== */
#define DC_LAYER3STARTXY_LAYER3XOFF_Pos   (16UL)                    /*!< LAYER3XOFF (Bit 16)                                   */
#define DC_LAYER3STARTXY_LAYER3XOFF_Msk   (0xffff0000UL)            /*!< LAYER3XOFF (Bitfield-Mask: 0xffff)                    */
#define DC_LAYER3STARTXY_LAYER3YOFF_Pos   (0UL)                     /*!< LAYER3YOFF (Bit 0)                                    */
#define DC_LAYER3STARTXY_LAYER3YOFF_Msk   (0xffffUL)                /*!< LAYER3YOFF (Bitfield-Mask: 0xffff)                    */
/* =====================================================  LAYER3SIZEXY  ====================================================== */
#define DC_LAYER3SIZEXY_LAYER3PIXSZEX_Pos (16UL)                    /*!< LAYER3PIXSZEX (Bit 16)                                */
#define DC_LAYER3SIZEXY_LAYER3PIXSZEX_Msk (0xffff0000UL)            /*!< LAYER3PIXSZEX (Bitfield-Mask: 0xffff)                 */
#define DC_LAYER3SIZEXY_LAYER3PIXSZEY_Pos (0UL)                     /*!< LAYER3PIXSZEY (Bit 0)                                 */
#define DC_LAYER3SIZEXY_LAYER3PIXSZEY_Msk (0xffffUL)                /*!< LAYER3PIXSZEY (Bitfield-Mask: 0xffff)                 */
/* ======================================================  LAYER3ADDR  ======================================================= */
#define DC_LAYER3ADDR_LAYER3STARTADDRFBUF_Pos (0UL)                 /*!< LAYER3STARTADDRFBUF (Bit 0)                           */
#define DC_LAYER3ADDR_LAYER3STARTADDRFBUF_Msk (0xffffffffUL)        /*!< LAYER3STARTADDRFBUF (Bitfield-Mask: 0xffffffff)       */
/* =====================================================  LAYER3STRIDE  ====================================================== */
#define DC_LAYER3STRIDE_RSVD_Pos          (21UL)                    /*!< RSVD (Bit 21)                                         */
#define DC_LAYER3STRIDE_RSVD_Msk          (0xffe00000UL)            /*!< RSVD (Bitfield-Mask: 0x7ff)                           */
#define DC_LAYER3STRIDE_LAYER3AXIFIFOTHLD_Pos (19UL)                /*!< LAYER3AXIFIFOTHLD (Bit 19)                            */
#define DC_LAYER3STRIDE_LAYER3AXIFIFOTHLD_Msk (0x180000UL)          /*!< LAYER3AXIFIFOTHLD (Bitfield-Mask: 0x03)               */
#define DC_LAYER3STRIDE_LAYER3AXIBURSTBITS_Pos (16UL)               /*!< LAYER3AXIBURSTBITS (Bit 16)                           */
#define DC_LAYER3STRIDE_LAYER3AXIBURSTBITS_Msk (0x70000UL)          /*!< LAYER3AXIBURSTBITS (Bitfield-Mask: 0x07)              */
#define DC_LAYER3STRIDE_LAYER3STRIDEDIST_Pos (0UL)                  /*!< LAYER3STRIDEDIST (Bit 0)                              */
