AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
#define DSPI2S0_CMD_TSIZE_Pos             (8UL)                     /*!< TSIZE (Bit 8)                                         */
#define DSPI2S0_CMD_TSIZE_Msk             (0xfff00UL)               /*!< TSIZE (Bitfield-Mask: 0xfff)                          */
#define DSPI2S0_CMD_CONT_Pos              (7UL)                     /*!< CONT (Bit 7)                                          */
#define DSPI2S0_CMD_CONT_Msk              (0x80UL)                  /*!< CONT (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_CMD_OFFSETCNT_Pos         (5UL)                     /*!< OFFSETCNT (Bit 5)                                     */
#define DSPI2S0_CMD_OFFSETCNT_Msk         (0x60UL)                  /*!< OFFSETCNT (Bitfield-Mask: 0x03)                       */
#define DSPI2S0_CMD_CMD_Pos               (0UL)                     /*!< CMD (Bit 0)                                           */
#define DSPI2S0_CMD_CMD_Msk               (0x1fUL)                  /*!< CMD (Bitfield-Mask: 0x1f)                             */
/* ========================================================  CMDRPT  ========================================================= */
#define DSPI2S0_CMDRPT_CMDRPT_Pos         (0UL)                     /*!< CMDRPT (Bit 0)                                        */
#define DSPI2S0_CMDRPT_CMDRPT_Msk         (0x1fUL)                  /*!< CMDRPT (Bitfield-Mask: 0x1f)                          */
/* =======================================================  OFFSETHI  ======================================================== */
#define DSPI2S0_OFFSETHI_OFFSETHI_Pos     (0UL)                     /*!< OFFSETHI (Bit 0)                                      */
#define DSPI2S0_OFFSETHI_OFFSETHI_Msk     (0xffffUL)                /*!< OFFSETHI (Bitfield-Mask: 0xffff)                      */
/* ========================================================  CMDSTAT  ======================================================== */
#define DSPI2S0_CMDSTAT_CTSIZE_Pos        (8UL)                     /*!< CTSIZE (Bit 8)                                        */
#define DSPI2S0_CMDSTAT_CTSIZE_Msk        (0xfff00UL)               /*!< CTSIZE (Bitfield-Mask: 0xfff)                         */
#define DSPI2S0_CMDSTAT_CMDSTAT_Pos       (5UL)                     /*!< CMDSTAT (Bit 5)                                       */
#define DSPI2S0_CMDSTAT_CMDSTAT_Msk       (0xe0UL)                  /*!< CMDSTAT (Bitfield-Mask: 0x07)                         */
#define DSPI2S0_CMDSTAT_CCMD_Pos          (0UL)                     /*!< CCMD (Bit 0)                                          */
#define DSPI2S0_CMDSTAT_CCMD_Msk          (0x1fUL)                  /*!< CCMD (Bitfield-Mask: 0x1f)                            */
/* =======================================================  DMATRIGEN  ======================================================= */
#define DSPI2S0_DMATRIGEN_DTHREN_Pos      (1UL)                     /*!< DTHREN (Bit 1)                                        */
#define DSPI2S0_DMATRIGEN_DTHREN_Msk      (0x2UL)                   /*!< DTHREN (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_DMATRIGEN_DCMDCMPEN_Pos   (0UL)                     /*!< DCMDCMPEN (Bit 0)                                     */
#define DSPI2S0_DMATRIGEN_DCMDCMPEN_Msk   (0x1UL)                   /*!< DCMDCMPEN (Bitfield-Mask: 0x01)                       */
/* ======================================================  DMATRIGSTAT  ====================================================== */
#define DSPI2S0_DMATRIGSTAT_DTOTCMP_Pos   (2UL)                     /*!< DTOTCMP (Bit 2)                                       */
#define DSPI2S0_DMATRIGSTAT_DTOTCMP_Msk   (0x4UL)                   /*!< DTOTCMP (Bitfield-Mask: 0x01)                         */
#define DSPI2S0_DMATRIGSTAT_DTHR_Pos      (1UL)                     /*!< DTHR (Bit 1)                                          */
#define DSPI2S0_DMATRIGSTAT_DTHR_Msk      (0x2UL)                   /*!< DTHR (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_DMATRIGSTAT_DCMDCMP_Pos   (0UL)                     /*!< DCMDCMP (Bit 0)                                       */
#define DSPI2S0_DMATRIGSTAT_DCMDCMP_Msk   (0x1UL)                   /*!< DCMDCMP (Bitfield-Mask: 0x01)                         */
/* ========================================================  DMACFG  ========================================================= */
#define DSPI2S0_DMACFG_DPWROFF_Pos        (9UL)                     /*!< DPWROFF (Bit 9)                                       */
#define DSPI2S0_DMACFG_DPWROFF_Msk        (0x200UL)                 /*!< DPWROFF (Bitfield-Mask: 0x01)                         */
#define DSPI2S0_DMACFG_DMAPRI_Pos         (8UL)                     /*!< DMAPRI (Bit 8)                                        */
#define DSPI2S0_DMACFG_DMAPRI_Msk         (0x100UL)                 /*!< DMAPRI (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_DMACFG_DMADIR_Pos         (1UL)                     /*!< DMADIR (Bit 1)                                        */
#define DSPI2S0_DMACFG_DMADIR_Msk         (0x2UL)                   /*!< DMADIR (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_DMACFG_DMAEN_Pos          (0UL)                     /*!< DMAEN (Bit 0)                                         */
#define DSPI2S0_DMACFG_DMAEN_Msk          (0x1UL)                   /*!< DMAEN (Bitfield-Mask: 0x01)                           */
/* ======================================================  DMATOTCOUNT  ====================================================== */
#define DSPI2S0_DMATOTCOUNT_TOTCOUNT_Pos  (0UL)                     /*!< TOTCOUNT (Bit 0)                                      */
#define DSPI2S0_DMATOTCOUNT_TOTCOUNT_Msk  (0xfffUL)                 /*!< TOTCOUNT (Bitfield-Mask: 0xfff)                       */
/* ======================================================  DMATARGADDR  ====================================================== */
#define DSPI2S0_DMATARGADDR_TARGADDR28_Pos (28UL)                   /*!< TARGADDR28 (Bit 28)                                   */
#define DSPI2S0_DMATARGADDR_TARGADDR28_Msk (0x10000000UL)           /*!< TARGADDR28 (Bitfield-Mask: 0x01)                      */
#define DSPI2S0_DMATARGADDR_TARGADDR_Pos  (0UL)                     /*!< TARGADDR (Bit 0)                                      */
#define DSPI2S0_DMATARGADDR_TARGADDR_Msk  (0xfffffUL)               /*!< TARGADDR (Bitfield-Mask: 0xfffff)                     */
/* ========================================================  DMASTAT  ======================================================== */
#define DSPI2S0_DMASTAT_DMAERR_Pos        (2UL)                     /*!< DMAERR (Bit 2)                                        */
#define DSPI2S0_DMASTAT_DMAERR_Msk        (0x4UL)                   /*!< DMAERR (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_DMASTAT_DMACPL_Pos        (1UL)                     /*!< DMACPL (Bit 1)                                        */
#define DSPI2S0_DMASTAT_DMACPL_Msk        (0x2UL)                   /*!< DMACPL (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_DMASTAT_DMATIP_Pos        (0UL)                     /*!< DMATIP (Bit 0)                                        */
#define DSPI2S0_DMASTAT_DMATIP_Msk        (0x1UL)                   /*!< DMATIP (Bitfield-Mask: 0x01)                          */
/* =========================================================  CQCFG  ========================================================= */
#define DSPI2S0_CQCFG_CQPRI_Pos           (1UL)                     /*!< CQPRI (Bit 1)                                         */
#define DSPI2S0_CQCFG_CQPRI_Msk           (0x2UL)                   /*!< CQPRI (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_CQCFG_CQEN_Pos            (0UL)                     /*!< CQEN (Bit 0)                                          */
#define DSPI2S0_CQCFG_CQEN_Msk            (0x1UL)                   /*!< CQEN (Bitfield-Mask: 0x01)                            */
/* ========================================================  CQADDR  ========================================================= */
#define DSPI2S0_CQADDR_CQADDR28_Pos       (28UL)                    /*!< CQADDR28 (Bit 28)                                     */
#define DSPI2S0_CQADDR_CQADDR28_Msk       (0x10000000UL)            /*!< CQADDR28 (Bitfield-Mask: 0x01)                        */
#define DSPI2S0_CQADDR_CQADDR_Pos         (2UL)                     /*!< CQADDR (Bit 2)                                        */
#define DSPI2S0_CQADDR_CQADDR_Msk         (0xffffcUL)               /*!< CQADDR (Bitfield-Mask: 0x3ffff)                       */
/* ========================================================  CQSTAT  ========================================================= */
#define DSPI2S0_CQSTAT_CQERR_Pos          (2UL)                     /*!< CQERR (Bit 2)                                         */
#define DSPI2S0_CQSTAT_CQERR_Msk          (0x4UL)                   /*!< CQERR (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_CQSTAT_CQPAUSED_Pos       (1UL)                     /*!< CQPAUSED (Bit 1)                                      */
#define DSPI2S0_CQSTAT_CQPAUSED_Msk       (0x2UL)                   /*!< CQPAUSED (Bitfield-Mask: 0x01)                        */
#define DSPI2S0_CQSTAT_CQTIP_Pos          (0UL)                     /*!< CQTIP (Bit 0)                                         */
#define DSPI2S0_CQSTAT_CQTIP_Msk          (0x1UL)                   /*!< CQTIP (Bitfield-Mask: 0x01)                           */
/* ========================================================  CQFLAGS  ======================================================== */
#define DSPI2S0_CQFLAGS_CQIRQMASK_Pos     (16UL)                    /*!< CQIRQMASK (Bit 16)                                    */
#define DSPI2S0_CQFLAGS_CQIRQMASK_Msk     (0xffff0000UL)            /*!< CQIRQMASK (Bitfield-Mask: 0xffff)                     */
#define DSPI2S0_CQFLAGS_CQFLAGS_Pos       (0UL)                     /*!< CQFLAGS (Bit 0)                                       */
#define DSPI2S0_CQFLAGS_CQFLAGS_Msk       (0xffffUL)                /*!< CQFLAGS (Bitfield-Mask: 0xffff)                       */
/* ======================================================  CQSETCLEAR  ======================================================= */
#define DSPI2S0_CQSETCLEAR_CQFCLR_Pos     (16UL)                    /*!< CQFCLR (Bit 16)                                       */
#define DSPI2S0_CQSETCLEAR_CQFCLR_Msk     (0xff0000UL)              /*!< CQFCLR (Bitfield-Mask: 0xff)                          */
#define DSPI2S0_CQSETCLEAR_CQFTGL_Pos     (8UL)                     /*!< CQFTGL (Bit 8)                                        */
#define DSPI2S0_CQSETCLEAR_CQFTGL_Msk     (0xff00UL)                /*!< CQFTGL (Bitfield-Mask: 0xff)                          */
#define DSPI2S0_CQSETCLEAR_CQFSET_Pos     (0UL)                     /*!< CQFSET (Bit 0)                                        */
#define DSPI2S0_CQSETCLEAR_CQFSET_Msk     (0xffUL)                  /*!< CQFSET (Bitfield-Mask: 0xff)                          */
/* =======================================================  CQPAUSEEN  ======================================================= */
#define DSPI2S0_CQPAUSEEN_CQPEN_Pos       (0UL)                     /*!< CQPEN (Bit 0)                                         */
#define DSPI2S0_CQPAUSEEN_CQPEN_Msk       (0xffffUL)                /*!< CQPEN (Bitfield-Mask: 0xffff)                         */
/* =======================================================  CQCURIDX  ======================================================== */
#define DSPI2S0_CQCURIDX_CQCURIDX_Pos     (0UL)                     /*!< CQCURIDX (Bit 0)                                      */
#define DSPI2S0_CQCURIDX_CQCURIDX_Msk     (0xffUL)                  /*!< CQCURIDX (Bitfield-Mask: 0xff)                        */
/* =======================================================  CQENDIDX  ======================================================== */
#define DSPI2S0_CQENDIDX_CQENDIDX_Pos     (0UL)                     /*!< CQENDIDX (Bit 0)                                      */
#define DSPI2S0_CQENDIDX_CQENDIDX_Msk     (0xffUL)                  /*!< CQENDIDX (Bitfield-Mask: 0xff)                        */
/* ========================================================  STATUS  ========================================================= */
#define DSPI2S0_STATUS_IDLEST_Pos         (2UL)                     /*!< IDLEST (Bit 2)                                        */
#define DSPI2S0_STATUS_IDLEST_Msk         (0x4UL)                   /*!< IDLEST (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_STATUS_CMDACT_Pos         (1UL)                     /*!< CMDACT (Bit 1)                                        */
#define DSPI2S0_STATUS_CMDACT_Msk         (0x2UL)                   /*!< CMDACT (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_STATUS_ERR_Pos            (0UL)                     /*!< ERR (Bit 0)                                           */
#define DSPI2S0_STATUS_ERR_Msk            (0x1UL)                   /*!< ERR (Bitfield-Mask: 0x01)                             */
/* ========================================================  MSPICFG  ======================================================== */
#define DSPI2S0_MSPICFG_MSPIRST_Pos       (30UL)                    /*!< MSPIRST (Bit 30)                                      */
#define DSPI2S0_MSPICFG_MSPIRST_Msk       (0x40000000UL)            /*!< MSPIRST (Bitfield-Mask: 0x01)                         */
#define DSPI2S0_MSPICFG_DOUTDLY_Pos       (27UL)                    /*!< DOUTDLY (Bit 27)                                      */
#define DSPI2S0_MSPICFG_DOUTDLY_Msk       (0x38000000UL)            /*!< DOUTDLY (Bitfield-Mask: 0x07)                         */
#define DSPI2S0_MSPICFG_DINDLY_Pos        (24UL)                    /*!< DINDLY (Bit 24)                                       */
#define DSPI2S0_MSPICFG_DINDLY_Msk        (0x7000000UL)             /*!< DINDLY (Bitfield-Mask: 0x07)                          */
#define DSPI2S0_MSPICFG_SPILSB_Pos        (23UL)                    /*!< SPILSB (Bit 23)                                       */
#define DSPI2S0_MSPICFG_SPILSB_Msk        (0x800000UL)              /*!< SPILSB (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_MSPICFG_RDFCPOL_Pos       (22UL)                    /*!< RDFCPOL (Bit 22)                                      */
#define DSPI2S0_MSPICFG_RDFCPOL_Msk       (0x400000UL)              /*!< RDFCPOL (Bitfield-Mask: 0x01)                         */
#define DSPI2S0_MSPICFG_WTFCPOL_Pos       (21UL)                    /*!< WTFCPOL (Bit 21)                                      */
#define DSPI2S0_MSPICFG_WTFCPOL_Msk       (0x200000UL)              /*!< WTFCPOL (Bitfield-Mask: 0x01)                         */
#define DSPI2S0_MSPICFG_WTFCIRQ_Pos       (20UL)                    /*!< WTFCIRQ (Bit 20)                                      */
#define DSPI2S0_MSPICFG_WTFCIRQ_Msk       (0x100000UL)              /*!< WTFCIRQ (Bitfield-Mask: 0x01)                         */
#define DSPI2S0_MSPICFG_MOSIINV_Pos       (18UL)                    /*!< MOSIINV (Bit 18)                                      */
#define DSPI2S0_MSPICFG_MOSIINV_Msk       (0x40000UL)               /*!< MOSIINV (Bitfield-Mask: 0x01)                         */
#define DSPI2S0_MSPICFG_RDFC_Pos          (17UL)                    /*!< RDFC (Bit 17)                                         */
#define DSPI2S0_MSPICFG_RDFC_Msk          (0x20000UL)               /*!< RDFC (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_MSPICFG_WTFC_Pos          (16UL)                    /*!< WTFC (Bit 16)                                         */
#define DSPI2S0_MSPICFG_WTFC_Msk          (0x10000UL)               /*!< WTFC (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_MSPICFG_FULLDUP_Pos       (2UL)                     /*!< FULLDUP (Bit 2)                                       */
#define DSPI2S0_MSPICFG_FULLDUP_Msk       (0x4UL)                   /*!< FULLDUP (Bitfield-Mask: 0x01)                         */
#define DSPI2S0_MSPICFG_SPHA_Pos          (1UL)                     /*!< SPHA (Bit 1)                                          */
#define DSPI2S0_MSPICFG_SPHA_Msk          (0x2UL)                   /*!< SPHA (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_MSPICFG_SPOL_Pos          (0UL)                     /*!< SPOL (Bit 0)                                          */
#define DSPI2S0_MSPICFG_SPOL_Msk          (0x1UL)                   /*!< SPOL (Bitfield-Mask: 0x01)                            */
/* ========================================================  MI2CCFG  ======================================================== */
#define DSPI2S0_MI2CCFG_STRDIS_Pos        (24UL)                    /*!< STRDIS (Bit 24)                                       */
#define DSPI2S0_MI2CCFG_STRDIS_Msk        (0x1000000UL)             /*!< STRDIS (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_MI2CCFG_SMPCNT_Pos        (16UL)                    /*!< SMPCNT (Bit 16)                                       */
#define DSPI2S0_MI2CCFG_SMPCNT_Msk        (0xff0000UL)              /*!< SMPCNT (Bitfield-Mask: 0xff)                          */
#define DSPI2S0_MI2CCFG_SDAENDLY_Pos      (12UL)                    /*!< SDAENDLY (Bit 12)                                     */
#define DSPI2S0_MI2CCFG_SDAENDLY_Msk      (0xf000UL)                /*!< SDAENDLY (Bitfield-Mask: 0x0f)                        */
#define DSPI2S0_MI2CCFG_SCLENDLY_Pos      (8UL)                     /*!< SCLENDLY (Bit 8)                                      */
#define DSPI2S0_MI2CCFG_SCLENDLY_Msk      (0xf00UL)                 /*!< SCLENDLY (Bitfield-Mask: 0x0f)                        */
#define DSPI2S0_MI2CCFG_MI2CRST_Pos       (6UL)                     /*!< MI2CRST (Bit 6)                                       */
#define DSPI2S0_MI2CCFG_MI2CRST_Msk       (0x40UL)                  /*!< MI2CRST (Bitfield-Mask: 0x01)                         */
#define DSPI2S0_MI2CCFG_SDADLY_Pos        (4UL)                     /*!< SDADLY (Bit 4)                                        */
#define DSPI2S0_MI2CCFG_SDADLY_Msk        (0x30UL)                  /*!< SDADLY (Bitfield-Mask: 0x03)                          */
#define DSPI2S0_MI2CCFG_ARBEN_Pos         (2UL)                     /*!< ARBEN (Bit 2)                                         */
#define DSPI2S0_MI2CCFG_ARBEN_Msk         (0x4UL)                   /*!< ARBEN (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_MI2CCFG_I2CLSB_Pos        (1UL)                     /*!< I2CLSB (Bit 1)                                        */
#define DSPI2S0_MI2CCFG_I2CLSB_Msk        (0x2UL)                   /*!< I2CLSB (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_MI2CCFG_ADDRSZ_Pos        (0UL)                     /*!< ADDRSZ (Bit 0)                                        */
#define DSPI2S0_MI2CCFG_ADDRSZ_Msk        (0x1UL)                   /*!< ADDRSZ (Bitfield-Mask: 0x01)                          */
/* ========================================================  DEVCFG  ========================================================= */
#define DSPI2S0_DEVCFG_DEVADDR_Pos        (0UL)                     /*!< DEVADDR (Bit 0)                                       */
#define DSPI2S0_DEVCFG_DEVADDR_Msk        (0x3ffUL)                 /*!< DEVADDR (Bitfield-Mask: 0x3ff)                        */
/* ========================================================  IOMDBG  ========================================================= */
#define DSPI2S0_IOMDBG_DBGDATA_Pos        (3UL)                     /*!< DBGDATA (Bit 3)                                       */
#define DSPI2S0_IOMDBG_DBGDATA_Msk        (0xfffffff8UL)            /*!< DBGDATA (Bitfield-Mask: 0x1fffffff)                   */
#define DSPI2S0_IOMDBG_APBCLKON_Pos       (2UL)                     /*!< APBCLKON (Bit 2)                                      */
#define DSPI2S0_IOMDBG_APBCLKON_Msk       (0x4UL)                   /*!< APBCLKON (Bitfield-Mask: 0x01)                        */
#define DSPI2S0_IOMDBG_IOCLKON_Pos        (1UL)                     /*!< IOCLKON (Bit 1)                                       */
#define DSPI2S0_IOMDBG_IOCLKON_Msk        (0x2UL)                   /*!< IOCLKON (Bitfield-Mask: 0x01)                         */
#define DSPI2S0_IOMDBG_DBGEN_Pos          (0UL)                     /*!< DBGEN (Bit 0)                                         */
#define DSPI2S0_IOMDBG_DBGEN_Msk          (0x1UL)                   /*!< DBGEN (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                            DSP                                            ================ */
/* =========================================================================================================================== */

