AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
#define I3C_QUEUESIZECTRL_RXDATABUFFERSIZE_Pos (16UL)               /*!< RXDATABUFFERSIZE (Bit 16)                             */
#define I3C_QUEUESIZECTRL_RXDATABUFFERSIZE_Msk (0xff0000UL)         /*!< RXDATABUFFERSIZE (Bitfield-Mask: 0xff)                */
#define I3C_QUEUESIZECTRL_IBI_Pos         (8UL)                     /*!< IBI (Bit 8)                                           */
#define I3C_QUEUESIZECTRL_IBI_Msk         (0xff00UL)                /*!< IBI (Bitfield-Mask: 0xff)                             */
#define I3C_QUEUESIZECTRL_CRQUEUESIZE_Pos (0UL)                     /*!< CRQUEUESIZE (Bit 0)                                   */
#define I3C_QUEUESIZECTRL_CRQUEUESIZE_Msk (0xffUL)                  /*!< CRQUEUESIZE (Bitfield-Mask: 0xff)                     */
/* =====================================================  PIOINTRSTATUS  ===================================================== */
#define I3C_PIOINTRSTATUS_TRANSFERERRSTAT_Pos (9UL)                 /*!< TRANSFERERRSTAT (Bit 9)                               */
#define I3C_PIOINTRSTATUS_TRANSFERERRSTAT_Msk (0x200UL)             /*!< TRANSFERERRSTAT (Bitfield-Mask: 0x01)                 */
#define I3C_PIOINTRSTATUS_TRANSFERABORTSTAT_Pos (5UL)               /*!< TRANSFERABORTSTAT (Bit 5)                             */
#define I3C_PIOINTRSTATUS_TRANSFERABORTSTAT_Msk (0x20UL)            /*!< TRANSFERABORTSTAT (Bitfield-Mask: 0x01)               */
#define I3C_PIOINTRSTATUS_RESPREADYSTAT_Pos (4UL)                   /*!< RESPREADYSTAT (Bit 4)                                 */
#define I3C_PIOINTRSTATUS_RESPREADYSTAT_Msk (0x10UL)                /*!< RESPREADYSTAT (Bitfield-Mask: 0x01)                   */
#define I3C_PIOINTRSTATUS_CMDQUEUEREADYSTAT_Pos (3UL)               /*!< CMDQUEUEREADYSTAT (Bit 3)                             */
#define I3C_PIOINTRSTATUS_CMDQUEUEREADYSTAT_Msk (0x8UL)             /*!< CMDQUEUEREADYSTAT (Bitfield-Mask: 0x01)               */
#define I3C_PIOINTRSTATUS_IBISTATUSTHLDSTAT_Pos (2UL)               /*!< IBISTATUSTHLDSTAT (Bit 2)                             */
#define I3C_PIOINTRSTATUS_IBISTATUSTHLDSTAT_Msk (0x4UL)             /*!< IBISTATUSTHLDSTAT (Bitfield-Mask: 0x01)               */
#define I3C_PIOINTRSTATUS_RXTHLDSTAT_Pos  (1UL)                     /*!< RXTHLDSTAT (Bit 1)                                    */
#define I3C_PIOINTRSTATUS_RXTHLDSTAT_Msk  (0x2UL)                   /*!< RXTHLDSTAT (Bitfield-Mask: 0x01)                      */
#define I3C_PIOINTRSTATUS_TXTHLDSTAT_Pos  (0UL)                     /*!< TXTHLDSTAT (Bit 0)                                    */
#define I3C_PIOINTRSTATUS_TXTHLDSTAT_Msk  (0x1UL)                   /*!< TXTHLDSTAT (Bitfield-Mask: 0x01)                      */
/* ==================================================  PIOINTRSTATUSENABLE  ================================================== */
#define I3C_PIOINTRSTATUSENABLE_TRANSFERERRSTATEN_Pos (9UL)         /*!< TRANSFERERRSTATEN (Bit 9)                             */
#define I3C_PIOINTRSTATUSENABLE_TRANSFERERRSTATEN_Msk (0x200UL)     /*!< TRANSFERERRSTATEN (Bitfield-Mask: 0x01)               */
#define I3C_PIOINTRSTATUSENABLE_TRANSFERABORTSTATEN_Pos (5UL)       /*!< TRANSFERABORTSTATEN (Bit 5)                           */
#define I3C_PIOINTRSTATUSENABLE_TRANSFERABORTSTATEN_Msk (0x20UL)    /*!< TRANSFERABORTSTATEN (Bitfield-Mask: 0x01)             */
#define I3C_PIOINTRSTATUSENABLE_RESPREADYSTATEN_Pos (4UL)           /*!< RESPREADYSTATEN (Bit 4)                               */
#define I3C_PIOINTRSTATUSENABLE_RESPREADYSTATEN_Msk (0x10UL)        /*!< RESPREADYSTATEN (Bitfield-Mask: 0x01)                 */
#define I3C_PIOINTRSTATUSENABLE_CMDQUEUEREADYSTATEN_Pos (3UL)       /*!< CMDQUEUEREADYSTATEN (Bit 3)                           */
#define I3C_PIOINTRSTATUSENABLE_CMDQUEUEREADYSTATEN_Msk (0x8UL)     /*!< CMDQUEUEREADYSTATEN (Bitfield-Mask: 0x01)             */
#define I3C_PIOINTRSTATUSENABLE_IBISTATUSTHLDSTATEN_Pos (2UL)       /*!< IBISTATUSTHLDSTATEN (Bit 2)                           */
#define I3C_PIOINTRSTATUSENABLE_IBISTATUSTHLDSTATEN_Msk (0x4UL)     /*!< IBISTATUSTHLDSTATEN (Bitfield-Mask: 0x01)             */
#define I3C_PIOINTRSTATUSENABLE_RXTHLDSTATEN_Pos (1UL)              /*!< RXTHLDSTATEN (Bit 1)                                  */
#define I3C_PIOINTRSTATUSENABLE_RXTHLDSTATEN_Msk (0x2UL)            /*!< RXTHLDSTATEN (Bitfield-Mask: 0x01)                    */
#define I3C_PIOINTRSTATUSENABLE_TXTHLDSTATEN_Pos (0UL)              /*!< TXTHLDSTATEN (Bit 0)                                  */
#define I3C_PIOINTRSTATUSENABLE_TXTHLDSTATEN_Msk (0x1UL)            /*!< TXTHLDSTATEN (Bitfield-Mask: 0x01)                    */
/* ==================================================  PIOINTRSIGNALENABLE  ================================================== */
#define I3C_PIOINTRSIGNALENABLE_TRANSFERERRSIGNALEN_Pos (9UL)       /*!< TRANSFERERRSIGNALEN (Bit 9)                           */
#define I3C_PIOINTRSIGNALENABLE_TRANSFERERRSIGNALEN_Msk (0x200UL)   /*!< TRANSFERERRSIGNALEN (Bitfield-Mask: 0x01)             */
#define I3C_PIOINTRSIGNALENABLE_TRANSFERABORTSIGNALEN_Pos (5UL)     /*!< TRANSFERABORTSIGNALEN (Bit 5)                         */
#define I3C_PIOINTRSIGNALENABLE_TRANSFERABORTSIGNALEN_Msk (0x20UL)  /*!< TRANSFERABORTSIGNALEN (Bitfield-Mask: 0x01)           */
#define I3C_PIOINTRSIGNALENABLE_RESPREADYSIGNALEN_Pos (4UL)         /*!< RESPREADYSIGNALEN (Bit 4)                             */
#define I3C_PIOINTRSIGNALENABLE_RESPREADYSIGNALEN_Msk (0x10UL)      /*!< RESPREADYSIGNALEN (Bitfield-Mask: 0x01)               */
#define I3C_PIOINTRSIGNALENABLE_CMDQUEUEREADYSIGNALEN_Pos (3UL)     /*!< CMDQUEUEREADYSIGNALEN (Bit 3)                         */
#define I3C_PIOINTRSIGNALENABLE_CMDQUEUEREADYSIGNALEN_Msk (0x8UL)   /*!< CMDQUEUEREADYSIGNALEN (Bitfield-Mask: 0x01)           */
#define I3C_PIOINTRSIGNALENABLE_IBITHLDSIGNALEN_Pos (2UL)           /*!< IBITHLDSIGNALEN (Bit 2)                               */
#define I3C_PIOINTRSIGNALENABLE_IBITHLDSIGNALEN_Msk (0x4UL)         /*!< IBITHLDSIGNALEN (Bitfield-Mask: 0x01)                 */
#define I3C_PIOINTRSIGNALENABLE_RXTHLDSIGNALEN_Pos (1UL)            /*!< RXTHLDSIGNALEN (Bit 1)                                */
#define I3C_PIOINTRSIGNALENABLE_RXTHLDSIGNALEN_Msk (0x2UL)          /*!< RXTHLDSIGNALEN (Bitfield-Mask: 0x01)                  */
#define I3C_PIOINTRSIGNALENABLE_TXTHLDSIGNALEN_Pos (0UL)            /*!< TXTHLDSIGNALEN (Bit 0)                                */
#define I3C_PIOINTRSIGNALENABLE_TXTHLDSIGNALEN_Msk (0x1UL)          /*!< TXTHLDSIGNALEN (Bitfield-Mask: 0x01)                  */
/* =====================================================  PIOINTRFORCE  ====================================================== */
#define I3C_PIOINTRFORCE_TRANSFERERRFORCE_Pos (9UL)                 /*!< TRANSFERERRFORCE (Bit 9)                              */
#define I3C_PIOINTRFORCE_TRANSFERERRFORCE_Msk (0x200UL)             /*!< TRANSFERERRFORCE (Bitfield-Mask: 0x01)                */
#define I3C_PIOINTRFORCE_TRANSFERABORTFORCE_Pos (5UL)               /*!< TRANSFERABORTFORCE (Bit 5)                            */
#define I3C_PIOINTRFORCE_TRANSFERABORTFORCE_Msk (0x20UL)            /*!< TRANSFERABORTFORCE (Bitfield-Mask: 0x01)              */
#define I3C_PIOINTRFORCE_RESPREADYFORCE_Pos (4UL)                   /*!< RESPREADYFORCE (Bit 4)                                */
#define I3C_PIOINTRFORCE_RESPREADYFORCE_Msk (0x10UL)                /*!< RESPREADYFORCE (Bitfield-Mask: 0x01)                  */
#define I3C_PIOINTRFORCE_CMDQUEUEREADYFORCE_Pos (3UL)               /*!< CMDQUEUEREADYFORCE (Bit 3)                            */
#define I3C_PIOINTRFORCE_CMDQUEUEREADYFORCE_Msk (0x8UL)             /*!< CMDQUEUEREADYFORCE (Bitfield-Mask: 0x01)              */
#define I3C_PIOINTRFORCE_IBITHLDFORCE_Pos (2UL)                     /*!< IBITHLDFORCE (Bit 2)                                  */
#define I3C_PIOINTRFORCE_IBITHLDFORCE_Msk (0x4UL)                   /*!< IBITHLDFORCE (Bitfield-Mask: 0x01)                    */
#define I3C_PIOINTRFORCE_RXTHLDFORCE_Pos  (1UL)                     /*!< RXTHLDFORCE (Bit 1)                                   */
#define I3C_PIOINTRFORCE_RXTHLDFORCE_Msk  (0x2UL)                   /*!< RXTHLDFORCE (Bitfield-Mask: 0x01)                     */
#define I3C_PIOINTRFORCE_TXTHLDFORCE_Pos  (0UL)                     /*!< TXTHLDFORCE (Bit 0)                                   */
#define I3C_PIOINTRFORCE_TXTHLDFORCE_Msk  (0x1UL)                   /*!< TXTHLDFORCE (Bitfield-Mask: 0x01)                     */
/* =====================================================  EXTCAPHEADER  ====================================================== */
#define I3C_EXTCAPHEADER_CAPLENGTH_Pos    (8UL)                     /*!< CAPLENGTH (Bit 8)                                     */
#define I3C_EXTCAPHEADER_CAPLENGTH_Msk    (0xffff00UL)              /*!< CAPLENGTH (Bitfield-Mask: 0xffff)                     */
#define I3C_EXTCAPHEADER_CAPID_Pos        (0UL)                     /*!< CAPID (Bit 0)                                         */
#define I3C_EXTCAPHEADER_CAPID_Msk        (0xffUL)                  /*!< CAPID (Bitfield-Mask: 0xff)                           */
/* ===================================================  COMPMANUFACTURER  ==================================================== */
#define I3C_COMPMANUFACTURER_MIPIVENDORID_Pos (0UL)                 /*!< MIPIVENDORID (Bit 0)                                  */
#define I3C_COMPMANUFACTURER_MIPIVENDORID_Msk (0xffffffffUL)        /*!< MIPIVENDORID (Bitfield-Mask: 0xffffffff)              */
/* ======================================================  COMPVERSION  ====================================================== */
#define I3C_COMPVERSION_I3CVERID_Pos      (0UL)                     /*!< I3CVERID (Bit 0)                                      */
#define I3C_COMPVERSION_I3CVERID_Msk      (0xffffffffUL)            /*!< I3CVERID (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  COMPTYPE  ======================================================== */
#define I3C_COMPTYPE_I3CPRODUCTID_Pos     (0UL)                     /*!< I3CPRODUCTID (Bit 0)                                  */
#define I3C_COMPTYPE_I3CPRODUCTID_Msk     (0xffffffffUL)            /*!< I3CPRODUCTID (Bitfield-Mask: 0xffffffff)              */
/* =====================================================  MASTERCONFIG  ====================================================== */
#define I3C_MASTERCONFIG_OPERATIONMODE_Pos (4UL)                    /*!< OPERATIONMODE (Bit 4)                                 */
#define I3C_MASTERCONFIG_OPERATIONMODE_Msk (0x30UL)                 /*!< OPERATIONMODE (Bitfield-Mask: 0x03)                   */
/* ========================================================  CRSETUP  ======================================================== */
#define I3C_CRSETUP_XFERSTRUCTSIZE_Pos    (24UL)                    /*!< XFERSTRUCTSIZE (Bit 24)                               */
#define I3C_CRSETUP_XFERSTRUCTSIZE_Msk    (0xff000000UL)            /*!< XFERSTRUCTSIZE (Bitfield-Mask: 0xff)                  */
#define I3C_CRSETUP_RESPSTRUCTSIZE_Pos    (16UL)                    /*!< RESPSTRUCTSIZE (Bit 16)                               */
#define I3C_CRSETUP_RESPSTRUCTSIZE_Msk    (0xff0000UL)              /*!< RESPSTRUCTSIZE (Bitfield-Mask: 0xff)                  */
#define I3C_CRSETUP_RINGSIZE_Pos          (0UL)                     /*!< RINGSIZE (Bit 0)                                      */
#define I3C_CRSETUP_RINGSIZE_Msk          (0xffUL)                  /*!< RINGSIZE (Bitfield-Mask: 0xff)                        */
/* =======================================================  IBISETUP  ======================================================== */
#define I3C_IBISETUP_IBISTATUSSTRUCTSIZE_Pos (24UL)                 /*!< IBISTATUSSTRUCTSIZE (Bit 24)                          */
#define I3C_IBISETUP_IBISTATUSSTRUCTSIZE_Msk (0xff000000UL)         /*!< IBISTATUSSTRUCTSIZE (Bitfield-Mask: 0xff)             */
#define I3C_IBISETUP_IBISTATUSRINGSIZE_Pos (16UL)                   /*!< IBISTATUSRINGSIZE (Bit 16)                            */
#define I3C_IBISETUP_IBISTATUSRINGSIZE_Msk (0xff0000UL)             /*!< IBISTATUSRINGSIZE (Bitfield-Mask: 0xff)               */
#define I3C_IBISETUP_CHUNKSIZE_Pos        (10UL)                    /*!< CHUNKSIZE (Bit 10)                                    */
#define I3C_IBISETUP_CHUNKSIZE_Msk        (0x1c00UL)                /*!< CHUNKSIZE (Bitfield-Mask: 0x07)                       */
#define I3C_IBISETUP_CHUNKCOUNT_Pos       (0UL)                     /*!< CHUNKCOUNT (Bit 0)                                    */
#define I3C_IBISETUP_CHUNKCOUNT_Msk       (0x3ffUL)                 /*!< CHUNKCOUNT (Bitfield-Mask: 0x3ff)                     */
/* =====================================================  CHUNKCONTROL  ====================================================== */
#define I3C_CHUNKCONTROL_CHUNKCOUNTER_Pos (0UL)                     /*!< CHUNKCOUNTER (Bit 0)                                  */
#define I3C_CHUNKCONTROL_CHUNKCOUNTER_Msk (0xffffffffUL)            /*!< CHUNKCOUNTER (Bitfield-Mask: 0xffffffff)              */
/* =====================================================  RHINTRSTATUS  ====================================================== */
#define I3C_RHINTRSTATUS_IBIREADYSTAT_Pos (12UL)                    /*!< IBIREADYSTAT (Bit 12)                                 */
#define I3C_RHINTRSTATUS_IBIREADYSTAT_Msk (0x1000UL)                /*!< IBIREADYSTAT (Bitfield-Mask: 0x01)                    */
#define I3C_RHINTRSTATUS_TRANSFERCOMPLETIONSTAT_Pos (11UL)          /*!< TRANSFERCOMPLETIONSTAT (Bit 11)                       */
#define I3C_RHINTRSTATUS_TRANSFERCOMPLETIONSTAT_Msk (0x800UL)       /*!< TRANSFERCOMPLETIONSTAT (Bitfield-Mask: 0x01)          */
#define I3C_RHINTRSTATUS_RINGOPSTAT_Pos   (10UL)                    /*!< RINGOPSTAT (Bit 10)                                   */
#define I3C_RHINTRSTATUS_RINGOPSTAT_Msk   (0x400UL)                 /*!< RINGOPSTAT (Bitfield-Mask: 0x01)                      */
#define I3C_RHINTRSTATUS_TRANSFERERRSTAT_Pos (9UL)                  /*!< TRANSFERERRSTAT (Bit 9)                               */
#define I3C_RHINTRSTATUS_TRANSFERERRSTAT_Msk (0x200UL)              /*!< TRANSFERERRSTAT (Bitfield-Mask: 0x01)                 */
#define I3C_RHINTRSTATUS_TRANSFERABORTSTAT_Pos (5UL)                /*!< TRANSFERABORTSTAT (Bit 5)                             */
#define I3C_RHINTRSTATUS_TRANSFERABORTSTAT_Msk (0x20UL)             /*!< TRANSFERABORTSTAT (Bitfield-Mask: 0x01)               */
/* ==================================================  RHINTRSTATUSENABLE  =================================================== */
#define I3C_RHINTRSTATUSENABLE_IBIREADYSTATEN_Pos (12UL)            /*!< IBIREADYSTATEN (Bit 12)                               */
#define I3C_RHINTRSTATUSENABLE_IBIREADYSTATEN_Msk (0x1000UL)        /*!< IBIREADYSTATEN (Bitfield-Mask: 0x01)                  */
#define I3C_RHINTRSTATUSENABLE_TRANSFERCOMPLETION_Pos (11UL)        /*!< TRANSFERCOMPLETION (Bit 11)                           */
#define I3C_RHINTRSTATUSENABLE_TRANSFERCOMPLETION_Msk (0x800UL)     /*!< TRANSFERCOMPLETION (Bitfield-Mask: 0x01)              */
#define I3C_RHINTRSTATUSENABLE_RINGOP_Pos (10UL)                    /*!< RINGOP (Bit 10)                                       */
#define I3C_RHINTRSTATUSENABLE_RINGOP_Msk (0x400UL)                 /*!< RINGOP (Bitfield-Mask: 0x01)                          */
#define I3C_RHINTRSTATUSENABLE_TRANSFERERRSTATEN_Pos (9UL)          /*!< TRANSFERERRSTATEN (Bit 9)                             */
#define I3C_RHINTRSTATUSENABLE_TRANSFERERRSTATEN_Msk (0x200UL)      /*!< TRANSFERERRSTATEN (Bitfield-Mask: 0x01)               */
#define I3C_RHINTRSTATUSENABLE_TRANSFERABORTSTATEN_Pos (5UL)        /*!< TRANSFERABORTSTATEN (Bit 5)                           */
#define I3C_RHINTRSTATUSENABLE_TRANSFERABORTSTATEN_Msk (0x20UL)     /*!< TRANSFERABORTSTATEN (Bitfield-Mask: 0x01)             */
/* ==================================================  RHINTRSIGNALENABLE  =================================================== */
#define I3C_RHINTRSIGNALENABLE_IBIREADYSIGNALEN_Pos (12UL)          /*!< IBIREADYSIGNALEN (Bit 12)                             */
#define I3C_RHINTRSIGNALENABLE_IBIREADYSIGNALEN_Msk (0x1000UL)      /*!< IBIREADYSIGNALEN (Bitfield-Mask: 0x01)                */
#define I3C_RHINTRSIGNALENABLE_TRANSFERCOMPLETION_Pos (11UL)        /*!< TRANSFERCOMPLETION (Bit 11)                           */
#define I3C_RHINTRSIGNALENABLE_TRANSFERCOMPLETION_Msk (0x800UL)     /*!< TRANSFERCOMPLETION (Bitfield-Mask: 0x01)              */
#define I3C_RHINTRSIGNALENABLE_RINGOP_Pos (10UL)                    /*!< RINGOP (Bit 10)                                       */
#define I3C_RHINTRSIGNALENABLE_RINGOP_Msk (0x400UL)                 /*!< RINGOP (Bitfield-Mask: 0x01)                          */
#define I3C_RHINTRSIGNALENABLE_TRANSFERERRSIGNALEN_Pos (9UL)        /*!< TRANSFERERRSIGNALEN (Bit 9)                           */
#define I3C_RHINTRSIGNALENABLE_TRANSFERERRSIGNALEN_Msk (0x200UL)    /*!< TRANSFERERRSIGNALEN (Bitfield-Mask: 0x01)             */
#define I3C_RHINTRSIGNALENABLE_TRANSFERABORTSIGNALEN_Pos (5UL)      /*!< TRANSFERABORTSIGNALEN (Bit 5)                         */
#define I3C_RHINTRSIGNALENABLE_TRANSFERABORTSIGNALEN_Msk (0x20UL)   /*!< TRANSFERABORTSIGNALEN (Bitfield-Mask: 0x01)           */
/* ======================================================  RHINTRFORCE  ====================================================== */
#define I3C_RHINTRFORCE_IBIREADYFORCE_Pos (12UL)                    /*!< IBIREADYFORCE (Bit 12)                                */
#define I3C_RHINTRFORCE_IBIREADYFORCE_Msk (0x1000UL)                /*!< IBIREADYFORCE (Bitfield-Mask: 0x01)                   */
#define I3C_RHINTRFORCE_TRANSFERCOMPLETIONFORCE_Pos (11UL)          /*!< TRANSFERCOMPLETIONFORCE (Bit 11)                      */
#define I3C_RHINTRFORCE_TRANSFERCOMPLETIONFORCE_Msk (0x800UL)       /*!< TRANSFERCOMPLETIONFORCE (Bitfield-Mask: 0x01)         */
#define I3C_RHINTRFORCE_RINGOPFORCE_Pos   (10UL)                    /*!< RINGOPFORCE (Bit 10)                                  */
#define I3C_RHINTRFORCE_RINGOPFORCE_Msk   (0x400UL)                 /*!< RINGOPFORCE (Bitfield-Mask: 0x01)                     */
#define I3C_RHINTRFORCE_TRANSFERERRFORCE_Pos (9UL)                  /*!< TRANSFERERRFORCE (Bit 9)                              */
#define I3C_RHINTRFORCE_TRANSFERERRFORCE_Msk (0x200UL)              /*!< TRANSFERERRFORCE (Bitfield-Mask: 0x01)                */
#define I3C_RHINTRFORCE_TRANSFERABORTFORCE_Pos (5UL)                /*!< TRANSFERABORTFORCE (Bit 5)                            */
#define I3C_RHINTRFORCE_TRANSFERABORTFORCE_Msk (0x20UL)             /*!< TRANSFERABORTFORCE (Bitfield-Mask: 0x01)              */
/* =======================================================  RHSTATUS  ======================================================== */
#define I3C_RHSTATUS_LOCKED_Pos           (3UL)                     /*!< LOCKED (Bit 3)                                        */
#define I3C_RHSTATUS_LOCKED_Msk           (0x8UL)                   /*!< LOCKED (Bitfield-Mask: 0x01)                          */
#define I3C_RHSTATUS_ABORTED_Pos          (2UL)                     /*!< ABORTED (Bit 2)                                       */
#define I3C_RHSTATUS_ABORTED_Msk          (0x4UL)                   /*!< ABORTED (Bitfield-Mask: 0x01)                         */
#define I3C_RHSTATUS_RUNNING_Pos          (1UL)                     /*!< RUNNING (Bit 1)                                       */
#define I3C_RHSTATUS_RUNNING_Msk          (0x2UL)                   /*!< RUNNING (Bitfield-Mask: 0x01)                         */
#define I3C_RHSTATUS_ENABLED_Pos          (0UL)                     /*!< ENABLED (Bit 0)                                       */
#define I3C_RHSTATUS_ENABLED_Msk          (0x1UL)                   /*!< ENABLED (Bitfield-Mask: 0x01)                         */
/* =======================================================  RHCONTROL  ======================================================= */
#define I3C_RHCONTROL_ABORT_Pos           (2UL)                     /*!< ABORT (Bit 2)                                         */
#define I3C_RHCONTROL_ABORT_Msk           (0x4UL)                   /*!< ABORT (Bitfield-Mask: 0x01)                           */
#define I3C_RHCONTROL_RS_Pos              (1UL)                     /*!< RS (Bit 1)                                            */
#define I3C_RHCONTROL_RS_Msk              (0x2UL)                   /*!< RS (Bitfield-Mask: 0x01)                              */
#define I3C_RHCONTROL_ENABLE_Pos          (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define I3C_RHCONTROL_ENABLE_Msk          (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* =====================================================  RHOPERATION1  ====================================================== */
#define I3C_RHOPERATION1_IBISWDEQPTR_Pos  (16UL)                    /*!< IBISWDEQPTR (Bit 16)                                  */
#define I3C_RHOPERATION1_IBISWDEQPTR_Msk  (0xff0000UL)              /*!< IBISWDEQPTR (Bitfield-Mask: 0xff)                     */
#define I3C_RHOPERATION1_CRSWDEQPTR_Pos   (8UL)                     /*!< CRSWDEQPTR (Bit 8)                                    */
#define I3C_RHOPERATION1_CRSWDEQPTR_Msk   (0xff00UL)                /*!< CRSWDEQPTR (Bitfield-Mask: 0xff)                      */
#define I3C_RHOPERATION1_CRENQPTR_Pos     (0UL)                     /*!< CRENQPTR (Bit 0)                                      */
#define I3C_RHOPERATION1_CRENQPTR_Msk     (0xffUL)                  /*!< CRENQPTR (Bitfield-Mask: 0xff)                        */
/* =====================================================  RHOPERATION2  ====================================================== */
#define I3C_RHOPERATION2_IBIENQPTR_Pos    (16UL)                    /*!< IBIENQPTR (Bit 16)                                    */
#define I3C_RHOPERATION2_IBIENQPTR_Msk    (0xff0000UL)              /*!< IBIENQPTR (Bitfield-Mask: 0xff)                       */
#define I3C_RHOPERATION2_CRDEQPTR_Pos     (0UL)                     /*!< CRDEQPTR (Bit 0)                                      */
#define I3C_RHOPERATION2_CRDEQPTR_Msk     (0xffUL)                  /*!< CRDEQPTR (Bitfield-Mask: 0xff)                        */
/* ====================================================  RHCMDRINGBASELO  ==================================================== */
#define I3C_RHCMDRINGBASELO_BASELO_Pos    (0UL)                     /*!< BASELO (Bit 0)                                        */
#define I3C_RHCMDRINGBASELO_BASELO_Msk    (0xffffffffUL)            /*!< BASELO (Bitfield-Mask: 0xffffffff)                    */
/* ====================================================  RHCMDRINGBASEHI  ==================================================== */
#define I3C_RHCMDRINGBASEHI_BASEHI_Pos    (0UL)                     /*!< BASEHI (Bit 0)                                        */
#define I3C_RHCMDRINGBASEHI_BASEHI_Msk    (0xffffffffUL)            /*!< BASEHI (Bitfield-Mask: 0xffffffff)                    */
/* ===================================================  RHRESPRINGBASELO  ==================================================== */
#define I3C_RHRESPRINGBASELO_BASELO_Pos   (0UL)                     /*!< BASELO (Bit 0)                                        */
#define I3C_RHRESPRINGBASELO_BASELO_Msk   (0xffffffffUL)            /*!< BASELO (Bitfield-Mask: 0xffffffff)                    */
/* ===================================================  RHRESPRINGBASEHI  ==================================================== */
