AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
/* ==============================================  AUDADC SL2CFG WCEN2 [1..1]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL2CFG_WCEN2                                                       */
  AUDADC_SL2CFG_WCEN2_WCEN             = 1,     /*!< WCEN : Enable the window compare for slot 2.                              */
} AUDADC_SL2CFG_WCEN2_Enum;

/* ==============================================  AUDADC SL2CFG SLEN2 [0..0]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL2CFG_SLEN2                                                       */
  AUDADC_SL2CFG_SLEN2_SLEN             = 1,     /*!< SLEN : Enable slot 2 for ADC conversions.                                 */
} AUDADC_SL2CFG_SLEN2_Enum;

/* ========================================================  SL3CFG  ========================================================= */
/* =============================================  AUDADC SL3CFG ADSEL3 [24..26]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL3CFG_ADSEL3                                                      */
  AUDADC_SL3CFG_ADSEL3_AVG_1_MSRMT     = 0,     /*!< AVG_1_MSRMT : Average in 1 measurement in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL3CFG_ADSEL3_AVG_2_MSRMTS    = 1,     /*!< AVG_2_MSRMTS : Average in 2 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL3CFG_ADSEL3_AVG_4_MSRMTS    = 2,     /*!< AVG_4_MSRMTS : Average in 4 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL3CFG_ADSEL3_AVG_8_MSRMT     = 3,     /*!< AVG_8_MSRMT : Average in 8 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL3CFG_ADSEL3_AVG_16_MSRMTS   = 4,     /*!< AVG_16_MSRMTS : Average in 16 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL3CFG_ADSEL3_AVG_32_MSRMTS   = 5,     /*!< AVG_32_MSRMTS : Average in 32 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL3CFG_ADSEL3_AVG_64_MSRMTS   = 6,     /*!< AVG_64_MSRMTS : Average in 64 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL3CFG_ADSEL3_AVG_128_MSRMTS  = 7,     /*!< AVG_128_MSRMTS : Average in 128 measurements in the accumulate
                                                     divide module for this slot.                                              */
} AUDADC_SL3CFG_ADSEL3_Enum;

/* ============================================  AUDADC SL3CFG PRMODE3 [16..17]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL3CFG_PRMODE3                                                     */
  AUDADC_SL3CFG_PRMODE3_P12B0          = 0,     /*!< P12B0 : 12-bit precision mode                                             */
  AUDADC_SL3CFG_PRMODE3_P12B1          = 1,     /*!< P12B1 : 12-bit precision mode                                             */
  AUDADC_SL3CFG_PRMODE3_P10B           = 2,     /*!< P10B : 10-bit precision mode                                              */
  AUDADC_SL3CFG_PRMODE3_P8B            = 3,     /*!< P8B : 8-bit precision mode                                                */
} AUDADC_SL3CFG_PRMODE3_Enum;

/* =============================================  AUDADC SL3CFG CHSEL3 [8..11]  ============================================== */
typedef enum {                                  /*!< AUDADC_SL3CFG_CHSEL3                                                      */
  AUDADC_SL3CFG_CHSEL3_SE0             = 0,     /*!< SE0 : PGA channel A0 output                                               */
  AUDADC_SL3CFG_CHSEL3_SE1             = 1,     /*!< SE1 : PGA channel A1 output                                               */
  AUDADC_SL3CFG_CHSEL3_SE2             = 2,     /*!< SE2 : PGA channel B0 output                                               */
  AUDADC_SL3CFG_CHSEL3_SE3             = 3,     /*!< SE3 : PGA channel B1 output                                               */
} AUDADC_SL3CFG_CHSEL3_Enum;

/* ==============================================  AUDADC SL3CFG WCEN3 [1..1]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL3CFG_WCEN3                                                       */
  AUDADC_SL3CFG_WCEN3_WCEN             = 1,     /*!< WCEN : Enable the window compare for slot 3.                              */
} AUDADC_SL3CFG_WCEN3_Enum;

/* ==============================================  AUDADC SL3CFG SLEN3 [0..0]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL3CFG_SLEN3                                                       */
  AUDADC_SL3CFG_SLEN3_SLEN             = 1,     /*!< SLEN : Enable slot 3 for ADC conversions.                                 */
} AUDADC_SL3CFG_SLEN3_Enum;

/* ========================================================  SL4CFG  ========================================================= */
/* =============================================  AUDADC SL4CFG ADSEL4 [24..26]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL4CFG_ADSEL4                                                      */
  AUDADC_SL4CFG_ADSEL4_AVG_1_MSRMT     = 0,     /*!< AVG_1_MSRMT : Average in 1 measurement in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL4CFG_ADSEL4_AVG_2_MSRMTS    = 1,     /*!< AVG_2_MSRMTS : Average in 2 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL4CFG_ADSEL4_AVG_4_MSRMTS    = 2,     /*!< AVG_4_MSRMTS : Average in 4 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL4CFG_ADSEL4_AVG_8_MSRMT     = 3,     /*!< AVG_8_MSRMT : Average in 8 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL4CFG_ADSEL4_AVG_16_MSRMTS   = 4,     /*!< AVG_16_MSRMTS : Average in 16 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL4CFG_ADSEL4_AVG_32_MSRMTS   = 5,     /*!< AVG_32_MSRMTS : Average in 32 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL4CFG_ADSEL4_AVG_64_MSRMTS   = 6,     /*!< AVG_64_MSRMTS : Average in 64 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL4CFG_ADSEL4_AVG_128_MSRMTS  = 7,     /*!< AVG_128_MSRMTS : Average in 128 measurements in the accumulate
                                                     divide module for this slot.                                              */
} AUDADC_SL4CFG_ADSEL4_Enum;

