AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
/* =======================================================  DMATRIGEN  ======================================================= */
/* ======================================================  DMATRIGSTAT  ====================================================== */
/* ========================================================  DMACFG  ========================================================= */
/* =============================================  DSPI2S0 DMACFG DPWROFF [9..9]  ============================================= */
typedef enum {                                  /*!< DSPI2S0_DMACFG_DPWROFF                                                    */
  DSPI2S0_DMACFG_DPWROFF_DIS           = 0,     /*!< DIS : Power off disabled                                                  */
  DSPI2S0_DMACFG_DPWROFF_EN            = 1,     /*!< EN : Power off enabled                                                    */
} DSPI2S0_DMACFG_DPWROFF_Enum;

/* =============================================  DSPI2S0 DMACFG DMAPRI [8..8]  ============================================== */
typedef enum {                                  /*!< DSPI2S0_DMACFG_DMAPRI                                                     */
  DSPI2S0_DMACFG_DMAPRI_LOW            = 0,     /*!< LOW : Low Priority (service as best effort)                               */
  DSPI2S0_DMACFG_DMAPRI_HIGH           = 1,     /*!< HIGH : High Priority (service immediately)                                */
} DSPI2S0_DMACFG_DMAPRI_Enum;

/* =============================================  DSPI2S0 DMACFG DMADIR [1..1]  ============================================== */
typedef enum {                                  /*!< DSPI2S0_DMACFG_DMADIR                                                     */
  DSPI2S0_DMACFG_DMADIR_P2M            = 0,     /*!< P2M : Peripheral to Memory (SRAM) transaction. To be set when
                                                     doing IOM read operations, ie reading data from external
                                                     devices.                                                                  */
  DSPI2S0_DMACFG_DMADIR_M2P            = 1,     /*!< M2P : Memory to Peripheral transaction. To be set when doing
                                                     IOM write operations, ie writing data to external devices.                */
} DSPI2S0_DMACFG_DMADIR_Enum;

/* ==============================================  DSPI2S0 DMACFG DMAEN [0..0]  ============================================== */
typedef enum {                                  /*!< DSPI2S0_DMACFG_DMAEN                                                      */
  DSPI2S0_DMACFG_DMAEN_DIS             = 0,     /*!< DIS : Disable DMA Function                                                */
  DSPI2S0_DMACFG_DMAEN_EN              = 1,     /*!< EN : Enable DMA Function                                                  */
} DSPI2S0_DMACFG_DMAEN_Enum;

/* ======================================================  DMATOTCOUNT  ====================================================== */
/* ======================================================  DMATARGADDR  ====================================================== */
/* ========================================================  DMASTAT  ======================================================== */
/* =========================================================  CQCFG  ========================================================= */
/* ==============================================  DSPI2S0 CQCFG CQPRI [1..1]  =============================================== */
typedef enum {                                  /*!< DSPI2S0_CQCFG_CQPRI                                                       */
  DSPI2S0_CQCFG_CQPRI_LOW              = 0,     /*!< LOW : Low Priority (service as best effort)                               */
  DSPI2S0_CQCFG_CQPRI_HIGH             = 1,     /*!< HIGH : High Priority (service immediately)                                */
} DSPI2S0_CQCFG_CQPRI_Enum;

/* ===============================================  DSPI2S0 CQCFG CQEN [0..0]  =============================================== */
typedef enum {                                  /*!< DSPI2S0_CQCFG_CQEN                                                        */
  DSPI2S0_CQCFG_CQEN_DIS               = 0,     /*!< DIS : Disable CQ Function                                                 */
  DSPI2S0_CQCFG_CQEN_EN                = 1,     /*!< EN : Enable CQ Function                                                   */
} DSPI2S0_CQCFG_CQEN_Enum;

/* ========================================================  CQADDR  ========================================================= */
/* ========================================================  CQSTAT  ========================================================= */
/* ========================================================  CQFLAGS  ======================================================== */
/* ======================================================  CQSETCLEAR  ======================================================= */
/* =======================================================  CQPAUSEEN  ======================================================= */
/* ============================================  DSPI2S0 CQPAUSEEN CQPEN [0..15]  ============================================ */
typedef enum {                                  /*!< DSPI2S0_CQPAUSEEN_CQPEN                                                   */
  DSPI2S0_CQPAUSEEN_CQPEN_IDXEQ        = 32768, /*!< IDXEQ : Pauses the command queue when the current index matches
                                                     the last index                                                            */
  DSPI2S0_CQPAUSEEN_CQPEN_BLEXOREN     = 16384, /*!< BLEXOREN : Pause command queue when input BLE bit XORed with
                                                     SWFLAG4 is '1'                                                            */
  DSPI2S0_CQPAUSEEN_CQPEN_IOMXOREN     = 8192,  /*!< IOMXOREN : Pause command queue when input IOM bit XORed with
                                                     SWFLAG3 is '1'                                                            */
  DSPI2S0_CQPAUSEEN_CQPEN_GPIOXOREN    = 4096,  /*!< GPIOXOREN : Pause command queue when input GPIO irq_bit XORed
                                                     with SWFLAG2 is '1'                                                       */
  DSPI2S0_CQPAUSEEN_CQPEN_MSPI1XNOREN  = 2048,  /*!< MSPI1XNOREN : Pause command queue when input MSPI1 bit XNORed
                                                     with SWFLAG1 is '1'                                                       */
  DSPI2S0_CQPAUSEEN_CQPEN_MSPI0XNOREN  = 1024,  /*!< MSPI0XNOREN : Pause command queue when input MSPI0 bit XNORed
                                                     with SWFLAG0 is '1'                                                       */
  DSPI2S0_CQPAUSEEN_CQPEN_MSPI1XOREN   = 512,   /*!< MSPI1XOREN : Pause command queue when input MSPI1 bit XORed
                                                     with SWFLAG1 is '1'                                                       */
  DSPI2S0_CQPAUSEEN_CQPEN_MSPI0XOREN   = 256,   /*!< MSPI0XOREN : Pause command queue when input MSPI0 bit XORed
                                                     with SWFLAG0 is '1'                                                       */
  DSPI2S0_CQPAUSEEN_CQPEN_SWFLAGEN7    = 128,   /*!< SWFLAGEN7 : Pause the command queue when software flag bit 7
                                                     is '1'.                                                                   */
  DSPI2S0_CQPAUSEEN_CQPEN_SWFLAGEN6    = 64,    /*!< SWFLAGEN6 : Pause the command queue when software flag bit 6
                                                     is '1'                                                                    */
  DSPI2S0_CQPAUSEEN_CQPEN_SWFLAGEN5    = 32,    /*!< SWFLAGEN5 : Pause the command queue when software flag bit 5
                                                     is '1'                                                                    */
  DSPI2S0_CQPAUSEEN_CQPEN_SWFLAGEN4    = 16,    /*!< SWFLAGEN4 : Pause the command queue when software flag bit 4
                                                     is '1'                                                                    */
  DSPI2S0_CQPAUSEEN_CQPEN_SWFLAGEN3    = 8,     /*!< SWFLAGEN3 : Pause the command queue when software flag bit 3
                                                     is '1'                                                                    */
  DSPI2S0_CQPAUSEEN_CQPEN_SWFLAGEN2    = 4,     /*!< SWFLAGEN2 : Pause the command queue when software flag bit 2
                                                     is '1'                                                                    */
  DSPI2S0_CQPAUSEEN_CQPEN_SWFLAGEN1    = 2,     /*!< SWFLAGEN1 : Pause the command queue when software flag bit 1
                                                     is '1'                                                                    */
  DSPI2S0_CQPAUSEEN_CQPEN_SWFLAGEN0    = 1,     /*!< SWFLAGEN0 : Pause the command queue when software flag bit 0
                                                     is '1'                                                                    */
} DSPI2S0_CQPAUSEEN_CQPEN_Enum;

