AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
/* ===============================================  IOSLAVE CFG IFCSEL [0..0]  =============================================== */
typedef enum {                                  /*!< IOSLAVE_CFG_IFCSEL                                                        */
  IOSLAVE_CFG_IFCSEL_I2C               = 0,     /*!< I2C : Selects I2C interface for the IO Slave.                             */
  IOSLAVE_CFG_IFCSEL_SPI               = 1,     /*!< SPI : Selects SPI interface for the IO Slave.                             */
} IOSLAVE_CFG_IFCSEL_Enum;

/* =========================================================  PRENC  ========================================================= */
/* =======================================================  IOINTCTL  ======================================================== */
/* ========================================================  GENADD  ========================================================= */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* ======================================================  REGACCINTEN  ====================================================== */
/* =====================================================  REGACCINTSTAT  ===================================================== */
/* =====================================================  REGACCINTCLR  ====================================================== */
/* =====================================================  REGACCINTSET  ====================================================== */


/* =========================================================================================================================== */
/* ================                                          MCUCTRL                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CHIPPN  ========================================================= */
/* ============================================  MCUCTRL CHIPPN PARTNUM [0..31]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_PARTNUM                                                    */
  MCUCTRL_CHIPPN_PARTNUM_APOLLO4       = 134217728,/*!< APOLLO4 : Apollo4 part number is 0x08xxxxxx.                           */
  MCUCTRL_CHIPPN_PARTNUM_APOLLO3P      = 117440512,/*!< APOLLO3P : Apollo3P part number is 0x07xxxxxx.                         */
  MCUCTRL_CHIPPN_PARTNUM_APOLLO3       = 100663296,/*!< APOLLO3 : Apollo3 part number is 0x06xxxxxx.                           */
  MCUCTRL_CHIPPN_PARTNUM_APOLLO2       = 50331648,/*!< APOLLO2 : Apollo2 part number is 0x03xxxxxx.                            */
  MCUCTRL_CHIPPN_PARTNUM_APOLLO        = 16777216,/*!< APOLLO : Apollo part number is 0x01xxxxxx.                              */
  MCUCTRL_CHIPPN_PARTNUM_PN_M          = 0xFF000000,/*!< PN_M : Mask for the part number field.                                 */
  MCUCTRL_CHIPPN_PARTNUM_PN_S          = 24,    /*!< PN_S : Bit position for the part number field.                            */
  MCUCTRL_CHIPPN_PARTNUM_MRAMSIZE_M    = 15728640,/*!< MRAMSIZE_M : Mask for the MRAM_SIZE field.Values:0: 0.5MB1:
                                                     1.0MB2: 1.5MB3: 2.0MB                                                     */
  MCUCTRL_CHIPPN_PARTNUM_MRAMSIZE_S    = 20,    /*!< MRAMSIZE_S : Bit position for the MRAM_SIZE field.                        */
  MCUCTRL_CHIPPN_PARTNUM_SRAMSIZE_M    = 983040,/*!< SRAMSIZE_M : Mask for the SRAM_SIZE field.Values:0: 384KB+512KB1:
                                                     384KB+1MB2: 384KB+1MB+384KB+96KB                                          */
  MCUCTRL_CHIPPN_PARTNUM_SRAMSIZE_S    = 16,    /*!< SRAMSIZE_S : Bit position for the SRAM_SIZE field.                        */
  MCUCTRL_CHIPPN_PARTNUM_REV_M         = 65280, /*!< REV_M : Mask for the revision field. Bits [15:12] are major
                                                     rev, [11:8] are minor rev.Values:0: Major Rev A, Minor
                                                     Rev 01: Major Rev B, Minor Rev 1                                          */
  MCUCTRL_CHIPPN_PARTNUM_REV_S         = 8,     /*!< REV_S : Bit position for the revision field.                              */
  MCUCTRL_CHIPPN_PARTNUM_PKG_M         = 192,   /*!< PKG_M : Mask for the package field.Values:0: SIP1: QFN2: BGA3:
                                                     CSP                                                                       */
  MCUCTRL_CHIPPN_PARTNUM_PKG_S         = 6,     /*!< PKG_S : Bit position for the package field.                               */
  MCUCTRL_CHIPPN_PARTNUM_PINS_M        = 56,    /*!< PINS_M : Mask for the pins field.Values:0: 25 pins1: 49 pins2:
                                                     64 pins3: 81 pins                                                         */
  MCUCTRL_CHIPPN_PARTNUM_PINS_S        = 3,     /*!< PINS_S : Bit position for the pins field.                                 */
  MCUCTRL_CHIPPN_PARTNUM_TEMP_S        = 1,     /*!< TEMP_S : Bit position for the temperature field.                          */
  MCUCTRL_CHIPPN_PARTNUM_QUAL_S        = 0,     /*!< QUAL_S : Bit position for the qualified field.                            */
} MCUCTRL_CHIPPN_PARTNUM_Enum;

/* ========================================================  CHIPID0  ======================================================== */
/* ============================================  MCUCTRL CHIPID0 CHIPID0 [0..31]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_CHIPID0_CHIPID0                                                   */
  MCUCTRL_CHIPID0_CHIPID0_APOLLO3      = 0,     /*!< APOLLO3 : Apollo3 CHIPID0.                                                */
} MCUCTRL_CHIPID0_CHIPID0_Enum;

