AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
/* ========================================  MCUCTRL DBGCTRL DBGDSP0TRACEEN [10..10]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGDSP0TRACEEN                                            */
  MCUCTRL_DBGCTRL_DBGDSP0TRACEEN_DIS   = 0,     /*!< DIS : Disable DSP0 trace.                                                 */
  MCUCTRL_DBGCTRL_DBGDSP0TRACEEN_EN    = 1,     /*!< EN : Enable DSP0 trace.                                                   */
} MCUCTRL_DBGCTRL_DBGDSP0TRACEEN_Enum;

/* =========================================  MCUCTRL DBGCTRL DBGETMTRACEEN [9..9]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGETMTRACEEN                                             */
  MCUCTRL_DBGCTRL_DBGETMTRACEEN_DIS    = 0,     /*!< DIS : Disable ETM trace.                                                  */
  MCUCTRL_DBGCTRL_DBGETMTRACEEN_EN     = 1,     /*!< EN : Enable ETM trace.                                                    */
} MCUCTRL_DBGCTRL_DBGETMTRACEEN_Enum;

/* ==========================================  MCUCTRL DBGCTRL DBGETBENABLE [8..8]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGETBENABLE                                              */
  MCUCTRL_DBGCTRL_DBGETBENABLE_DIS     = 0,     /*!< DIS : Disable ETB.                                                        */
  MCUCTRL_DBGCTRL_DBGETBENABLE_EN      = 1,     /*!< EN : Enable ETB.                                                          */
} MCUCTRL_DBGCTRL_DBGETBENABLE_Enum;

/* ===========================================  MCUCTRL DBGCTRL DBGCLKSEL [5..7]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGCLKSEL                                                 */
  MCUCTRL_DBGCTRL_DBGCLKSEL_LOWPWR     = 0,     /*!< LOWPWR : Low power state.                                                 */
  MCUCTRL_DBGCTRL_DBGCLKSEL_HFRCDIV2   = 1,     /*!< HFRCDIV2 : Selects HFRC divided by 2 as the source TPIU clk               */
  MCUCTRL_DBGCTRL_DBGCLKSEL_HFRCDIV8   = 2,     /*!< HFRCDIV8 : Selects HFRC divided by 8 as the source TPIU clk               */
  MCUCTRL_DBGCTRL_DBGCLKSEL_HFRCDIV16  = 3,     /*!< HFRCDIV16 : Selects HFRC divided by 16 as the source TPIU clk             */
  MCUCTRL_DBGCTRL_DBGCLKSEL_HFRCDIV32  = 4,     /*!< HFRCDIV32 : Selects HFRC divided by 32 as the source TPIU clk             */
} MCUCTRL_DBGCTRL_DBGCLKSEL_Enum;

/* =========================================  MCUCTRL DBGCTRL DBGTPIUENABLE [4..4]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGTPIUENABLE                                             */
  MCUCTRL_DBGCTRL_DBGTPIUENABLE_DIS    = 0,     /*!< DIS : Disable the TPIU.                                                   */
  MCUCTRL_DBGCTRL_DBGTPIUENABLE_EN     = 1,     /*!< EN : Enable the TPIU.                                                     */
} MCUCTRL_DBGCTRL_DBGTPIUENABLE_Enum;

/* ===========================================  MCUCTRL DBGCTRL CM4CLKSEL [1..3]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_CM4CLKSEL                                                 */
  MCUCTRL_DBGCTRL_CM4CLKSEL_LOWPWR     = 0,     /*!< LOWPWR : Low power state.                                                 */
  MCUCTRL_DBGCTRL_CM4CLKSEL_HFRCDIV2   = 1,     /*!< HFRCDIV2 : Selects HFRC divided by 2 as the source TPIU clk               */
  MCUCTRL_DBGCTRL_CM4CLKSEL_HFRCDIV8   = 2,     /*!< HFRCDIV8 : Selects HFRC divided by 8 as the source TPIU clk               */
  MCUCTRL_DBGCTRL_CM4CLKSEL_HFRCDIV16  = 3,     /*!< HFRCDIV16 : Selects HFRC divided by 16 as the source TPIU clk             */
  MCUCTRL_DBGCTRL_CM4CLKSEL_HFRCDIV32  = 4,     /*!< HFRCDIV32 : Selects HFRC divided by 32 as the source TPIU clk             */
} MCUCTRL_DBGCTRL_CM4CLKSEL_Enum;

/* =========================================  MCUCTRL DBGCTRL CM4TPIUENABLE [0..0]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_CM4TPIUENABLE                                             */
  MCUCTRL_DBGCTRL_CM4TPIUENABLE_DIS    = 0,     /*!< DIS : Disable the TPIU.                                                   */
  MCUCTRL_DBGCTRL_CM4TPIUENABLE_EN     = 1,     /*!< EN : Enable the TPIU.                                                     */
} MCUCTRL_DBGCTRL_CM4TPIUENABLE_Enum;

/* ======================================================  OTAPOINTER  ======================================================= */
/* ======================================================  APBDMACTRL  ======================================================= */
/* =========================================  MCUCTRL APBDMACTRL DECODEABORT [1..1]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_APBDMACTRL_DECODEABORT                                            */
  MCUCTRL_APBDMACTRL_DECODEABORT_DISABLE = 0,   /*!< DISABLE : Bus operations to powered down peripherals are quietly
                                                     discarded                                                                 */
  MCUCTRL_APBDMACTRL_DECODEABORT_ENABLE = 1,    /*!< ENABLE : Bus operations to powered down peripherals result in
                                                     a bus fault.                                                              */
} MCUCTRL_APBDMACTRL_DECODEABORT_Enum;

/* ==========================================  MCUCTRL APBDMACTRL DMAENABLE [0..0]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_APBDMACTRL_DMAENABLE                                              */
  MCUCTRL_APBDMACTRL_DMAENABLE_DISABLE = 0,     /*!< DISABLE : DMA operations disabled                                         */
  MCUCTRL_APBDMACTRL_DMAENABLE_ENABLE  = 1,     /*!< ENABLE : DMA operations enabled                                           */
} MCUCTRL_APBDMACTRL_DMAENABLE_Enum;

