AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
/* ======================================================  KEXTCLKSEL  ======================================================= */
/* =========================================  MCUCTRL KEXTCLKSEL KEXTCLKSEL [0..31]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_KEXTCLKSEL_KEXTCLKSEL                                             */
  MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Key    = 83,    /*!< Key : Key value to unlock the register.                                   */
} MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Enum;

/* =======================================================  SIMOBUCK4  ======================================================= */
/* ======================================================  SIMOBUCK15  ======================================================= */
/* ========================================================  PWRSW0  ========================================================= */
/* =====================================  MCUCTRL PWRSW0 PWRSWVDDMDSP1STATSEL [22..22]  ====================================== */
typedef enum {                                  /*!< MCUCTRL_PWRSW0_PWRSWVDDMDSP1STATSEL                                       */
  MCUCTRL_PWRSW0_PWRSWVDDMDSP1STATSEL_VDDC = 0, /*!< VDDC : Select VDDC rail                                                   */
  MCUCTRL_PWRSW0_PWRSWVDDMDSP1STATSEL_VDDF = 1, /*!< VDDF : Select VDDF rail                                                   */
} MCUCTRL_PWRSW0_PWRSWVDDMDSP1STATSEL_Enum;

/* =====================================  MCUCTRL PWRSW0 PWRSWVDDMDSP0STATSEL [19..19]  ====================================== */
typedef enum {                                  /*!< MCUCTRL_PWRSW0_PWRSWVDDMDSP0STATSEL                                       */
  MCUCTRL_PWRSW0_PWRSWVDDMDSP0STATSEL_VDDC = 0, /*!< VDDC : Select VDDC rail                                                   */
  MCUCTRL_PWRSW0_PWRSWVDDMDSP0STATSEL_VDDF = 1, /*!< VDDF : Select VDDF rail                                                   */
} MCUCTRL_PWRSW0_PWRSWVDDMDSP0STATSEL_Enum;

/* ========================================================  PWRSW1  ========================================================= */
/* =======================================  MCUCTRL PWRSW1 PWRSWVDDRMSTATSEL [16..16]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL                                          */
  MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_VDDC = 1,    /*!< VDDC : Select VDDC rail                                                   */
  MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_VDDFLP = 0,  /*!< VDDFLP : Select VDDFLP rail                                               */
} MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_Enum;

/* =======================================  MCUCTRL PWRSW1 PWRSWVDDRLSTATSEL [12..12]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL                                          */
  MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_VDDC = 1,    /*!< VDDC : Select VDDC rail                                                   */
  MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_VDDFLP = 0,  /*!< VDDFLP : Select VDDFLP rail                                               */
} MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_Enum;

/* ======================================  MCUCTRL PWRSW1 PWRSWVDDRDSP1STATSEL [8..8]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_PWRSW1_PWRSWVDDRDSP1STATSEL                                       */
  MCUCTRL_PWRSW1_PWRSWVDDRDSP1STATSEL_VDDC = 1, /*!< VDDC : Select VDDC rail                                                   */
  MCUCTRL_PWRSW1_PWRSWVDDRDSP1STATSEL_VDDFLP = 0,/*!< VDDFLP : Select VDDFLP rail                                              */
} MCUCTRL_PWRSW1_PWRSWVDDRDSP1STATSEL_Enum;

/* ======================================  MCUCTRL PWRSW1 PWRSWVDDRDSP0STATSEL [3..3]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_PWRSW1_PWRSWVDDRDSP0STATSEL                                       */
  MCUCTRL_PWRSW1_PWRSWVDDRDSP0STATSEL_VDDC = 1, /*!< VDDC : Select VDDC rail                                                   */
  MCUCTRL_PWRSW1_PWRSWVDDRDSP0STATSEL_VDDFLP = 0,/*!< VDDFLP : Select VDDFLP rail                                              */
} MCUCTRL_PWRSW1_PWRSWVDDRDSP0STATSEL_Enum;

/* ======================================================  FLASHWPROT0  ====================================================== */
/* ======================================================  FLASHWPROT1  ====================================================== */
/* ======================================================  FLASHWPROT2  ====================================================== */
/* ======================================================  FLASHWPROT3  ====================================================== */
/* ======================================================  FLASHRPROT0  ====================================================== */
/* ======================================================  FLASHRPROT1  ====================================================== */
/* ======================================================  FLASHRPROT2  ====================================================== */
/* ======================================================  FLASHRPROT3  ====================================================== */
/* =====================================================  DMASRAMWPROT0  ===================================================== */
/* =====================================================  DMASRAMWPROT1  ===================================================== */
/* =====================================================  DMASRAMRPROT0  ===================================================== */
/* =====================================================  DMASRAMRPROT1  ===================================================== */
/* ========================================================  AUDIO1  ========================================================= */
/* =====================================================  PGAADCIFCTRL  ====================================================== */
/* =======================================================  PGACTRL1  ======================================================== */
/* =======================================================  PGACTRL2  ======================================================== */
/* =====================================================  AUDADCPWRDLY  ====================================================== */


/* =========================================================================================================================== */
/* ================                                          MEMCPY0                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* ===============================================  MEMCPY0 CTRL HASH [8..11]  =============================================== */
typedef enum {                                  /*!< MEMCPY0_CTRL_HASH                                                         */
  MEMCPY0_CTRL_HASH_NONE               = 0,     /*!< NONE : No operation performed on data                                     */
} MEMCPY0_CTRL_HASH_Enum;

