AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
/* =============================================  MEMCPY0 CTRL FUNCTION [4..7]  ============================================== */
typedef enum {                                  /*!< MEMCPY0_CTRL_FUNCTION                                                     */
  MEMCPY0_CTRL_FUNCTION_MEMCPY         = 0,     /*!< MEMCPY : Perform memory copy operation                                    */
  MEMCPY0_CTRL_FUNCTION_READ           = 1,     /*!< READ : Perform just the read operation (useful for hashing/CRC)           */
  MEMCPY0_CTRL_FUNCTION_GENRAND        = 2,     /*!< GENRAND : Generate pseudo-random data to target (seed is SRCADDR)         */
} MEMCPY0_CTRL_FUNCTION_Enum;

/* =============================================  MEMCPY0 CTRL PRIORITY [1..1]  ============================================== */
typedef enum {                                  /*!< MEMCPY0_CTRL_PRIORITY                                                     */
  MEMCPY0_CTRL_PRIORITY_LOW            = 0,     /*!< LOW : Low Priority (service as best effort)                               */
  MEMCPY0_CTRL_PRIORITY_HIGH           = 1,     /*!< HIGH : High Priority (service immediately)                                */
} MEMCPY0_CTRL_PRIORITY_Enum;

/* ==============================================  MEMCPY0 CTRL ENABLE [0..0]  =============================================== */
typedef enum {                                  /*!< MEMCPY0_CTRL_ENABLE                                                       */
  MEMCPY0_CTRL_ENABLE_DIS              = 0,     /*!< DIS : Disable MEMCPY Function                                             */
  MEMCPY0_CTRL_ENABLE_EN               = 1,     /*!< EN : Enable HW controlled MEMCPY function.                                */
} MEMCPY0_CTRL_ENABLE_Enum;

/* ========================================================  STATUS  ========================================================= */
/* ========================================================  SRCADDR  ======================================================== */
/* =======================================================  TARGADDR  ======================================================== */
/* =======================================================  TOTCOUNT  ======================================================== */
/* ========================================================  BCOUNT  ========================================================= */
/* ========================================================  CURSRC  ========================================================= */
/* ========================================================  CURDST  ========================================================= */
/* =======================================================  CURCOUNT  ======================================================== */


/* =========================================================================================================================== */
/* ================                                           MRAM                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  STATUS  ========================================================= */
/* =============================================  MRAM STATUS ADDRERROR [1..1]  ============================================== */
typedef enum {                                  /*!< MRAM_STATUS_ADDRERROR                                                     */
  MRAM_STATUS_ADDRERROR_VALID          = 0,     /*!< VALID : The last address written to WRADDR was valid.                     */
  MRAM_STATUS_ADDRERROR_INVALID        = 1,     /*!< INVALID : Invalid address written to WRADDR.                              */
} MRAM_STATUS_ADDRERROR_Enum;

/* ================================================  MRAM STATUS BUSY [0..0]  ================================================ */
typedef enum {                                  /*!< MRAM_STATUS_BUSY                                                          */
  MRAM_STATUS_BUSY_IDLE                = 0,     /*!< IDLE : MRAM controller is idle and ready for a new command.               */
  MRAM_STATUS_BUSY_MRAMBUSY            = 1,     /*!< MRAMBUSY : MRAM controller is processing an operation.                    */
} MRAM_STATUS_BUSY_Enum;

/* =========================================================  CTRL  ========================================================== */
/* ================================================  MRAM CTRL GENCMD [3..3]  ================================================ */
typedef enum {                                  /*!< MRAM_CTRL_GENCMD                                                          */
  MRAM_CTRL_GENCMD_TERMINATE           = 0,     /*!< TERMINATE : Terminate the programming operation.                          */
  MRAM_CTRL_GENCMD_GO                  = 1,     /*!< GO : Initiate a programming operation to flash data.                      */
} MRAM_CTRL_GENCMD_Enum;

/* ===============================================  MRAM CTRL PROGRAM [2..2]  ================================================ */
typedef enum {                                  /*!< MRAM_CTRL_PROGRAM                                                         */
  MRAM_CTRL_PROGRAM_TERMINATE          = 0,     /*!< TERMINATE : Terminate the programming operation.                          */
  MRAM_CTRL_PROGRAM_GO                 = 1,     /*!< GO : Initiate a programming operation to flash data.                      */
} MRAM_CTRL_PROGRAM_Enum;

/* ===============================================  MRAM CTRL CLRLOAD [1..1]  ================================================ */
typedef enum {                                  /*!< MRAM_CTRL_CLRLOAD                                                         */
  MRAM_CTRL_CLRLOAD_GO                 = 1,     /*!< GO : Initiate a programming operation to flash info.                      */
} MRAM_CTRL_CLRLOAD_Enum;

/* =================================================  MRAM CTRL LOAD [0..0]  ================================================= */
typedef enum {                                  /*!< MRAM_CTRL_LOAD                                                            */
  MRAM_CTRL_LOAD_GO                    = 1,     /*!< GO : Initiate a programming operation to flash info.                      */
} MRAM_CTRL_LOAD_Enum;

