AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
/* =============================================  MSPI0 DEV1CFG CPOL1 [15..15]  ============================================== */
typedef enum {                                  /*!< MSPI0_DEV1CFG_CPOL1                                                       */
  MSPI0_DEV1CFG_CPOL1_LOW              = 0,     /*!< LOW : Clock inactive state is low.                                        */
  MSPI0_DEV1CFG_CPOL1_HIGH             = 1,     /*!< HIGH : Clock inactive state is high.                                      */
} MSPI0_DEV1CFG_CPOL1_Enum;

/* =============================================  MSPI0 DEV1CFG CPHA1 [14..14]  ============================================== */
typedef enum {                                  /*!< MSPI0_DEV1CFG_CPHA1                                                       */
  MSPI0_DEV1CFG_CPHA1_MIDDLE           = 0,     /*!< MIDDLE : Clock toggles in middle of data bit.                             */
  MSPI0_DEV1CFG_CPHA1_START            = 1,     /*!< START : Clock toggles at start of data bit.                               */
} MSPI0_DEV1CFG_CPHA1_Enum;

/* =============================================  MSPI0 DEV1CFG DEVCFG1 [0..3]  ============================================== */
typedef enum {                                  /*!< MSPI0_DEV1CFG_DEVCFG1                                                     */
  MSPI0_DEV1CFG_DEVCFG1_SERIAL0        = 1,     /*!< SERIAL0 : Single bit SPI flash on chip select 0                           */
  MSPI0_DEV1CFG_DEVCFG1_SERIAL1        = 2,     /*!< SERIAL1 : Single bit SPI flash on chip select 1                           */
  MSPI0_DEV1CFG_DEVCFG1_DUAL0          = 5,     /*!< DUAL0 : Dual SPI flash on chip select 0                                   */
  MSPI0_DEV1CFG_DEVCFG1_DUAL1          = 6,     /*!< DUAL1 : Dual bit SPI flash on chip select 1                               */
  MSPI0_DEV1CFG_DEVCFG1_QUAD0          = 9,     /*!< QUAD0 : Quad SPI flash on chip select 0                                   */
  MSPI0_DEV1CFG_DEVCFG1_QUAD1          = 10,    /*!< QUAD1 : Quad SPI flash on chip select 1                                   */
  MSPI0_DEV1CFG_DEVCFG1_OCTAL0         = 13,    /*!< OCTAL0 : Octal SPI flash on chip select 0                                 */
  MSPI0_DEV1CFG_DEVCFG1_OCTAL1         = 14,    /*!< OCTAL1 : Octal SPI flash on chip select 1                                 */
  MSPI0_DEV1CFG_DEVCFG1_QUADPAIRED     = 15,    /*!< QUADPAIRED : Dual Quad SPI flash on chip selects 0/1.                     */
  MSPI0_DEV1CFG_DEVCFG1_QUADPAIRED_SERIAL = 3,  /*!< QUADPAIRED_SERIAL : Dual Quad SPI flash on chip selects 0/1,
                                                     but transmit in serial mode for initialization operations                 */
} MSPI0_DEV1CFG_DEVCFG1_Enum;

/* ========================================================  DEV1DDR  ======================================================== */
/* ========================================================  DEV1XIP  ======================================================== */
/* ============================================  MSPI0 DEV1XIP XIPMIXED1 [8..10]  ============================================ */
typedef enum {                                  /*!< MSPI0_DEV1XIP_XIPMIXED1                                                   */
  MSPI0_DEV1XIP_XIPMIXED1_NORMAL       = 0,     /*!< NORMAL : Transfers all proceed using the settings in DEVCFG
                                                     register (everything in the same data rate)                               */
  MSPI0_DEV1XIP_XIPMIXED1_D2           = 1,     /*!< D2 : Data operations proceed in dual data rate                            */
  MSPI0_DEV1XIP_XIPMIXED1_AD2          = 3,     /*!< AD2 : Address and Data operations proceed in dual data rate               */
  MSPI0_DEV1XIP_XIPMIXED1_D4           = 5,     /*!< D4 : Data operations proceed in quad data rate                            */
  MSPI0_DEV1XIP_XIPMIXED1_AD4          = 7,     /*!< AD4 : Address and Data operations proceed in quad data rate               */
} MSPI0_DEV1XIP_XIPMIXED1_Enum;

/* =============================================  MSPI0 DEV1XIP XIPACK1 [2..3]  ============================================== */
typedef enum {                                  /*!< MSPI0_DEV1XIP_XIPACK1                                                     */
  MSPI0_DEV1XIP_XIPACK1_NOACK          = 0,     /*!< NOACK : No acknowledege sent. Data IOs are tristated the first
                                                     turnaround cycle                                                          */
  MSPI0_DEV1XIP_XIPACK1_ACK            = 2,     /*!< ACK : Positive acknowledege sent. Data IOs are driven to 0 the
                                                     first turnaround cycle to acknowledge XIP mode                            */
  MSPI0_DEV1XIP_XIPACK1_TERMINATE      = 3,     /*!< TERMINATE : Negative acknowledege sent. Data IOs are driven
                                                     to 1 the first turnaround cycle to terminate XIP mode.
                                                     XIPSENDI should be reenabled for the next transfer                        */
} MSPI0_DEV1XIP_XIPACK1_Enum;

/* =======================================================  DEV1INSTR  ======================================================= */
/* =====================================================  DEV1BOUNDARY  ====================================================== */
/* =========================================  MSPI0 DEV1BOUNDARY DMABOUND1 [12..15]  ========================================= */
typedef enum {                                  /*!< MSPI0_DEV1BOUNDARY_DMABOUND1                                              */
  MSPI0_DEV1BOUNDARY_DMABOUND1_NONE    = 0,     /*!< NONE : Disable DMA address boundary breaks                                */
  MSPI0_DEV1BOUNDARY_DMABOUND1_BREAK32 = 1,     /*!< BREAK32 : Break at 32 byte boundary (0x20 increments)                     */
  MSPI0_DEV1BOUNDARY_DMABOUND1_BREAK64 = 2,     /*!< BREAK64 : Break at 64 byte boundary (0x40 increments)                     */
  MSPI0_DEV1BOUNDARY_DMABOUND1_BREAK128 = 3,    /*!< BREAK128 : Break at 128 byte boundary (0x80 increments)                   */
  MSPI0_DEV1BOUNDARY_DMABOUND1_BREAK256 = 4,    /*!< BREAK256 : Break at 256 byte boundary (0x100 increments)                  */
  MSPI0_DEV1BOUNDARY_DMABOUND1_BREAK512 = 5,    /*!< BREAK512 : Break at 512 byte boundary (0x200 increments)                  */
  MSPI0_DEV1BOUNDARY_DMABOUND1_BREAK1K = 6,     /*!< BREAK1K : Break at 1KB boundary (0x400 increments)                        */
  MSPI0_DEV1BOUNDARY_DMABOUND1_BREAK2K = 7,     /*!< BREAK2K : Break at 2KB boundary (0x800 increments)                        */
  MSPI0_DEV1BOUNDARY_DMABOUND1_BREAK4K = 8,     /*!< BREAK4K : Break at 4KB boundary (0x1000 increments)                       */
  MSPI0_DEV1BOUNDARY_DMABOUND1_BREAK8K = 9,     /*!< BREAK8K : Break at 8KB boundary (0x2000 increments)                       */
  MSPI0_DEV1BOUNDARY_DMABOUND1_BREAK16K = 10,   /*!< BREAK16K : Break at 16KB boundary (0x4000 increments)                     */
} MSPI0_DEV1BOUNDARY_DMABOUND1_Enum;

