AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
/* ==============================================  PDM0 CORECFG0 PGAL [21..25]  ============================================== */
typedef enum {                                  /*!< PDM0_CORECFG0_PGAL                                                        */
  PDM0_CORECFG0_PGAL_M12_0DB           = 0,     /*!< M12_0DB : Left channel PGA gain = -12.0 dB                                */
  PDM0_CORECFG0_PGAL_M10_5DB           = 1,     /*!< M10_5DB : Left channel PGA gain = -10.5 dB                                */
  PDM0_CORECFG0_PGAL_M9_0DB            = 2,     /*!< M9_0DB : Left channel PGA gain = -9.0 dB                                  */
  PDM0_CORECFG0_PGAL_M7_5DB            = 3,     /*!< M7_5DB : Left channel PGA gain = -7.5 dB                                  */
  PDM0_CORECFG0_PGAL_M6_0DB            = 4,     /*!< M6_0DB : Left channel PGA gain = -6.0 dB                                  */
  PDM0_CORECFG0_PGAL_M4_5DB            = 5,     /*!< M4_5DB : Left channel PGA gain = -4.5 dB                                  */
  PDM0_CORECFG0_PGAL_M3_0DB            = 6,     /*!< M3_0DB : Left channel PGA gain = -3.0 dB                                  */
  PDM0_CORECFG0_PGAL_M1_5DB            = 7,     /*!< M1_5DB : Left channel PGA gain = -1.5 dB                                  */
  PDM0_CORECFG0_PGAL_0DB               = 8,     /*!< 0DB : Left channel PGA gain = 0 DB                                        */
  PDM0_CORECFG0_PGAL_P1_5DB            = 9,     /*!< P1_5DB : Left channel PGA gain = 1.5 dB                                   */
  PDM0_CORECFG0_PGAL_P3_0DB            = 10,    /*!< P3_0DB : Left channel PGA gain = 3.0 dB                                   */
  PDM0_CORECFG0_PGAL_P4_5DB            = 11,    /*!< P4_5DB : Left channel PGA gain = 4.5 dB                                   */
  PDM0_CORECFG0_PGAL_P6_0DB            = 12,    /*!< P6_0DB : Left channel PGA gain = 6.0 DB                                   */
  PDM0_CORECFG0_PGAL_P7_5DB            = 13,    /*!< P7_5DB : Left channel PGA gain = 7.5 dB                                   */
  PDM0_CORECFG0_PGAL_P9_0DB            = 14,    /*!< P9_0DB : Left channel PGA gain = 9.0 dB                                   */
  PDM0_CORECFG0_PGAL_P10_5DB           = 15,    /*!< P10_5DB : Left channel PGA gain = 10.5 dB                                 */
  PDM0_CORECFG0_PGAL_P12_0DB           = 16,    /*!< P12_0DB : Left channel PGA gain = 12.0 DB                                 */
  PDM0_CORECFG0_PGAL_P13_5DB           = 17,    /*!< P13_5DB : Left channel PGA gain = 13.5 dB                                 */
  PDM0_CORECFG0_PGAL_P15_0DB           = 18,    /*!< P15_0DB : Left channel PGA gain = 15.0 dB                                 */
  PDM0_CORECFG0_PGAL_P16_5DB           = 19,    /*!< P16_5DB : Left channel PGA gain = 16.5 dB                                 */
  PDM0_CORECFG0_PGAL_P18_0DB           = 20,    /*!< P18_0DB : Left channel PGA gain = 18.0 DB                                 */
  PDM0_CORECFG0_PGAL_P19_5DB           = 21,    /*!< P19_5DB : Left channel PGA gain = 19.5 dB                                 */
  PDM0_CORECFG0_PGAL_P21_0DB           = 22,    /*!< P21_0DB : Left channel PGA gain = 21.0 dB                                 */
  PDM0_CORECFG0_PGAL_P22_5DB           = 23,    /*!< P22_5DB : Left channel PGA gain = 22.5 dB                                 */
  PDM0_CORECFG0_PGAL_P24_0DB           = 24,    /*!< P24_0DB : Left channel PGA gain = 24.0 DB                                 */
  PDM0_CORECFG0_PGAL_P25_5DB           = 25,    /*!< P25_5DB : Left channel PGA gain = 25.5 dB                                 */
  PDM0_CORECFG0_PGAL_P27_0DB           = 26,    /*!< P27_0DB : Left channel PGA gain = 27.0 dB                                 */
  PDM0_CORECFG0_PGAL_P28_5DB           = 27,    /*!< P28_5DB : Left channel PGA gain = 28.5 dB                                 */
  PDM0_CORECFG0_PGAL_P30_0DB           = 28,    /*!< P30_0DB : Left channel PGA gain = 30.0 DB                                 */
  PDM0_CORECFG0_PGAL_P31_5DB           = 29,    /*!< P31_5DB : Left channel PGA gain = 31.5 dB                                 */
  PDM0_CORECFG0_PGAL_P33_0DB           = 30,    /*!< P33_0DB : Left channel PGA gain = 33.0 dB                                 */
  PDM0_CORECFG0_PGAL_P34_5DB           = 31,    /*!< P34_5DB : Left channel PGA gain = 34.5 dB                                 */
} PDM0_CORECFG0_PGAL_Enum;

/* ============================================  PDM0 CORECFG0 MCLKDIV [10..13]  ============================================= */
typedef enum {                                  /*!< PDM0_CORECFG0_MCLKDIV                                                     */
  PDM0_CORECFG0_MCLKDIV_DIV1           = 0,     /*!< DIV1 : PDMA_CK0 = FMCLK / 1                                               */
  PDM0_CORECFG0_MCLKDIV_DIV2           = 1,     /*!< DIV2 : PDMA_CK0 = FMCLK / 2                                               */
  PDM0_CORECFG0_MCLKDIV_DIV3           = 2,     /*!< DIV3 : PDMA_CK0 = FMCLK / 3                                               */
  PDM0_CORECFG0_MCLKDIV_DIV4           = 3,     /*!< DIV4 : PDMA_CK0 = FMCLK / 4                                               */
  PDM0_CORECFG0_MCLKDIV_DIV5           = 4,     /*!< DIV5 : PDMA_CK0 = FMCLK / 5                                               */
  PDM0_CORECFG0_MCLKDIV_DIV6           = 5,     /*!< DIV6 : PDMA_CK0 = FMCLK / 6                                               */
  PDM0_CORECFG0_MCLKDIV_DIV7           = 6,     /*!< DIV7 : PDMA_CK0 = FMCLK / 7                                               */
  PDM0_CORECFG0_MCLKDIV_DIV8           = 7,     /*!< DIV8 : PDMA_CK0 = FMCLK / 8                                               */
  PDM0_CORECFG0_MCLKDIV_DIV9           = 8,     /*!< DIV9 : PDMA_CK0 = FMCLK / 9                                               */
  PDM0_CORECFG0_MCLKDIV_DIV10          = 9,     /*!< DIV10 : PDMA_CK0 = FMCLK / 10                                             */
  PDM0_CORECFG0_MCLKDIV_DIV11          = 10,    /*!< DIV11 : PDMA_CK0 = FMCLK / 11                                             */
  PDM0_CORECFG0_MCLKDIV_DIV12          = 11,    /*!< DIV12 : PDMA_CK0 = FMCLK / 12                                             */
  PDM0_CORECFG0_MCLKDIV_DIV13          = 12,    /*!< DIV13 : PDMA_CK0 = FMCLK / 13                                             */
  PDM0_CORECFG0_MCLKDIV_DIV14          = 13,    /*!< DIV14 : PDMA_CK0 = FMCLK / 14                                             */
  PDM0_CORECFG0_MCLKDIV_DIV15          = 14,    /*!< DIV15 : PDMA_CK0 = FMCLK / 15                                             */
  PDM0_CORECFG0_MCLKDIV_DIV16          = 15,    /*!< DIV16 : PDMA_CK0 = FMCLK / 16                                             */
} PDM0_CORECFG0_MCLKDIV_Enum;

