AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
/* ============================================  SDIO INTSIG CMDTOERREN [16..16]  ============================================ */
typedef enum {                                  /*!< SDIO_INTSIG_CMDTOERREN                                                    */
  SDIO_INTSIG_CMDTOERREN_MASKED        = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_CMDTOERREN_ENABLED       = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_CMDTOERREN_Enum;

/* ==============================================  SDIO INTSIG FIXED0 [15..15]  ============================================== */
typedef enum {                                  /*!< SDIO_INTSIG_FIXED0                                                        */
  SDIO_INTSIG_FIXED0_MASKED            = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_FIXED0_ENABLED           = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_FIXED0_Enum;

/* =============================================  SDIO INTSIG BOOTTERM [14..14]  ============================================= */
typedef enum {                                  /*!< SDIO_INTSIG_BOOTTERM                                                      */
  SDIO_INTSIG_BOOTTERM_MASKED          = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_BOOTTERM_ENABLED         = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_BOOTTERM_Enum;

/* ============================================  SDIO INTSIG BOOTACKEN [13..13]  ============================================= */
typedef enum {                                  /*!< SDIO_INTSIG_BOOTACKEN                                                     */
  SDIO_INTSIG_BOOTACKEN_MASKED         = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_BOOTACKEN_ENABLED        = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_BOOTACKEN_Enum;

/* ==========================================  SDIO INTSIG RETUNEEVENTEN [12..12]  =========================================== */
typedef enum {                                  /*!< SDIO_INTSIG_RETUNEEVENTEN                                                 */
  SDIO_INTSIG_RETUNEEVENTEN_MASKED     = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_RETUNEEVENTEN_ENABLED    = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_RETUNEEVENTEN_Enum;

/* ==============================================  SDIO INTSIG INTCEN [11..11]  ============================================== */
typedef enum {                                  /*!< SDIO_INTSIG_INTCEN                                                        */
  SDIO_INTSIG_INTCEN_MASKED            = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_INTCEN_ENABLED           = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_INTCEN_Enum;

/* ==============================================  SDIO INTSIG INTBEN [10..10]  ============================================== */
typedef enum {                                  /*!< SDIO_INTSIG_INTBEN                                                        */
  SDIO_INTSIG_INTBEN_MASKED            = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_INTBEN_ENABLED           = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_INTBEN_Enum;

/* ===============================================  SDIO INTSIG INTAEN [9..9]  =============================================== */
typedef enum {                                  /*!< SDIO_INTSIG_INTAEN                                                        */
  SDIO_INTSIG_INTAEN_MASKED            = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_INTAEN_ENABLED           = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_INTAEN_Enum;

/* =============================================  SDIO INTSIG CARDINTEN [8..8]  ============================================== */
typedef enum {                                  /*!< SDIO_INTSIG_CARDINTEN                                                     */
  SDIO_INTSIG_CARDINTEN_MASKED         = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_CARDINTEN_ENABLED        = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_CARDINTEN_Enum;

/* ===========================================  SDIO INTSIG CARDREMOVALEN [7..7]  ============================================ */
typedef enum {                                  /*!< SDIO_INTSIG_CARDREMOVALEN                                                 */
  SDIO_INTSIG_CARDREMOVALEN_MASKED     = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_CARDREMOVALEN_ENABLED    = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_CARDREMOVALEN_Enum;

/* ============================================  SDIO INTSIG CARDINSERTEN [6..6]  ============================================ */
typedef enum {                                  /*!< SDIO_INTSIG_CARDINSERTEN                                                  */
  SDIO_INTSIG_CARDINSERTEN_MASKED      = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_CARDINSERTEN_ENABLED     = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_CARDINSERTEN_Enum;

