AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r4/sdk/CMSIS/AmbiqMicro/Include/apollo4_generic.h
/* ==================================================  UART0 FR DSR [1..1]  ================================================== */
typedef enum {                                  /*!< UART0_FR_DSR                                                              */
  UART0_FR_DSR_READY                   = 1,     /*!< READY : Data set ready.                                                   */
} UART0_FR_DSR_Enum;

/* ==================================================  UART0 FR CTS [0..0]  ================================================== */
typedef enum {                                  /*!< UART0_FR_CTS                                                              */
  UART0_FR_CTS_CLEARTOSEND             = 1,     /*!< CLEARTOSEND : Clear to send is indicated.                                 */
} UART0_FR_CTS_Enum;

/* =========================================================  ILPR  ========================================================== */
/* =========================================================  IBRD  ========================================================== */
/* =========================================================  FBRD  ========================================================== */
/* =========================================================  LCRH  ========================================================== */
/* ==========================================================  CR  =========================================================== */
/* ================================================  UART0 CR CLKSEL [4..6]  ================================================= */
typedef enum {                                  /*!< UART0_CR_CLKSEL                                                           */
  UART0_CR_CLKSEL_NOCLK                = 0,     /*!< NOCLK : No UART clock. This is the low power default.                     */
  UART0_CR_CLKSEL_24MHZ                = 1,     /*!< 24MHZ : 24 MHz clock.                                                     */
  UART0_CR_CLKSEL_12MHZ                = 2,     /*!< 12MHZ : 12 MHz clock.                                                     */
  UART0_CR_CLKSEL_6MHZ                 = 3,     /*!< 6MHZ : 6 MHz clock.                                                       */
  UART0_CR_CLKSEL_3MHZ                 = 4,     /*!< 3MHZ : 3 MHz clock.                                                       */
  UART0_CR_CLKSEL_48MHZ                = 5,     /*!< 48MHZ : Reserved.                                                         */
} UART0_CR_CLKSEL_Enum;

/* =========================================================  IFLS  ========================================================== */
/* ==========================================================  IER  ========================================================== */
/* ==========================================================  IES  ========================================================== */
/* ==========================================================  MIS  ========================================================== */
/* ==========================================================  IEC  ========================================================== */


/* =========================================================================================================================== */
/* ================                                          USBPHY                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  REG00  ========================================================= */
/* =========================================================  REG04  ========================================================= */
/* =========================================================  REG08  ========================================================= */
/* =========================================================  REG0C  ========================================================= */
/* =========================================================  REG10  ========================================================= */
/* =========================================================  REG14  ========================================================= */
/* =========================================================  REG18  ========================================================= */
/* =========================================================  REG1C  ========================================================= */
/* =========================================================  REG20  ========================================================= */
/* =========================================================  REG24  ========================================================= */
/* =========================================================  REG28  ========================================================= */
/* =========================================================  REG2C  ========================================================= */
/* =========================================================  REG30  ========================================================= */
/* =========================================================  REG34  ========================================================= */
/* =========================================================  REG38  ========================================================= */
/* =========================================================  REG3C  ========================================================= */
/* =========================================================  REG40  ========================================================= */
/* =========================================================  REG44  ========================================================= */
/* =========================================================  REG48  ========================================================= */
/* =========================================================  REG4C  ========================================================= */
/* =========================================================  REG50  ========================================================= */
/* =========================================================  REG54  ========================================================= */
/* =========================================================  REG58  ========================================================= */
/* =========================================================  REG5C  ========================================================= */
/* =========================================================  REG60  ========================================================= */
/* =========================================================  REG64  ========================================================= */
/* =========================================================  REG68  ========================================================= */
/* =========================================================  REG6C  ========================================================= */
/* =========================================================  REG70  ========================================================= */
/* =========================================================  REG74  ========================================================= */
/* =========================================================  REG78  ========================================================= */
/* =========================================================  REG7C  ========================================================= */
/* =========================================================  REG80  ========================================================= */
/* =========================================================  REG84  ========================================================= */


/* =========================================================================================================================== */
/* ================                                            USB                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CFG0  ========================================================== */
/* =========================================================  CFG1  ========================================================== */
/* =========================================================  CFG2  ========================================================== */
/* =========================================================  CFG3  ========================================================== */
/* =========================================================  IDX0  ========================================================== */
/* =========================================================  IDX1  ========================================================== */
/* =========================================================  IDX2  ========================================================== */
/* ========================================================  FIFOADD  ======================================================== */
/* =========================================================  FIFO0  ========================================================= */
/* =========================================================  FIFO1  ========================================================= */
/* =========================================================  FIFO2  ========================================================= */
/* =========================================================  FIFO3  ========================================================= */
/* =========================================================  FIFO4  ========================================================= */
/* =========================================================  FIFO5  ========================================================= */
/* ========================================================  HWVERS  ========================================================= */
/* =========================================================  INFO  ========================================================== */
/* =======================================================  TIMEOUT1  ======================================================== */
/* =======================================================  TIMEOUT2  ======================================================== */
/* ========================================================  CLKCTRL  ======================================================== */
/* =======================================================  SRAMCTRL  ======================================================== */
/* ===============================================  USB SRAMCTRL RAWLM [7..8]  =============================================== */
typedef enum {                                  /*!< USB_SRAMCTRL_RAWLM                                                        */
  USB_SRAMCTRL_RAWLM_INCDLY            = 3,     /*!< INCDLY : Increased margin adjustment, increased delay for enabling
                                                     write assist.                                                             */
  USB_SRAMCTRL_RAWLM_MBINCDLY          = 2,     /*!< MBINCDLY : Minimum boost level with increased delay for enabling
                                                     write assist.                                                             */
  USB_SRAMCTRL_RAWLM_IMNB              = 1,     /*!< IMNB : Increased margin adjustment with more negative boost.              */
  USB_SRAMCTRL_RAWLM_MMNB              = 0,     /*!< MMNB : Minimum margin adjustment with lowest negative boost
                                                     level.                                                                    */
} USB_SRAMCTRL_RAWLM_Enum;

/* ===================================================  UTMISTICKYSTATUS  ==================================================== */
/* =======================================  USB UTMISTICKYSTATUS obsportstciky [0..1]  ======================================= */
typedef enum {                                  /*!< USB_UTMISTICKYSTATUS_obsportstciky                                        */
  USB_UTMISTICKYSTATUS_obsportstciky_OBS3 = 3,  /*!< OBS3 : bit 1:HS BIST results, bit 0:FS BIST results                       */
  USB_UTMISTICKYSTATUS_obsportstciky_OBS2 = 2,  /*!< OBS2 : bit 1: ODT calibration state, bit 0: Current calibration
                                                     state                                                                     */
  USB_UTMISTICKYSTATUS_obsportstciky_OBS1 = 1,  /*!< OBS1 : bit 1: Rx squelch signal, bit 0: Rx datap                          */
  USB_UTMISTICKYSTATUS_obsportstciky_OBS0 = 0,  /*!< OBS0 : bit 1: PLL lock signal, bit 0: Host Disconnect                     */
} USB_UTMISTICKYSTATUS_obsportstciky_Enum;

